[{"sentence1": "Round 2: lost - mostly against myself...  drop! Had 5 mulligans in 4 games AND played like shit", "label": "negative"}, {"sentence1": "had a good day ", "label": "positive"}, {"sentence1": "says , Karine Ruby died.  That's so sad. http://plurk.com/p/x3vvg", "label": "negative"}, {"sentence1": "@jamie_oliver nice comp.. shame some people can;t access your site due to the main hosting company being on a spam list ", "label": "negative"}, {"sentence1": "@shaggieshapiro Nahhh, not this weekend. Chill (how do the teens say it? Chillaxin'!!) 2morrow &amp; baby nephew's Christening on Sun. ", "label": "positive"}, {"sentence1": "Opa!! Greeks love blondes-haha-rarity!! I'll take it!! ", "label": "positive"}, {"sentence1": "last day in la la land.  bummer  ", "label": "negative"}, {"sentence1": "history finals today. one more week left of school! ", "label": "positive"}, {"sentence1": "Just watched new Star Trek movie.  They messed with everything - It was wonderful!!!  Hope they make an alternate reality series ", "label": "positive"}, {"sentence1": "@julescavalier ha no worries I love you NorCals muchly since SF=loveofmylifegah!! ", "label": "positive"}, {"sentence1": "the fever is killing me... @Racheloo your sister could be a singer whe she is grown up later.. she has a gift ", "label": "positive"}, {"sentence1": "@tommcfly I'm sure if they are real fans they won't be disappointed with you guys. They will understand that was not ur fault. ", "label": "positive"}, {"sentence1": "@Omagus Yeah, I missed that too.  But mostly because it would've required some tricks to get it up here to Canada", "label": "negative"}, {"sentence1": "Left my shoes in St. Louis ", "label": "negative"}, {"sentence1": "@tommcfly apparently whoever said that must live under a rock / not have twitter. ", "label": "positive"}, {"sentence1": "Had my computer for less than an hour before breaking it. That must be a record. Leave it to me. ", "label": "negative"}, {"sentence1": "@siahwalker I wish we could see you guys  but of course. No Utah dates. You hate us.", "label": "negative"}, {"sentence1": "@sharakarasic Ouch! I'm the same way. Gotta remember to cut the Vit C a week before the dentist visit. Interferes w/drugs ", "label": "negative"}, {"sentence1": "Arrived in Sofia. Have a whole day of lazy before me ", "label": "positive"}, {"sentence1": "at school in sose but very bored. I want my whistle back Kelly  and agree with charlieskies", "label": "negative"}, {"sentence1": "got access to a PIX firewall ", "label": "positive"}, {"sentence1": "Perfectly ripe and fresh banana goes in the bag.. Arrive at office, it looks like it has been hit by a freight train. Poor banana ", "label": "negative"}, {"sentence1": "@missyjule Fell asleep after, time for sun now ", "label": "positive"}, {"sentence1": "@dogwalker73 Awww, Thanks Robin.   It is pretty cool that I finally got to meet my two favorites.  I wanna do it again! ", "label": "positive"}, {"sentence1": "@BigMem We'll still be here probably as @rutty_uk's car has a flat tyre. ", "label": "negative"}, {"sentence1": "I hate my knees ", "label": "negative"}, {"sentence1": "soo much work to do. but all i want to do is sleep. ", "label": "negative"}, {"sentence1": "hi @LUCIABLEUE ! I would suggest music of my electro project *** http://bit.ly/Nos9D *** free download &amp; have fun  cheers", "label": "positive"}, {"sentence1": "@NKOTBahamas2009 that's a great story  Donnie seems like a real sweet person =]", "label": "positive"}, {"sentence1": "I'm falling alseep.. eeks! @DeathKindler I love you, I really do.&lt;3 I guess I might talk to you June 1st, or you can call me anytime. ", "label": "positive"}, {"sentence1": " cant afford to see Angels and Demons, so i watched it for free: http://tr.im/lvBu", "label": "negative"}, {"sentence1": "I'm confused as to what to do with twitter haha ", "label": "negative"}]