[{"sentence1": " I need my handy dandy shooting hat.. I think that it should play a bigger role in my life.. The hat", "label": "negative"}, {"sentence1": "Monday is living up to its reputation  I think I will go to a talk about openstreetmap project tonight http://tinyurl.com/lpk6os", "label": "negative"}, {"sentence1": "@nikki_21 wow so sorry. That really sucks.  how r u a heavy user!?? I probabaly use more data than u", "label": "negative"}, {"sentence1": "whooops....my dad just got mad at me!!...i think he had the reason!!! i might listen to him if he listened all the things i have to say ", "label": "negative"}, {"sentence1": "i am now a proud owner of the sims 3 ", "label": "positive"}, {"sentence1": "is REALLY hurt right now! Guys suck ass! ", "label": "negative"}, {"sentence1": "@RadioWayne Sticker shock for pharms, that's rough ", "label": "negative"}, {"sentence1": "I feel like a group of us on twitter have been together for a long time  makes me happy. @nmelin, @almightyduff @nerdigirl @glasstrash etc", "label": "positive"}, {"sentence1": "going to the beach! ", "label": "positive"}, {"sentence1": "@Msveronica haha!!!watch half of it then run the house and then watch the second bit ", "label": "positive"}, {"sentence1": "@MeganDeniseFox wow... the food looks good though! ", "label": "positive"}, {"sentence1": "@YaliMarie lmfaoo I saw it thru my phone ", "label": "positive"}, {"sentence1": "@meowmistidawn YES! but i'm waaaay over on the other coast  i'll just fantasize about your slumber party instead ;)", "label": "negative"}, {"sentence1": "I've been abandoned with nothing to eat. ", "label": "negative"}, {"sentence1": "woooo goin shoppin woo wooo haha! woo! lolz! ", "label": "positive"}, {"sentence1": "@emrom moltes grï¿½cies! Jo ja m'he suscrit al vostre! ", "label": "positive"}, {"sentence1": "I WANTED TO BE NEAR HIM BUT I CAN'T BECAUSE SOMEBODY OWNS HIM NOW ", "label": "negative"}, {"sentence1": "Today I woke up in pain ", "label": "negative"}, {"sentence1": "I gag too much  my brother pressed into the vain in my wrist and i feel pretty pukey, wtf is wrong with me :/", "label": "negative"}, {"sentence1": "12:15 am? Never to late for a bubble bath! ", "label": "positive"}, {"sentence1": "Couldn't sleep..... Catchin up on Law N Order SVU.....Thank God for DVR baby ", "label": "positive"}, {"sentence1": "@mellalicious nice how these things turn out in the end. ", "label": "positive"}, {"sentence1": "Seems twitter's broken.  I can't follow new people at this time  was going to follow @NerdblurbEdgar ", "label": "negative"}, {"sentence1": "@ashleynikoole  - Love Your Hair , It makes the world feel like there was NEVER a hurricane katrina ", "label": "positive"}, {"sentence1": "@SweetTartelette Thank you for watching! ", "label": "positive"}, {"sentence1": "Waiting in the queue for Park + Ride yet again. Diffrence this time: it's raining ", "label": "negative"}, {"sentence1": "Gah, I've 2 massive spots/bites which have appeared on my cheek yesterday. Very painful and rather unsightly ", "label": "negative"}, {"sentence1": "had a great Mother's Day!  Very relaxing ", "label": "positive"}, {"sentence1": "@fortyfive_ds Thanks for the heads up. ", "label": "positive"}, {"sentence1": "Wanted to head to the star bar, but doesn't want to go alone.   I don't think Tim likes my friends.", "label": "negative"}, {"sentence1": "i got 1/4 of my world back. finally ", "label": "positive"}, {"sentence1": "i'm waiting at home with chelsea while @happyjodi takes AJ to the hospital cause he slit his eye open on the corner of the table ", "label": "negative"}]