[{"sentence1": "@nocas jï¿½ estou a ver que sim  , aqui - http://en.wikipedia.org/wiki/Mother's_day#Dates_around_the_world", "label": "positive"}, {"sentence1": "@ashlangorse Have fun!!  I can't wait to see that movie....but I have to wait 3 more days. ", "label": "negative"}, {"sentence1": "what happened to those happy little neon nu-rave kids? their reign of terror was bout as long as that of the hyper-color t-shirt. pity ", "label": "negative"}, {"sentence1": "@writesonoma sounds like ur the one feeling the vibes underfoot, YOU stay clear out of falling debris! peace  V nice weekend!", "label": "positive"}, {"sentence1": "@QuantumPeach I posted that article about the auto-follow Twitter tools today ~ http://ow.ly/aaXj ~ weekend/family stuff got in the way ", "label": "positive"}, {"sentence1": "@RHE27 same here!  i'm like craving.", "label": "negative"}, {"sentence1": "@MarahEuqor im gonna destroy the engine of the plane ur into so that ur flight will be posponed! ha! lol! xD dont leave us yet ", "label": "negative"}, {"sentence1": "watchin @DanMerriweather on gmtv! soundin good ", "label": "positive"}, {"sentence1": "@Sandywray ..Not seen much of it hear Sandy .. mv out here dude .. you may be cured after all  ", "label": "positive"}, {"sentence1": "Oh Noes! My darling lappy is very, very ill. I had to buy a new one just to get through the week. It's the ugly step-child I never wanted ", "label": "negative"}, {"sentence1": "is having coffee after a long walk in the woods with Finja  god I can't feel my legs .... lol,  my thoughts are flying to my special w ...", "label": "positive"}, {"sentence1": "@fancyjelly I could hear your cries of frustration all the way out here in the studio ", "label": "negative"}, {"sentence1": "Man, school starts again tomorow ", "label": "negative"}, {"sentence1": "@amandaxrae I hear the challenge on the show is everyone jumping into a giant cupcake. How fitting! Hangs soon. ", "label": "positive"}, {"sentence1": "Ready to start training again in the morning after a lovely week off (due to illness of course!).  Not looking 4ward to alarm at 4.30 ", "label": "negative"}, {"sentence1": "MMMM the smell of newly mown lawn - I have to make that boy something good for lunch  (DH - Gardener? I wish) LOL", "label": "positive"}]