[{"sentence1": "@rosehwang yeah i will try ", "label": "positive"}, {"sentence1": "@Space202020 yeah she promises not to tell him anything where he could find me! ", "label": "positive"}, {"sentence1": "@quixoticblazes I like the new blog  very journalistic layout. added to my RSS reader ;)", "label": "positive"}, {"sentence1": "goodd night my fellowwww tweeters!!!! good day today  write me muahhZ rtorres@ke-designz.com", "label": "positive"}, {"sentence1": "@AMPRGroup you're welcome! hope your day magically becomes better ", "label": "positive"}, {"sentence1": "@ katyperry i listing you sings hahaa are fantastic ", "label": "positive"}, {"sentence1": "@SongzYuuup tears are falling in case u cared ", "label": "negative"}, {"sentence1": "Dreading work ", "label": "negative"}, {"sentence1": "@zsoverman sent my tweet at 11:59  at least I won't miss a Sunday", "label": "positive"}, {"sentence1": "feels weird today ", "label": "negative"}, {"sentence1": "There just isn't pleasing some ppl.  truly sad but Ehh.", "label": "negative"}, {"sentence1": "@MissKiaNYC i vaguely remember making fries last yr and succeeding. I thought i could duplicate the success. but i was wrong ", "label": "negative"}, {"sentence1": "@holacattsays Enjoy YOUR educational lesson. ", "label": "positive"}, {"sentence1": "@MichFresse ugh I hear ya sister, also, I'm annoyed ubertwitter doesn't work on my phone ", "label": "negative"}, {"sentence1": "@bloggerheads Jacqui Smith to stand down as HS. WIN!!! Good luck keeping that seat next year  http://bit.ly/3z2Lzy", "label": "positive"}, {"sentence1": "Treburile se incing @myotherhand incepe discutii cu phlo_m facem live bloging ? ", "label": "positive"}, {"sentence1": "havin' a good old jiggle to groovy music ", "label": "positive"}, {"sentence1": "I forgot about these vids. http://bit.ly/3DBYC", "label": "positive"}, {"sentence1": "@Doll_Doll They scheduled for both nights! And I could only watch it last night. ", "label": "negative"}, {"sentence1": "DAMN YOU, NEW VAMPIRE ACADEMY COVERS! You made me think BLOOD PROMISE was already out, and then I had a MAHOR sad when that was not true. ", "label": "negative"}, {"sentence1": "up early on a sunday to go do french project. then perhaps do some shopping and get a new phone? ", "label": "positive"}, {"sentence1": "I don't feel like Twittering today. ", "label": "negative"}, {"sentence1": "#fastfollowfive @BastetAsshur @David_Kaufer @HeyAmaretto @mayaREguru @recr follow them cuz they r so entertaining ", "label": "positive"}, {"sentence1": "@dannybelize Nope.  Just relax and enjoy the day.  ", "label": "positive"}, {"sentence1": "8 dreams last night! 2 involved zombies  I did not enjoy those ones. Particularly the one that put me inside Resident Evil! *cries*", "label": "negative"}, {"sentence1": "really hates being single ", "label": "negative"}, {"sentence1": "GM: gigantic mess, giggling maniacs, government money, or got me! -they really did get me-I have a GM. ", "label": "negative"}, {"sentence1": "Oohok te location thingys abt 1 block off. Anywayyy MAJOR NO KIDDING NO JOKE craving for Singaporean hawker food  http://myloc.me/2M2A", "label": "negative"}, {"sentence1": "@PembrokeDave I'm good besides feeling a lot like one of the Bandwagoneers.  how's your room? Much better? ", "label": "positive"}, {"sentence1": "@JTheMachine oh...lol! Its cool. Yeah, I buy males drinks.   lol!", "label": "negative"}, {"sentence1": "so i decided 2 take a moment durin mah wii workout tyme and i saw the most upsettin news......WTF i shoulda stayed locked n ", "label": "negative"}, {"sentence1": "@IljaCoolen Thanks! Just used a therm to pry it out. Was like concrete! Blood and everything!  He's doing a lot better now. Thank god.", "label": "negative"}]