[{"sentence1": "I had heard good things, but even at the beginning it was awkward, because the Matre' de was trying to push us into a big family style dinner table we did not want.\n\nThe food was just \"okay' but far from great.", "label": 2}, {"sentence1": "Was a OK company, now in the last 3 months has turned evil.  Their data plans suck, better off going direct to ATT. You cannot reach a human voice unless you wait 30 mins.  Back to Net 10 for me.", "label": 2}, {"sentence1": "Biscuits amazing, sides amazing, half chicken amazing. Ribs......terrible. They were so dry we needed the sauce to make them edible. The first time I was there, they were great.I did let the server know they should tell the kitchen they were very dry, and he just blew it off.", "label": 2}, {"sentence1": "Beautiful location but the food is overpriced for a tiny burger and shake and a table you have to bus yourself. \n\nFor the money I'd go to 5 Guys, lunch here was $45 for 1 adult and 3 small kids.\n\nThe burger was tasty but not worth the money.", "label": 2}, {"sentence1": "Strange vibe. I had a bizarre experience as well. The lady followed me around the store and asked me if I was taking pictures!", "label": 2}, {"sentence1": "Worth to wait? Nah. I love ramen. Not only in US I had ramen in Japan. I visit new town or country I search for ramen place. That's how much i love ramen and out of my all countries ramen experience this was the least yum place for me. I read so many good reviews and expected a lot. And this..wasn't satisfying. Not only because i had too much expectation this just wasn't that great.. \nAlso too small restaurant that doesn't allow you to have private talk. You can literally hear the person next to you.", "label": 2}, {"sentence1": "Strike one: Their lemon soda (or whatever it's called) tasted like HEB Limeaid mixed with Sprite.\nStrike two: The used iceberg lettuce in their springrolls.\nStrike three: There were no peanuts to be found on their Pad Thai and very little chicken. It was mostly just oily.\n\nThat leaves just two stars. I don't care what my boyfriend says, we are never going back there.", "label": 2}, {"sentence1": "Service was very poor even with the use of the bell, had to beg for a refill of water...and kind of dirty in general... like grease and dust everywhere.... and WAY overpriced.  Maybe the service was bad because we were white? We weren't rude or needy... just regular peeps", "label": 2}, {"sentence1": "Breakfast tacos are an amazing idea and I wish I found out about these sooner. I stopped here back in March when visiting some friends and I loved this place. There's tons of different tacos and you can build your own as well. The price is cheap and they come out quickly. The coffee was about pretty good and the service was good overall. Definitely check this place out for breakfast when you're in Austin!", "label": 4}, {"sentence1": "This nails place has lots of colors to choose from. I was seated immediately but they seemed a little understaffed and I had to wait about 40 minutes for my pedicure on a Thursday in the middle of the day. However, the location and the staff are both very nice, and the atmosphere is very positive. I would recommend coming here for nails if you are already in the area, but don't go out of your way.", "label": 4}, {"sentence1": "They have the best pizza in town !! Service need some improvement but food was good. Try the pizzookie, it's so good !!", "label": 4}, {"sentence1": "Great food, great prices! Is usually quite busy so be prepared to wait! But it's usually worth the wait :)", "label": 4}, {"sentence1": "Every time I come to this location, I receive very good service and I never have to wait.", "label": 4}, {"sentence1": "So I know Steak and Shake isn't the best place, but it has a pretty good hamburger and a good, large shake at a decent price and neat atmosphere. And then I went to Mighty Fine Burgers...Great hamburger and possibly the best chocolate milkshake I've ever had and fries better than McDonald's and Steak and Shake's. All for $10.10. So it's a little more expensive, but definitely worth it. I so just wish the shake was bigger!\n\nAlso, the line is long at lunch time, but it moves pretty quickly.", "label": 4}, {"sentence1": "I Ordered Turkey wings with dressing, yellow rice, and broccoli cheese casserole. My partner ordered veggie plate with sweet potatoes, macaroni and cheese, and banana pudding. The wait is rather long on a Sunday afternoon. The food is on a food table where you are served while you look at it. Restaurant could definitely use some renovations/upgrades. Food was Good.", "label": 4}, {"sentence1": "Killer food and good selection of beer. Could have been a 5 if the server actually knew how to smile.", "label": 4}, {"sentence1": "Worst service of any restaurant I have ever been in. Waited 75 minutes for my food and by the time if came, it was cold and disgusting. Three other tables in the restaurant got fed up with the wait time and \"canceled\" orders or just got up and left. Should have know I was in for trouble when when there were plastic forks in the napkins. Once the food arrived it tasted good, although I am not sure if that was only because I was starving.Wouldn't be shocked if this place is out of business within the next month.", "label": 1}, {"sentence1": "This Firestone is quick to overprice for parts and services. Be on your guard and do your research before going here.", "label": 1}, {"sentence1": "First off I have to say the food was good. But...I went here with a group of friends one of which was allergic to pork. He was given a meal with pork and has spent all day sick because the restaurant was careless. The manager did not come to talk until after we had payed. The server did not charge him for his food which was nice but not enough considering the results of there carelessness.", "label": 1}, {"sentence1": "I think the reviews are too kind on here for this place.  Its a dated mannequin show with a short tour and explanation of some exhibits.  It wasn't for us, and I was glad when it was over.  the giftshop has some cool stuff, but this is a terrible tourist trap.  There must be something better in Salem, but we only had half a day to walk around and see the sights so... I hope you have better luck.", "label": 1}, {"sentence1": "Beware of advertised $10 eyebrow threading sign in front of the store. Make sure you observe the fine print as the price is for members only. I ended up paying 5x the price for eyebrow threading. A rip off really. I will not return.", "label": 1}, {"sentence1": "First, let me start by saying that this establishment should be embarrassed of the employees that represent them. Every Restaurant and Business has the right to refuse service to anyone, but refusing service for the sole reason that a person works construction is just sad. Very Disappointing. And this business should be ashamed of the lack they bring to the community.", "label": 1}, {"sentence1": "I tried to experience cinnaholic for the first time and as soon as I stepped in the door a young lady looked at me with an attitude and said, \"we're closed.\" However, as I just mentioned I was inside the building so the doors were not locked and it was not 10:00pm. I will try to go back on another day since I bought a Groupon, but if I didn't have the Groupon the customer service would be the reason for me to never return.", "label": 1}, {"sentence1": "Food isn't very good but wanted to see some games and it is close. On successive trips to see a game I've been told a whole bank of tvs don't work, that tvs are 'too tempramental' to change channels, and \"I don't know how this works\" (twice). Nice wait staff, mostly, cranky manager, mostly. Live two blocks, finally wrote nice note to owner explaining problems and got oh well, don't really care if you come back. We go elsewhere. Plenty of better options.", "label": 1}, {"sentence1": "Just finished  our excellent meal at Red Bird, yet another entry in the burgeoning Waltham restaurant  scene. She had the mussel appetizer, followed by the asparagus / pea soup with crabcake. I had the blackened salmon. What could have been better? Nothing. Food was prepared perfectly and served with confidence and elan by Pricilla.  Our new favorite place in our new home town.", "label": 5}, {"sentence1": "These guys are great. Professional, responsive, and trustworthy. Every person I interacted with, from the initial call to the air quality tester to the guys who did the remediation work - everyone was friendly, helpful, and knowledgeable. I felt totally at ease having them work on our house, and highly recommend them. \n\nWork we had done: air quality testing, mold remediation, air duct cleaning.", "label": 5}, {"sentence1": "Really great and healthy place to get an amazing meal for an excellent price.  I love the steak with pesto, brown rice, sweet potato and brussel sprouts.  So happy that Boston has a great quick and delicious take out (or casual eat in) place finally.", "label": 5}, {"sentence1": "The Good: Hipster to the core is right. Friendly, laid back cafe. Eclectic crowd and servers. Patio and indoor seating. Fresh and local ingredients. Solid portions. Refills on refills of iced coffee.. Even one to go! Plenty of options for breakfast. You can dabble with a few side options, hash-browns are a popular one. \n\nThe Bad: a bit of a wait, but it's expected on a Sunday morning hot spot. \n\nBottom line: Keep Austin weird .. & tasty", "label": 5}, {"sentence1": "A little food cart that did a great job! The lady's as friendly and patient and helpful. Timing was good too. I was very happy with the variety of selections and the taste. The cheese one is definitely a must to get. I will definitely come", "label": 5}, {"sentence1": "BEST CANNOLIS EVER! It can be super packed but service is quick and the people who work there are kind and patient. Cash only!", "label": 5}, {"sentence1": "Awesome pizza, great subs, great menu... This town has like 30 pizza places, I've tried a bunch of them and this place is my new go to hands down!", "label": 5}, {"sentence1": "There's a reason why I've gone here for 6 years. You get really high quality Indian food. It's amazing. All the food is reasonably priced, the food comes decently quick, and the portions are fairly sized.", "label": 5}, {"sentence1": "It's a cool place. Fun and inviting. Food is average. I ordered the sausage and broccoli rab starter. Tasted great and was super hot, however the Rab was literally 6-7\" long and very difficult to eat. Pizza was what many others have stated. Sparse. On a high note, great place to watch the game with a very impressive beer selection. They are new and still need to work out the kinks. Worth a try but it's a bar with pizza, lots of people do it! Up your game and you could be a hot spot in a pizza sufficient area.", "label": 3}, {"sentence1": "fun for kids\n\nnothing more to write about this. I had time left in my hand and I was allowed unlike Pteranodon flyers, so I rode it. it brought back childhood memories. seats ( horses/elephants or other animals) are bit higher and not sure how kids are going to climb on that. \nwhile it was in motion, seats were going up and down. waiting time was hardly 5 minutes. good memories though", "label": 3}, {"sentence1": "Not a bad little shop. One of of those really discounty looking places but actually the products aren't bad depending on your style.  \n\nAll clothing, including hipster plaid shirts, American Apparel, flip flops, and straight brim baseball caps (plus accessories like scarves and gloves),  All decent prices.\n\nIn my mind I imagine a tourist coming to Vancouver and either finding it is colder than expected (and need some gloves and a toque), or the opposite,.. not realizing the West End is verging on tropical at times and needing beachwear - then stumbling in here and being quite satisfied.", "label": 3}, {"sentence1": "I absolutely LOVE Carfagna's! I'm\nIn there almost 2-3 times a week. I will say I've never had any issues with the meatpackers. They're awesome and always very friendly and welcoming! I will say the older women at the registers have horrible customer service( so rude) they stand up there with their arms crossed and frowns on their face as if they don't want to be there  Just overall not very welcoming.", "label": 3}, {"sentence1": "The decor is great, the wait not so much, and the food isn't the best I've ever had. \n\nThe blood mary definitely hit the spot though.\n\nAnd they have green eggs and ham!", "label": 3}, {"sentence1": "Classic local dive bar. With $5 pints, a pool table and lots of gambling  machines, I'd say they're doing something right", "label": 3}, {"sentence1": "The atmosphere is just what you're looking for when it comes to a sports bar.  Plenty of TV's around showcasing all the current sports events.  Wait staff was nice although our waitress did forget about us for a few minutes and considering the other amount of clientele at the time I'm not sure how she could have forgotten about us.  The food was very tasty although some portions of certain dishes should be reconsidered - some to small for the price paid.  Overall we will likely go back again.", "label": 3}, {"sentence1": "Second time at the Mad Hatter, and the food has was hit or miss.  I ordered the meat-lover's omelet, which was excellent.  However, the bacon both in the omelet and on on our sides was not cooked enough, which was pretty unappetizing.  One of us ordered a burger, and it was relatively dry and flavorless, which was disappointing.\n\nFor some reason, the table was missing sugar and silverware.  The staff was pleasant and friendly.  There's probably better breakfast/lunch options nearby.", "label": 3}]