[{"sentence1": "A \"sports bar\" that doesn't buy the sports package. No SEC Network? Amateur hour.", "label": 2}, {"sentence1": "The pie was awesome - had the chocolate pecan for $5 a slice (a bit pricey), but the coffee was awful.  Had the house specialty of the caramello something or other.  It was mostly steamed milk, hardly no espresso, even though I ordered an extra shot.  Disappointed.  Probably won't go back here, at least not for coffee!", "label": 2}, {"sentence1": "Yeah I dont see what all the hype is about...I had the chicken szechuan w/ vegetable and rice and it was so low grade and lackluster that I didn't even finish it. My meal tasted like I ordered it from The Corner Mall food court...can't always trust positive reviews!", "label": 2}, {"sentence1": "The pizza is not terrible. I probably wouldn't go there sober, but it really hits the spot for late night food with almost no competition. That being said I can't stand that they don't give you tap water and instead charge $3 for a Poland spring bottle. It's outrageous.", "label": 2}, {"sentence1": "Wasn't impressed by the setup at this store. It gave the appearance of being very disorganized. There are better suit stores in Boston even of this same chain.", "label": 2}, {"sentence1": "Fair service, only problem is they consistently allow homeless people to sleep at the tables. Just one here tonight sleeping with a spilled sonic cup. Friendly staff.", "label": 2}, {"sentence1": "2 out of 4 meals at our table were terrible. Lasagne seemed like it was preheated frozen food, and the meat calzone was like left over pizza (with minimal cheap sandwich meats) barely filling a crusty burnt shell. Not very nice. Two pasta meals were adequate. Service was acceptable, decor and tables left a lot to be desired. Wouldnt recommend the place unfortunately.", "label": 2}, {"sentence1": "The breakfast is very good as is the price.  After going there frequently for about two months the attitude of the manager was wearing me down.  He doesn't want to be there and you can feel  it.  I have oped to go to Paul's down the street a little as the wait staff make you feel at home.  .", "label": 2}, {"sentence1": "Worst eggs Benedict I've ever had. Bland. On some kind of bread? What happened to English muffins? Dry potatoes. Just not good food. If you only do breakfast you'd think they'd be good at it. Wrong.", "label": 2}, {"sentence1": "The very next time time I come in to pick up an order, you better place my sandwiches in a bag, without me having to request the same, say \"thank you\", or I will contact corporate. Have a nice day and think about it.", "label": 2}, {"sentence1": "love the concept of this place.. and i really wanted to give a better review.. got hash and eggs, was never told they use sweet potatoes for their hash.. i do not like sweet potato and the hash was orange..  eggs were cold too.. coffee was good... server non existent.  this is one of those places that ( in my opinion ) tries really hard to be cutting edge with the menu.. and is forgetting the basics.", "label": 2}, {"sentence1": "Had lunch yesterday. Food is good but two major issues \n\n1. Really overpriced. 12 dollars for falafel pita. No sides\n\n2. Their only water option is Italian imported bottle water. Not only is it expensive but the fact that it is imported from Italy and bottled makes the environmentalist in me cringe.  \n\n3. It has nowhere to really sit that isn't outside which will be fine if the weather ever breaks. \n\nThe food is good but not good enough to overcome my issues.", "label": 2}, {"sentence1": "All I want to say is that \"They don't really care about us\"   Yes MJ no truer words were ever sung.  I've been to this location maybe about 3 times for take out orders & ever time I've come here instead of giving me what I wanted they give me what they want to make :( \n\nThere aren't a ton of things on the menu & i'm sure the cooks have made everyone of those items at least 5 times. Why can't I get what I ordered?", "label": 2}, {"sentence1": "Nothing was good here, everything was blah: decor, drinks, food, staff. It wasn't bad, but it wasn't good. It was plain. Well, not everything was plain; my pork dish was dry and overcooked, so that was pretty bad. Other than that, everything was bland (including the seasoning of the pork).", "label": 2}, {"sentence1": "Placed a pick up order at this location: Italian cheese, sausage and pepper pizza. The pizza was ready on time, the location was clean and service was friendly. The pizza was terrible. The crust was very thick and doughy, and had a peppery taste and the bottom of the pizza has small grainy seeds that added an unwelcome crunch to the pizza. Overall, I'm glad that I purchased just the one pizza for less than $15.", "label": 2}, {"sentence1": "Go for French toast/decadent brunch options only. Incredibly overpriced for what they offer otherwise - $7 for a tiny cup of yogurt and fruit and $4 for a Dunkin Donuts quality coffee.", "label": 2}, {"sentence1": "Had dinner outside this fall and was served by Chris, the excellent bartender at Sister's.  The burger was actually tremendous and the fries were as good as it gets.  Overall a wonderful experience at an old favorite.", "label": 4}, {"sentence1": "My go-to for Vietnamese food. I have been coming here for a long time and have tried many things on the menu. The beef pho is one of my favorites. If I'm in the mood for rice I get the fried chicken and rice w/ a fried egg on top. So good! Do yourself a favor and try the avocado smoothie. It's like superfood heaven with a straw!", "label": 4}, {"sentence1": "I am on a 3 week continuous service and I just had my second cleaning.   The first cleaning was great, very detailed job and perfect!   The second time was not so good, she didn't mop the floors and didn't vacuum the room I requested.  I contacted Just Cleaning and they promptly sent someone out to clean the floors with no hassle.  Their customer service is superior.  \nI am hoping that second time was just a fluke and the next cleaning will go just as well as the first!", "label": 4}, {"sentence1": "I live downtown and yet I go out of my way to drive to this club.\n\nReasons:\n1. Not as crowded.  Don't feel like I'm going to get kicked in the head in classes and I can get a cardio machine during peak hours.\n2. The people here are actually here to work out.  I don't see girls putting makeup on before their workouts etc.\n3. Has everything I need as far as workout equipment, locker rooms, pool, classes.\n4. Can walk over to Target after workout......just saying....", "label": 4}, {"sentence1": "HAVE AGAIN: the ciocolatte and stracciatella were very good. Rich and delicious.", "label": 4}, {"sentence1": "Cute hotel a bit on the pricier side for the size. In our hallway we had a housekeeping stand that was just there for 2 days before it was finally moved. Friendly staff that was nice and it's good that they have Starbucks in the lobby which is always a plus. The essentials in the bathroom was limited but for the time that we would be staying was okay. Our view was of the pool which was a lot smaller, the bed was very comfortable and nice to sleep in. They do have limited outlet to charge electronics", "label": 4}, {"sentence1": "This place is solid... sort of hippish, hippyish, and delish! \n\nI am not proud for that above commentary.\n\nNow I am bristling at my cheesiness, and will become dour.\n\nGreat menu, good people, awesome prices.... \n\ndon't know what you need for food?  \n\nnow you do.  enjoy!", "label": 4}, {"sentence1": "We have been there couple of times. I like their Bhuna Goat and Jaipuri Kofta's. Overall their food is good and try their tea after dinner. Only issue I have is their plaice is very tight and celling is very low, but if you are going their for food its not a big issue", "label": 4}, {"sentence1": "Quick service and always have my food packaged accordingly for pick up. Plan to go back again soon", "label": 4}, {"sentence1": "Creative hip vibe, casual and laid back. I've thrown a baby shower here and recently a bridal shower, it was the best idea I've ever had, the staff at Apres Diem makes it so easy, they take away the pain of throwing a party and leave the fun times, it's great atmosphere, they have a private room, and they give you tons of attention, highly recommend this place for small parties :), Thanks Apres Diem staff!", "label": 4}, {"sentence1": "Came here during a two hour lunch break I had. My barista might've been the most friendly guy ever. Definitely gave me good recommendations on what to get and talked about the wide coffee selection they had.\n\nEnded up getting a cold brew on his recommendation. Really liked it. Smooth.\n\nAlso got a green cart sandwich, basil chicken salad, which was alright. \n\nThe place is nice and roomy with lots of light and lots of seating. Small tables but it was comfortable to sit in a couch and do my work. \n\nI liked it!", "label": 4}, {"sentence1": "Last several experiences I've had with Radio Cab have been great, I think using the Curb app to book cabs has considerably helped with customer communications.", "label": 4}, {"sentence1": "One of my favorite places in Columbus. The menu has something for anyone and the cocktails are solid. Moreover, the quaint environment makes it an overall enjoyable experience.", "label": 4}, {"sentence1": "The sushi here is excellent! It's the best we've found on the North Shore. We got a firecracker roll, a kamikaze roll, and the sushi deluxe. All of it was really good, but the firecracker roll was especially delicious! I would highly recommend this place. If you go on restaurant.com you can get a $25 gift card for $10.", "label": 4}, {"sentence1": "Best millet in town. Wide selection of bird toys and supplies. I would buy a bird from them if they didn't clip their wings.", "label": 4}, {"sentence1": "Been coming here to our little gem several times the last couple years and it seems that this visit Yummi has gained popularity around here, my goodness it was seriously packed for Thursday. Always consistent with the Banh Mi with beef bulgogi and  where in Austin can you buy the best tasting at 2 for $7??    Just beware the jalapeños if you don't like them.  And don't pass up the kimchi fries to go as a side, def enough to split with a friend!", "label": 4}, {"sentence1": "Where to start! We ordered takeout on labour day. My veggie burger was dried to a crisp, it was the texture of a cracker. Had probably been sitting out overnight. Soggy onion rings. Boyfriends burger bun was charred black. Will never be ordering from this place again.", "label": 1}, {"sentence1": "Pamela is the wife of Joseph, who owns\nThe dealership. Please do not buy from this dealership as you can see Pamela only wants to make her \"fortune\" off of a certain demographic of people.", "label": 1}, {"sentence1": "Could not appropriately handle scheduling a home visit for an estimate.  Rescheduled once when the wrong phone number was used to announce the ETA.  Rescheduled to one of my days off.  Called to check when it got late.  Was told 1) that I had been called that morning, which was not true; and 2) that they were short-handed and only making emergency calls that day.  Might have been okay but for the lie that I had been called.  My phone showed no missed calls and no voicemail was left.  I wasted precious off time for nothing.", "label": 1}, {"sentence1": "I really wish I could leave a negative star this was so nasty the meat was full of fat with no flavor I had better tacos from taco bell what a waste of 60$.", "label": 1}, {"sentence1": "I tried to make a simple return and was meet with a rude and dismissive attitude. The majority of my interactions at this location have between mediocre at best.", "label": 1}, {"sentence1": "It's clear Samantha missed the point completely.  \n\nThis isn't about \"being nice\" it's about doing the right thing.  \n\nYou're response was a complete deflection and minimization of the overall situation.  \n\nWith only a couple exceptions (Roy as an example) the experience was an illegal train wreck. \n\nIn hindsight I should of got my attorney involved along with local law enforcement given my purchase and Dick Hannah's theft of that purchase.  I chose the high ground and it's cost me time and money I'll never recover.  \n\nSo, nice really has nothing to do with it.", "label": 1}, {"sentence1": "I asked for a cup of drip coffee which rings up for a dollar.  However JP was out of drip coffee and offered an americano as an alternative.  I accepted assuming that the price would still be one dollar as is coffeeshop custom.  Three dollars later JP has lost the business of a three-year patron and common reference.  Not a good business practice to bait and switch.", "label": 1}, {"sentence1": "Whoever made the food had never been to Ireland. The Shepherd's Pie was dry with American cheese on top. The Bangers were sort of ok on the Bangers and Mash but could not identify the mush that it came with. Very unappetizing.", "label": 1}, {"sentence1": "Mears sucks. I just spent over a half an hour trying to book on-line. Nothing but problems. I can imaginge what their car serivce is like.", "label": 1}, {"sentence1": "I go to market basket instead of Roche bros now, since it's significantly cheaper. Plus I bought the fresh baked cookies here and they were stale.\n\nUpdate: I needed something really quickly so I came here instead. I asked if they gave cash back and the cashier said yes. Cashier asked me to put my chip in and I asked her again if they gave cash back. I put my chip in and it got approved without asking if I needed cash back. Cashier had the nerve to sarcastically say, \"See?!\" .... No I do not see... No cash back.", "label": 1}, {"sentence1": "HORRIBLE customer service. This is the type of place that cares about their commission, not you ladies, DONT shop here unless you want to add more stress to your wedding planning", "label": 1}, {"sentence1": "Been there half a dozen times and every single time they are closed at least 30 minutes before their advertised time. Very unhappy. This last time it was one hour before advertised time.", "label": 1}, {"sentence1": "Ordered a turkey burger and received a beef burger. Even after the redo still turkey. I am done!", "label": 1}, {"sentence1": "This place has gone STRAIGHT DOWN HILL! Filled with thugs, gangsters and just isn't a safe place. I'm not sure if the low life's from up north just dwell here now but I'm never going back. Saw a kid get jumped by a few thugs in here just a couple weeks ago. It just isn't a safe bar these days with the type of ppl that have TAKEN OVER this once nice place. GOOD LUCK MGMT", "label": 1}, {"sentence1": "Terrible all around. Don't do it to yourself. Didn't work, poor service, strange return label.", "label": 1}, {"sentence1": "My wife and I went to the polaris store yesterday. We drove 25 miles from the north. We were looking to purchase a GPS unit for our car. A man greeted us at the door and directed us to the auto electronic department.We lookedand waited for someone to help and answer questions. About 15 or 20 minutes went by np one came.We left the store with no one saying a word to us. We will never go back. Ron Smith.", "label": 1}, {"sentence1": "Today I tried their new Wednesday special cold walnut Jya Jya noodles and it was seriously DELICIOUS!!! Usually I don't like cold noodles. But this one is a game changer! It's yummy, crunchy with fresh veggies and nuts, sweet and sour. I ate everything till the last noodle ;)", "label": 5}, {"sentence1": "Remarkably tasty, clean, fresh, fulfilling food. We had the quinoa fritters, seared ahi, sirloin tips, a fish special, and the key lime pie. It's rare to leave a restaurant feeling really happy and  very satisfied without having eaten a lot of food. That only happens when the food is fresh and prepared really well.  It was a tasty and memorable meal.", "label": 5}, {"sentence1": "This is my absolute favorite place to eat! I make special trips to the area just to dine there. They serve the best fish I have ever had (I always get the platter). The service is always spot on. We have eaten there several times and have never had a bad experience. The fish is always served fresh and hot, and they have wonderful salad and clam chowder.", "label": 5}, {"sentence1": "On vacation, and needed a haircut, and lucked into this fine establishment. Several chairs, and quick service. My barber was Fernando, who did a fine job with my flat top, a cut which is easy to mess up. They are close to the Disney area, just down the road from Wal Mart. Very convenient! I recommend them highly!", "label": 5}, {"sentence1": "I have eaten at Dos Batos several times over the past year and every time I find a new surprise addition to their menu. This time it was the corn off the cob with lime and something spicy. Delicious! Make sure you follow it with a pirata full of grilled, fresh, tasty meat!  This is my favorite dish but the torta is also very good. Don't forget to try either the Michelada or a fresh squeezed lemonade, mexican style! It may be a little pricier than your average mexican place, but the quality is well worth it.", "label": 5}, {"sentence1": "Love this place! There's so much to do and you can get rather cheap tickets. Don't come just for the game, they have VIP tours, a museum, batting cages, and great food", "label": 5}, {"sentence1": "First time coming into to KOBE and the place is great, super Clean and the food looks really good. Our cook Aubrey seen pretty cool, I will definitely will recommend this place to my friends.", "label": 5}, {"sentence1": "This place is so wonderful, decor and color are warm and inviting....prices are reasonable, considering it is a specialty coffee shop, not  commercialized bland drinks, from you know who?  In addition to their drinks, they also have amazing desserts and quick bites to eat.  The owner, and staff are delightful and always welcoming.  Love you girls", "label": 5}, {"sentence1": "The best pizza place in Vancouver! Great service, amazing atmosphere and delicious food!! Definitely coming back!! :)", "label": 5}, {"sentence1": "Dr. Selsky and his staff are friendly, caring, and very helpful. They go out of their way to make you feel welcome. The office is clean and well organized. My grandchildren have are not afraid of \"going to the doctor\" because their experience has always been wonderful. Dr Selsky always answers all my questions and he is never in a rush...and that is a blessing!", "label": 5}, {"sentence1": "Always a great place to bring people that really enjoy sushi. Staff is courteous and prompt.", "label": 5}, {"sentence1": "One of the better things I've ever put in my mouth- \n\nFatty tuna melts in your mouth residues a kick of the jalapeño;\n\navocado balls were astonishingly creamy and flavorful, positive that I can inhale a bucket of these with no soy sauce;\n\nLobster crunch roll was delicately delicious and predictable;\n\nGot a couple of more dishes on the menu but my lychee martini kicked in so the memory was blurry left the palate  on speed, I mean on steroids. \n\n5/5 sexy ambiance with sophisticated yet casual friendly vibe\nUnpopular opinion: better than UMI", "label": 5}, {"sentence1": "Jimmy John's makes Quiznos and Subway taste like you've put some roadkill between two leaves.  Plus they deliver--how can you beat that?", "label": 5}, {"sentence1": "Very good food! Friendly service. It seemed like most people working here were new to the business and trying very hard to get it right. The Rosemary hash browns were delicious. I had the special scramble of the day and it was as good as any I've had in the best trendy spots in Portland. If you live in the suburbs south of Portland and want to avoid the long waits and problem parking of eating downtown, I highly recommend coming to Oregon City instead and giving Yvonne's a try.", "label": 5}, {"sentence1": "Their Mac and cheese is greasy and delicious and an absolute classic.  My friend and I each got one,  I recommend splitting it or leave knowing you'll have left overs for tomorrow.", "label": 5}, {"sentence1": "This is such a great place!  Delicious food at great prices and the playground is a huge bonus!  Love that we can enjoy a night out at a nice restaurant while our kids are entertained.", "label": 5}, {"sentence1": "The breakfast tacos are probably the best in a five-block radius. But one of the guys who works mornings needs to take his rude hipster act to Williamsburg. Other than that, decent place.", "label": 3}, {"sentence1": "Staff are professional and very reasonably accommodated a large group of ours. I was surprised that we only had 1 server for the first half of dinner on a 30 top, but glad to see the shift manager added another server for the latter part. \n\nFood quality was very hit or miss - appies fell far below expectations across the board, whereas the mains really kicked butt. Presentation was good for both. Drinks were well mixed. Pricing is as expected. \n\nLocation is excellent and the space is great for private functions.", "label": 3}, {"sentence1": "Not to go against the grain but Gypsy Bar isn't that terrible. Yes the dance floor is shoved up against the back of the building, the crowd leaves much to be desired, there is a cover and the drink prices are ridiculous for Boston. Maybe it was just my company for the night, or the fact that said company and I went to three different clubs before Gypsy.\n\nAnyways the bartenders are lovely (made the best shots), the music was good and hell, that's all I needed at the time.", "label": 3}, {"sentence1": "Slim pickings on this side of town for Mexican style cuisine, so this will have to do. The service was good, the food was ok, the location is central for the lake Nona area and the prices are fair. Overall it's a quick easy spot to get yourself a burrito.", "label": 3}, {"sentence1": "Cute atmosphere, decent prices, awesome service. The rolls were really good, but unfortunately the sashimi and sushi we ordered was still frozen inside.", "label": 3}, {"sentence1": "I ordered the salmon salad and a side of asparagus.  The asparagus was slimy/oily and contradicted the desire to order a healthy item.  The salmon salad was a bit tastier.  The presentation was a bit messy, with salmon resting vertically on romain lettuce.   The lettuce was grilled and i believe it was grilled while they were grilling burgers because it tasted like a burger.  The bartender comped the asparagus, however we were charged twice and are currently awaiting for one of our charges to get refunded.", "label": 3}, {"sentence1": "Great lunch spot-don't think I would hit it for dinner.\n\nHad the TCurried noodle soup-great portion/value/flavor.\n\nHad some Roti (roasted bread)-really good.\n\nDuck soft tacos-excellent.\n\nThe place was suprisingly clean also.", "label": 3}, {"sentence1": "Hummus - good.  Chicken sandwich - good.  Cesar salad - fair.  Nice beer selection.  Service - good.  3 1/2 would be closer.  Can't go 4.", "label": 3}, {"sentence1": "Ahem, to an earlier reviewer.  NOT worker owned and operated.  Consumer owned; worker operated.  Of course, the workers have often acted like they own the place, which is a bit of a mood spoiler.", "label": 3}, {"sentence1": "In the rather bland area that is Milwaukee, there aren't a lot of options. While El Tapatio is probably not going to win any culinary awards, I've enjoyed several meals here over a few years.\n\nFood has always been consistent and pretty good. If they have a fault, its that they are somewhat small in portions (than the norm for a Mex place). \n\nI like that they bring a small thing of beans with the chips and salsa, too.\n\nWhen I'm hungry in this area, I'll keep coming back.", "label": 3}, {"sentence1": "Friendly service. \nGreat price, $6 for the basic auto wash.\nFree rug washers.\nSometimes our car is still dirty after the wash. \nIt's about 2 minutes drive from our home, so I can't complain that much.", "label": 3}, {"sentence1": "Love Sonny's! Great meals and even better prices. I didn't like their chicken parm, but you can't bear their pizza! \nPizza is $2.50 and drafts are 2.75 on Tuesdays! Nothing classy here but a great Dot tradition.", "label": 3}, {"sentence1": "We really like this place. My 2 year old even loves it. The kababs are really tasty and fresh. My only concern (otherwise I'd give this place 5 stars) is the cleanliness. The last time we went for lunch (11am), the trash was still full from the night before and the women's restroom already needs some TLC (this is a new place). I hope this place cleans up a little as I really want to keep coming back for their food.", "label": 3}, {"sentence1": "Great variety, it is a small place with a welcoming atmosphere. Bring your checkbook. It is pricey. The food selection is small and the quality is disappointing.\n\nDon't know if this is true for this location only.\n\nI certainly will come back for international beers on tab.", "label": 3}, {"sentence1": "TinT is just okay. Lots of tvs for games but they play lame games. (Come on people, in March people want college bb, not lame NBA games). \n\nOur server was nice, and the food came out fast. Nothing to write home about with the food. Portions are okay too. The high top table area is dim- good luck trying to read your menu haha.", "label": 3}, {"sentence1": "I went to this Firestone since it was close to my work. They did much better than the Firestone on S. Cobb Dr., Which I will never go to again. I arrived at 2:47 PM and was quoted one hour for an oil change.it took an hour and 36 minutes. that is a bit long to wait for an oil change but it is close to the time they quoted.", "label": 3}]