[{"sentence1": "I ordered Pad Thai and it was not good. The mango salad was okay. The avocado smothies is very bad. I don't even smell the avocado in the smothies.", "label": 2}, {"sentence1": "Found the restaurant smell a bit off, I was told it's fish oil sauce, had prawn still fry for $20.50 and $25 for 3 appetizers.\nOverpriced and just average, not clean either with long black hair on table.  At least we didn't get any food poisoning like another review.\nWon't be back, should have read the reviews, oh well", "label": 2}, {"sentence1": "We went for Mother's day brunch....plus this was our first time here.  Food was pretty good....except the blueberry beignets didn't have any blueberries in them and the pot roast hash was dry and tough.  BUT the service was horrible starting with the hostesses and then the server.  Took for foreverr to order, was only offered one cup of coffee (no refills offered), never given proper silverware (had to get up and find it myself) BUT the bill was given to us quickly?!  Not sure we'll ever come back....been there, ate there, done!!", "label": 2}, {"sentence1": "The place is called Mazazu Crepe and although I didn't try their crepes, I can comment on their ice cream.  Bland, bland, bland.  The matcha ice cream was so tasteless.  Is it that expensive to add more flavor?\n\nThey get a 2/5 for now unless they wow me with their crepes.", "label": 2}, {"sentence1": "I gave up on this KFC quite a long time ago when the a/c didn't seem to work. But now it's remodeled and looking nice, so decided to take a look. Sadly my impression isn't much improved. Yes? The building is nicer, but the buffet was pathetic. No chicken at all, everyone was asking and then they would put out 2-3 pieces at a time. Lots of chicken competition in Clermont. They will need to kick it up a notch.", "label": 2}, {"sentence1": "Service was great, I was given a beer while waiting in the long line, so that was awesome. When I finally got my tacos, I was disappointed by how dry and bland they were, and surprised at how much I just paid for some tacos and a tamale. Another Portland white owned, over-hyped, media darling ethnic restaurant. There are sooo many good authentic Taquerias in town that are cheaper, tastier, and need your support more than this one.", "label": 2}, {"sentence1": "$20 to mail a pair of shoes via FedEx ground. The UPS Store right around the corner was friendlier and more helpful, making the best cost effective recommendation.", "label": 2}, {"sentence1": "Old salad, cold crab sand.,awful soup,nice staff though.", "label": 2}, {"sentence1": "The food and menu is really good. They are my favorite salads, which is why I have kept coming back to multiple locations over and over again, despite issues with order accuracy. It's too expensive for what it is, specifically the protein portions are too small for the price. Because of the issues, I wouldn't recommend Sweetgreen over local options.", "label": 2}, {"sentence1": "Had the fish and chips. Fish was over cooked and the fries were raw. Greatly disappointed with all the meals that we ordered tonight.", "label": 2}, {"sentence1": "Got a living social deal on this place for $19 & decided to take the kids.  I made a reservation and still didn't get everyone in my party to sit together!!The show was entertaining for both my 2 & 6 yr old boys; however, the food was average at best.", "label": 2}, {"sentence1": "Spent hundreds of dollars there during the summer. I shifted between zyka and another ethnic restaurant. Went there last week and got about 1/8th the meat I normally got and the rice seems to have and downgraded quality and flavor.  I'm not falling for it.  As my mother said: QUALITY IS BETTER THAN QUANTITY.  If a restaurant downgrades on quality, you need to run.  You're better off with satisfaction with 3 more dollars spent than ?????.", "label": 2}, {"sentence1": "I'm truly offended by the bartender, with the blm mask on. I loved the food, but I will never frequent your restaurant again. My uncle was a proud detective for the city of boston for 60 years. I believe that there should be no slogan face mask in any establishment that patrons frequent. Not everyone shares the same views.", "label": 2}, {"sentence1": "started the appointment with what i thought was good communication on what i wanted but ended up leaving with something totally different. the service was great but i didn't receive the color i wanted. the stylist rushed to explain what happened and so i couldn't really understand. paid a very high price for something i didn't want at all. \ni won't be back.", "label": 2}, {"sentence1": "Brought a pair of jeans to have a plaid patch put in the crotch and a jacket to get some cool red cross details put on the corners of some ripped pockets on a regular looking grey cord jacket.  You know, spice it up a bit.  Everything was patched, but to the color of the clothes...  Jeans patch, boring grey stitches over the rips...  Thanks for nothing, I mean fixing my clothes...  To the opposite of what I wanted...\nI'll try somewhere else next time.", "label": 2}, {"sentence1": "Blah! We don't normally eat at chain restaurants, but were on a road trip to San Antonio from Dallas and needed to feed our children. I think our waitress was maybe 15 years old, not very familiar with how to take orders or wait tables. Had to ask for obvious things needed. Food just ok/blah.", "label": 2}, {"sentence1": "Sellwood Grooming is the definition of TLC for your dog!   Shaun the co-owner is all about service and providing caring and loving grooming services to your pet!  Max our nearly ten year old black lab came home relaxed and ready to entertain our holiday guests", "label": 4}, {"sentence1": "Was here for the shanghai-neering tour.  I hope none of that stuff happens anymore...=P", "label": 4}, {"sentence1": "Are you a vegetarian tired of being \"that person\" that is difficult to go out with? Or perhaps your dating one of these hippies? Well have no fear, True Food had your back!!! They have great options for vegetarians as well as those that tend to like...you know...food that tastes awesome. The waits here can be a little lengthy on the weekends since it's adjacent to Lenox Mall, but at least that means that parking is always available.", "label": 4}, {"sentence1": "Must be all new staff since a year ago, because my drink has been right the last several times I've went!!! THANK U", "label": 4}, {"sentence1": "The rooms were decently sized. The parking lot was small too. They were nice. It was late saturday night so it was a little busy. We got some snacks and mixed soju. We had lots of fun. I'd go again.", "label": 4}, {"sentence1": "Pretty good stuff. They even have low call, sugar free options. Reasonably priced and VERY rich ice cream. Definitely try this out if you happen to be near one.", "label": 4}, {"sentence1": "We would NEVER take public transportation in Los Angeles (where are from), but it seemed natural to take the Max while we were in town.  We stayed near the airport (because of my bf's work) and took the Max all the way to downtown.  It was direct, convenient, and reasonably priced.  It was easy to navigate around the city and relatively quick to get around.  It was nice not having to drive all around to get to the city and then have to hassle to find parking.", "label": 4}, {"sentence1": "I have only gotten take out for lunch at 9 tastes. It has been very good especially the seafood kamikazi (nice and spicy, with plenty of basil). They use very fresh, crispy veggies. The take out is prepared quickly and packaged well in sturdy plastic containers. You can order online or by phone. I definitely prefer it to Smile even though its a bit further from my office.\nThe interior also looks very cute.", "label": 4}, {"sentence1": "Sushi is pretty good, and the happy hour menu is decent. I probably wouldn't pay full price for the food but over all not bad.", "label": 4}, {"sentence1": "One of my top two favorite bars in the area.  Service can be a little dicey (they seem consistently understaffed)  but it is worth it.  My son comes from Sandusky for their burgers.  My wife loves their wedge salad.  Me?  My goal is to work through their entire menu.  So far I have been disappointed.", "label": 4}, {"sentence1": "Great service. Explained the options I had and tried to work with me during the busy holidays as best as they could.", "label": 4}, {"sentence1": "Saturday afternoon, service and food are both great. Plus NHL playoffs! Poutine, cheese board and oysters for appetizers. Sausage for entree.", "label": 4}, {"sentence1": "Still in the process of moving. Should have got some movers, but that's what family and friends are for. Saw the big sign and decided to pick-up a dozen donuts to give us all a sugar lift. I don't know if it was the lack of food in the new house, or if they really were that good, but they disappeared in less than 5 minutes.", "label": 4}, {"sentence1": "After touring Harpoons brewery, we headed over for a little Mexican and we were not disappointed. The avocado drip was outstanding, the food and drink were great and the service was very friendly. We plan on a revisit next time we are in the area and itching for some Mexican and tequila too!", "label": 4}, {"sentence1": "This food is so good! The quesadilla is one of the best things on the menu. I did find a hair in my food but it was on the tiny slice so I ate everything else. DEFINITELY RECOMMEND IT!", "label": 4}, {"sentence1": "We came to Fresca's for a break from the heat and a cold drink, and it was delicious! We got the loaded queso (without meat), which comes with black beans, guacamole, salsa, etc, and it was tasty! We also got a prickly pear margarita and a spicy margarita- both were enjoyed :)", "label": 4}, {"sentence1": "Vendor raised prices, on groupon, to make it look like you were getting a great deal. \n\n I called around, the price for a new windshield was about $200.  They quoted me 289, but with groupon, you would get for $210.  The cost of groupon, plus cost from JRD, would mean paying more for windshield than just calling my local shop.\n\nWhat a scam......Do not be fooled.\n\nI spent over two months time working with groupon and JDR to recover funds.", "label": 1}, {"sentence1": "Two weeks later. They don't even bother calling anymore. I called the delivery person who says they still don't have my order. Their customer service line is basically non existent. The calls won't even go through. Guess a trip is in the works since you can't get a hold of them. This is the biggest joke.", "label": 1}, {"sentence1": "Always watered down food! \nFrom salads to soup the food just has no real flavor or homemade taste.  Lettuce in a salad was fresh but only lettuce and nothing else.  That's not a salad. Burger was good but again week on the condiments. Had to ask for more pickles and onions and they brought me 2  of each??  Chicken pot pie had no ingredients in it just breading.   Stop being cheap with your food.   You charge a lot so serve it too", "label": 1}, {"sentence1": "The only reason I'm giving this one start because of the waiter, the guy did his job but my fajitas were burnt, and when I say burnt I had to literally scrape it off of the skillet. I hate returning food back so I just don't do that as practice but this thing was a disaster so if you go there and ask for fajitas make sure either ask not to overcook it or consider yourself warned.", "label": 1}, {"sentence1": "This was the worst Pad Thai I have ever had. I use to go here all the time and it was the best. I haven't been in a few years because I moved to the other side of town. Something must of changed.", "label": 1}, {"sentence1": "The Jalepeno breadsticks aren't bomb. They taste like left over pizza and they're thin and burnt... Not worth $9 plus tax.", "label": 1}, {"sentence1": "Techicans text/play with their phone during your manicure. 2 of my nails were cut and filed into my nail bed...OUCH! \n\nWhen your nails are wet and you are moving from the manicure station to pedicure station to the drying station to the front desk for payment...\nthe technicians WATCH you try to pick up all of your things (purse, jacket, shoes) without ruining your manicure. As some technicians, not attending to customers, look on. \n\nBizarre.\n\nDo not recommend.", "label": 1}, {"sentence1": "They overprice everything by $4+ from what the app says so I always have to have them prove match. Once they were charging 19.99 for a charger that was actually 7.99 on their website. I've stopped going here because of the hassle of waiting in line or going back and forth with them. This place is small anyways", "label": 1}, {"sentence1": "3/21/16 Rude doctor, unhelpful, overall a very unpleasant experience...", "label": 1}, {"sentence1": "stay away! theses guys are overprices hustlers!!!!", "label": 1}, {"sentence1": "The absolute worse postal service I've ever used. The drivers decide if they want to deliver packages to you based on if they think a person is living in a residence. I don't have a car so for my next day shipments I'm having to go to the post office myself which defeats the purpose of delivery. Then when you get there the staff acts like you did something to them. RUDE AS EVER AND NEEDS TO BE REPORTED!", "label": 1}, {"sentence1": "Don't rush to go here after 5pm if you're expecting to have new tires installed. They actually would rather turn away business than install them the same day.  They close at 8pm. The assistant manager had \"somewhere to go early\" I was told and wouldn't be able to install them. The person at the register (who I'm not even sure worked there) was fine when I told him I'd buy the tires somewhere else. I won't be renewing my membership. Wake up BJ's tire center!", "label": 1}, {"sentence1": "After a radio ad for Black Friday featuring 50% off all dry cleaning!  So I take a large amount of dress clothes, suits, dress shirts, slacks AND drop them off on Black Friday.  I went to pick them up this morning to NO discount at all.  I questioned why I did not get the Black Friday discount and the response was that 'someone' forgot to hit the discounted button and there was nothing that could be done.  NEVER GOING BACK.", "label": 1}, {"sentence1": "This is not how we wanted our first time in Orlando to start. Must have been 50 people in line at the counter when we got here.... the line is barely moving. I really wish I had thought to look at reviews before we booked and paid for this car a month ago, well lesson learned, never again.....", "label": 1}, {"sentence1": "Service is unacceptable! \nTheir website indicated they have free delivery for lunch and dinner for order over $30. After completing the online order, they said they're too busy, can't delivered. Won't recommended this restaurant", "label": 1}, {"sentence1": "Horrible workmanship. The tub surface is like sandpaper. Overspray on the floor and tub already peeling without even using it! Stay away. He does not stand by his work and won't answer phone calls. I wish I had seen all the previous reviews", "label": 1}, {"sentence1": "Yummy food! We tried the feta salad and the spinach and mushroom pita. Really creative recipes with Feta cheese! Recommend them highly.", "label": 5}, {"sentence1": "Always fresh and delicious!\n\nWe love to swing by and grab a soft sugar cookie with a light buttercream icing or a peanut butter cookie with a full size Reese cup in the middle.", "label": 5}, {"sentence1": "Seriously the coolest place I've been. My kids had an absolute blast! Me too! I only had 4 he's, had no idea we could've literally kept busy from open to close. Next time I'm setting aside an entire day. An absolute must for any age.", "label": 5}, {"sentence1": "I worked with Gro as a contractor, and they were a great client. They paid me in a timely fashion, were punctual for meetings, and pleasant in their communication. If they're as good providing services as they are being clients, then I'd definitely recommend.", "label": 5}, {"sentence1": "Hands down one of the very best doctors I have ever been to. He takes his time and is very thorough to get to the root of the problem instead of just prescribing harmful drugs. I am very hopeful about my plan of care and now my husband will become a patient as well.", "label": 5}, {"sentence1": "This restaurant is not open yet but I saw it tonight. It's located in the old Hooters spot in Altamonte Springs below Planet Fitness.\n\nCan't wait for it to open hoping it can fill the void left by Las Charro's closing early this year.", "label": 5}, {"sentence1": "I love this place, the greatest coffee in town and the most delicious donuts. Great service, and the best possible vibe.", "label": 5}, {"sentence1": "Had the most amazing experience. Red Robin was very helpful. Gave me the 70s look I needed for my family reunion. Stop by! Go out of your way to shop with Red Robin!", "label": 5}, {"sentence1": "Had a great experience everyone was very friendly and veterinarian was so nice and friendly. Would highly recommend going here.", "label": 5}, {"sentence1": "unexpectedly nice surprise.  met my nephew here before a football game and the bartender was so attentive.  ordered drinks and he made sure we got what we needed.  nice decor and comfy chairs.", "label": 5}, {"sentence1": "Banging burgers!!  You can actually taste the beef flavor [dry aged].  The toppings are endless and the rootbeer float was bonus.", "label": 5}, {"sentence1": "The Best pizza and calzones in Boston! Their doner dinner is delicious as well! Quick delivery. Everything is fresh and delicious.", "label": 5}, {"sentence1": "Always love the hidden corners of Portland \n. Food here was amazing and definitely had the feeling of homemade. Very low key and easy to find. One of my favorites for breakfast.", "label": 5}, {"sentence1": "Popped into this spot on a Friday night, and we scored a few seats at the bar (lucky!!!!!). Pizza looked yummy, but I went for a cocktail first - Cape Codder. SOOO good. It was standard vodka and cranberry, but they added blueberry liquor of some sort...very good, and it started off my Friday night well.", "label": 5}, {"sentence1": "A snug atmosphere with an aesthetically pleasing interior design. Eating at this location makes you feel as if you walked through heavens' gates as you push through the door. I would not miss trying one of their \"burgers\", and getting the beet \"ketchup\" to go along with it is a must. They also have many ready-to-go items that will make your plant-based heart soar. Did I mention their authentic coconut juice drink? You can thank me later.", "label": 5}, {"sentence1": "The best shopping experience of my life! Total service and honest helpful styling. I felt so special and the clothes are so fun and unique. Jess made sure I had the right fit and sizes... and gently pushed me out of my comfort zone. Thanks to Jess I have taken my wardrobe to a whole new level!", "label": 5}, {"sentence1": "Just went here for lunch today with a co worker. I love Asian food but Thai is really different. The place is really decorated all out, feels like you're in Thailand for real lol.\nI just had the pad Thai with beef. It was ok, needed more salt.\nI don't think I'd go back there, not because the place is bad but because the food just didn't sit with me.\nI love Oishi which is their sister place next door.", "label": 3}, {"sentence1": "I was at the Buckhead club for a reception and dinner for 90 people.  Apparently \"Peachtree Street\" is a high status address in Atlanta, but it turns out that the entrance to the club is not on Peachtree and our driver's GPS had a problem with that.  I didn't care for the food.  It wasn't hot and was too heavy, though that was as much due to the menu choices by the party's hosts as to the club's kitchen.  The night time view was nice and the service was attentive.", "label": 3}, {"sentence1": "i work in the area and frequent this place pretty often for the chicken noodle soup. it's generally good (not too much mystery meat) but there is an off time every once in a while. portion is huge for the price and service is pretty quick.", "label": 3}, {"sentence1": "I thought the Sheraton was a very solid three star hotel. Check-in was somewhat easy but co-workers found it difficult with a long line. There was no good food around the hotel and the in house bar and cafe were both VERY substandard. The room was small but not too small considering it was downtown Austin. \n\nI would avoid staying at the Sheraton in the future because there are much better options in Austin for a similar price in a good location.\n\nRoom Tip: our wifi was free but normally I think it costs money.", "label": 3}, {"sentence1": "I have been back a few times and the service is still great and entrees are still pretty good. However, their side dishes are pretty horrible and always the same boring ones (compared to other Korean restaurants in town).", "label": 3}, {"sentence1": "Always crowded, sometimes the line-up extends all the way outside. \nIt is very cramped inside as well.\nStandard Taiwanese cuisine.", "label": 3}, {"sentence1": "We got the pho and the spicy ramen here. Overall it was ok. The pho was average and the spicy ramen tasted a lot like oil and not a lot of flavor. They had old posters and little figurines around the entire restaurant and had a old episode on a small tv playing dragon ball z. The place was small. We sat by the window and there were little ants crawling on the table. Overall you can tell they don't do a great job cleaning in there but it does seem old.", "label": 3}, {"sentence1": "No parking available when I went during lunch so I parked across the street. Went with the traditional gyro. Downer they do not accept Am Ex. Waited about 15 minutes for order, pretty long wait time but it's a small place. \nThe gyro was a nice size. I should have left off the lettuce as its overwhelming. It was pretty good. I probably should have went with the hot dog. It was just ok. Not sure I'd return for a second visit.", "label": 3}, {"sentence1": "Irish Bros was my first time going through a drive through coffee shop, which seem to be very common in Oregon. They only had one person working so their system seemed pointless. You ordered from one window and were supposed to go to another window to pick up order and pay. The one employee managed everything on her own and with a smile even as the credit card machine started causing issues. As for the drinks we ordered, they were ok.", "label": 3}, {"sentence1": "The wine by the glass looks like a sample size, so small! The service is less than desirable as they do not even bring you plates with your apps or pizza, you must get on your own. The pizza is so thin crusted that it is on the verge of soggy. Where is the cheese? Order extra cheese in your pizza. We had a margherita variation and it had 2 whole pieces of basil on the whole pie. Kids were not impressed, NOT kid friendly. We left hungry. Trendy spot.", "label": 3}, {"sentence1": "From the pictures I saw online I expected a bigger store but it's just three small floors with staff that wasn't that friendly. The merchandise wasn't anything special either.", "label": 3}, {"sentence1": "We tried this place last weekend and I have to say the Sausage and maple was amazing. My boyfriend went back for 2nd's. \nBlack forest wasn't the greatest but was still enjoyed. \n\nMy only complaint is that the girl working there was more interested in finishing her cigarette before helping us and then when she did take our order she stepped back out of the shack and lit up again. Not exactly what I want to be breathing in while waiting for my breakfast....", "label": 3}, {"sentence1": "I think I would give it 3.5 stars if I could.  \n\nThe good things:\nMade to order sandwiches with very fresh ingredients and great bread.\nLots of room to sit and not feel bad if you're there for a while taking up a spot.\nIt's a block from my apartment!\n\nThe bad things:\nIt's a little pricey.\nI still haven't found a tea that I like there.", "label": 3}, {"sentence1": "This place is nothing to write home about. Drinks were fun and interesting, sometimes not that good. When you let the bartenders imagination run wild, sometimes the result is awesome and sometimes it's gross. The food was very mediocre and overpriced. I might go back for a drink but won't be back for dinner.", "label": 3}, {"sentence1": "I booked a  condo for my daughters cheer competition that was listed on Airbnb.   Competition was canceled due to the coronavirus and Airbnb was allowing for full refunds due to \"extenuating circumstances\" after some back and forth did receive refund from MVH.", "label": 3}, {"sentence1": "We went here after the Davis St. event to fill up the rest of our hungry stomachs, and I for one was not disappointed. \n\nCheap and savory - not usually two words that go together, but in this case it describes the Ma Po Tofu I got there. MMMMMM yeah...I couldn't have been happier after all the cocktails from Davis St.\n\nAdd to that the seedy ambiance of an old town Chinese restaurant, and you have a winner that is guaranteed to satisfy your Chinese food cravings. I will be returning, and next time I won't be drunk....maybe...", "label": 3}]