[{"sentence1": "Nobody is answering the phone. I'd like to know if they have the accessory I need before driving there. Not acceptable.", "label": 2}, {"sentence1": "The food was good but the bartender service was horrible. I didn't get a hey. My first time there and I expected to be \"WOW\" but it was okay. I asked for happy hour and the only answer I got was we don't have it at the moment and she literally walked away to talk to an employee. Smh But I'll be back maybe I'll sit at a table next time", "label": 2}, {"sentence1": "We used to come years ago and loved it so we were excited to make it back for our anniversary.  Very disappointing. The brunch was lackluster and had many fewer options than years ago. The beans and the ceviche were very good but everything else was mediocre at best. The tortillas were terrible and so were the mimosas The service was terrible. It took 15 minutes to take our drink orders. We had to bring the credit card  to the hostess stand because our server disappeared entirely. There are many Better brunch options.", "label": 2}, {"sentence1": "It's tough to give a DD a 2, but come on...when the place is empty I shouldn't walk in and see a filthy place. There's only maybe 5 small tables in here and all of them were dirty, except on. If it was busy and no one could get out and clean them, I'd understand, but after a snowstorm and before we headed to see BC play Maine in hockey the place had one other person in it and looked rough. \n\nOn a bright note, the tea, coffee and muffin we ordered came out in minutes.", "label": 2}, {"sentence1": "Food is ok.  Prices are ok.  This place is ok, a long as you are ok going to a place where they talk about customers - right in front of them - in another language.", "label": 2}, {"sentence1": "Bread was cold, veal was chewy, service was slow and sloppy.. I wonder why they charge so much for their food??", "label": 2}, {"sentence1": "This restaurant got so many good reviews that I thought I would try it, but I came away disappointed. My husband and I shared pad thai and a tofu-veg-chili sauce dish. They both tasted bland and uninspired. For good Thai, we prefer Tamarind House in Cambridge.", "label": 2}, {"sentence1": "Stayed here for a long weekend. If it wasn't for the location it would get 1 star. Beds were hard and uncomfortable. Rooms were small and needed cleaning (rugs, bathroom especially). A.C. wasn't adjustable or strong enough. Water pressure was horrible! The restaurant down stairs was convenient and great! Parking is ample and free. Walkable area around the hotel. No one was around to drive the complimentary golf carts. Only 1 person at the front desk made getting issues resolved tough.", "label": 2}, {"sentence1": "The main chicken+grains dish is insanely flavorful (some M word). Hummus is good. The owner is awesome and friendly.", "label": 4}, {"sentence1": "We discovered Checkers years ago while visiting down here in Orlando and became a fan right away. They taste very different compared to Mcdonalds and Burger king and IMO that sets them apart. I was surprised to know that they have them in NYC \"Long Island\" now. Big buford FTW! We never eat at any of their location. We just take it to go. If you have never tried this Fast food chain give them a try. You just might become a convert.", "label": 4}, {"sentence1": "Caribou Coffee on Lane Avenue captures me on weekends or, as like today, when I would like to meet a friend for coffee before the business day.  I prefer the flavor(s) of Caribou brand coffee than most any other competition.\n\nThis store is very convenient as I had to the OSU campus area or if I'm heading into Grandview from U.A.  (See Tremont Caribou Coffee location for a YELP review by \"Grip it and Rip it\")", "label": 4}, {"sentence1": "The only donut I'm really a fan of here is the creme brulee donut. I've tried the others and they are more like cake donuts for the most part. They have interesting flavors but if the dough isn't soft warm and fluffy I'm just not that interested in it. \n\nThe creme brulee donut keeps me coming back though.", "label": 4}, {"sentence1": "Needs better communication with the dispatch department as to scheduling but besides that great service.", "label": 4}, {"sentence1": "Just to clarify: Mr. Greek does not serve Greek food. However, they probably serve the best donairs in the city. If you haven't been here do yourself a favour and go as soon as possible! Lamb, beef, or chicken, you can't really go wrong with any meat. The value is good here as the size of the donairs are really big and the prices are fair. Expect to wait a little bit as there is usually a line up out the door, especially late at night.", "label": 4}, {"sentence1": "Super friendly service at the bar. Just the right amount of attention, and the spacing between items arriving was perfect. The $11 Strawberry Mountain burger was juicy and flavorful. The burger was very salty, but I have to say the frizzled cheese was a nice touch.", "label": 4}, {"sentence1": "This establishment was very accommodating. You can make reservations very easily online. They serve free coffee and breakfast every morning, and have showers in the rooms and additional ones throughout the hostel. The hosts will take you to the train station whenever you need throughout the day (which you can take to the many other parts of Boston, including DTWN). There are woman's, mens, and mixed dorms, which are all cleaned daily. \n\nFor the budget minded traveller, this is definitely a good option for boarding.", "label": 4}, {"sentence1": "Making long story short just want to say i went there for keratin treatment and haircut.And if my hair is nice and shiny itself just little fuzzy sometimes and i decided to give it little treatment before my overseas trip for my birthday celebration.Keratin didn't last even one week!!!!!!!And my hair looked like a hay after.Service was OK.Place was empty and weird location.", "label": 1}, {"sentence1": "Worthless. Took me a half hour from my destination with me directing them and them weaving through traffic explicitly not taking my directions. I just got out and took an uber. Please never use this service. I've had horrible experiences many many times.", "label": 1}, {"sentence1": "Not a good experience- only 2 options for cars, and you'll have to deal with a bitchy employee. Not that it made a difference but it was a bit odd- got a black car and the lady kept insisting it was red- not sure if she were color blind or just being an asshole. Finally got the car with 3 alert lights on- faulty filter, oil, and other. Let them know about the alert lights because based on the level of organization and customer service I wouldn't be surprised if they tried to charge me for it.", "label": 1}, {"sentence1": "Mediocre at best, shitty service and painstakingly slow. Definitely not worth the wait. Better off going else where.", "label": 1}, {"sentence1": "Wow. I can't believe they closed in this manner. I was trying to book an appointment and could no longer find their website. I looked into my emails and found one from 9/19/2018 offering Buy 12 Get 12 Free for $948. What a shame they were still selling packages so close to closing their doors!", "label": 1}, {"sentence1": "I ordered my to go meal through Yelp, paid for it , jumped into the car drove 5 miles over to your restaurant and it's CLOSED! The restaurant was NOT OPEN TILL 10 like YELP stated. As I'm sitting in my car wondering where I was going to eat now,My phone rings it's YELP sorry the business is not responding. I will now call the business before ordering off  OF YELP. \n\nYELP YOU GET 0 STARS", "label": 1}, {"sentence1": "Poor service. Low quality food. Better restaurant choices in that parking lot. Would avoid. \n\nUpdated 10/17/20 Try Snackboxe, Shoya Izakaya, Miss Gogi, Kura in that same lot.", "label": 1}, {"sentence1": "\"This is It\" found myself asking that the 40 minutes I sat there eating the food. BBQ chicken wasn't bad (you really can't mess up chicken), but the family got Catfish (too much cornmeal & salty), rib tips (TOUGH),  Shrimp (so so). Peach Cobbler and Red Velvet was garbage! Service was a little hood but I'm from Compton so that was welcoming! LOL... But in the south my expectations was the food would be much better. But, I guess \"This Is It\"!", "label": 1}, {"sentence1": "Love Axiom Cutler Salon! The best barbershop in Atlanta bar-none and even better, they charge only $20 for a haircut and shampoo/head massage. The staff here are all amazing and are experts at what they do. My schedule is pretty hectic so most of the time I walk in but they are very accommodating and work me in very quickly.", "label": 5}, {"sentence1": "Great food. Excellent service. Awesome shaded outdoor patio. Kid and dog friendly. Bacon Alma panini FTW!", "label": 5}, {"sentence1": "If I lived in Atlanta, I would want this to be \"my bar\". I enjoyed a reasonably priced draft beer (Fat Tire) outside on the patio on a lovely Saturday afternoon, and resisted the urge to drop $300+ on Sister Louisa's artwork.", "label": 5}, {"sentence1": "Loved the food here it was amazing! The wait staff was extremely nice and helpful with ordering as well!", "label": 5}, {"sentence1": "the show can be even funnier when the animals dont cooperate and the actors have to improv!", "label": 5}, {"sentence1": "Love it here. I have been coming for years and the staff is always amazing! I would highly recommend this place for chiro and massage.", "label": 5}, {"sentence1": "This place has great value for your money. It also has fantastic tea. The tea here has a stronger taste than any other sweet tea place I've been too. So if you really enjoy the tea itself in boba tea then this place is the one for you. My goto is the alpine green and sun moon, but the other flavors are amazing as well. Can't really go wrong here unless you don't like tea haha.", "label": 5}, {"sentence1": "This is such an amazing little study space. The evenvironment is simply just happy, and welcoming. The food and coffee is good, but the staff is even better. I have never had a bad experience while eating here. Specifically the worker Daisy is so kind, while I was having credit card trouble she was accommodating and patient all while being extremely kind. \nThanks for so many great experiences!", "label": 5}, {"sentence1": "Nothing special to report, normal flight nothing crazy. Only thing I would suggest is if you are going to have Wifi...why are there no AC chargers on the plane?", "label": 3}, {"sentence1": "I dislike coming to breakfast restaurants because they are rarely good. Basic eggs, toast, bacon and hashbrowns. Nothing to be excited about.", "label": 3}, {"sentence1": "We arrived shortly after 11 and were given the option to sit outside which we did. We were seated and it took at least 5-7 minutes to even be brought water and menus. It took another ten minutes at least to have our drink order taken so I made sure to quickly order an appetizer. Slooooooooow service but decent food and friendly wait staff.", "label": 3}, {"sentence1": "This Goodwill is well stocked, with items that we are looking for.  \n\nIt is lacking in the furniture section, which is one of my only complaints, other than very slow checkouts... but slow checkouts seem to be common among the thrift stores, which always baffles me.", "label": 3}, {"sentence1": "I ordered a savory waffle and was disappointed to find out that they make their waffles sweet, regardless of the toppings. I am just not a fan of mixing sweet and savory flavors most of the time, so it wasn't for me.\n\nHowever, I got to try one of their sweet waffles (the Heartthrob, a Valentine's Day special) and it was incredible. I will definitely be back for dessert-style waffles in the future, but I won't be getting savory breakfast waffles from them again", "label": 3}, {"sentence1": "I ordered a large juice, which ended up being delicious. However, I waited for about 20 mins for it when the place was not busy at all. I was looking for a quick spot I could take my drink to-go, and this was not it.", "label": 3}, {"sentence1": "5 stars for the pizza, 2 stars for the confusing space/overall lack of personality in the bar. Part of me wondered if it looked unfinished because I was there during opening week, but no, I think that's kinda just how it's meant to be. Cocktails were underwhelming so we headed down the street for our second drink of the night. Detroit style is my favorite so I might be biased, but Ranch pizza really is incredible and super delicious. Will definitely swing by for a slice again, but I'll either get takeout or head somewhere else for drinks afterwards.", "label": 3}, {"sentence1": "I like Jersey Mikes.  My experience with this Jersey Mike's was pleasant..the staff was nice and helpful and my sandwich was nice...\n\nmy only gripe was that my sandwich was not made in front of me.  i don't know, something about it was weird.  I've never been to a jersey Mikes where the sandwiches weren't made in front of the customer.  \n\nweird.", "label": 3}]