[{"sentence1": "Not really a fan. The sangria was so-so and the food was just okay. I prefer to eat Mexican elsewhere. \n\nI do like the atmosphere and the service is good, but I just wish the food was better.", "label": 2}, {"sentence1": "Located in the W Midtown Hotel, the first thing to consider here is that it is necessary to park in the rather pricey hotel garage. The restaurant, while chic and getting it;'s share of buzz, has annoying contrived music, servers dressed in Asianish constumes, and food and service that we found to be average at best.", "label": 2}, {"sentence1": "I thought I would try something different today; perhaps a Mediterranean salad or some other healthy choice.  Unfortunately nothing piqued by interest so I settled on the fish and chips.  The fish was an overcooked and very dry gray fish.  I ordered a soda and ran through the small glass pretty quickly.  I wanted another but could not get service so I ate half my meal without a drink.  The waitress brought me the check and asked if I wanted a refill.  Guess next time I will stick to a more traditional style restaurant.", "label": 2}, {"sentence1": "Food is okay but service is terrible, waited 40 minutes for the last plate, then got told that server somehow disappeared and was in the restroom, got sooo mad,  won't come again.", "label": 2}, {"sentence1": "I had Kristina pierce me for an industrial and I went with someone else who got a cartilage piercing as well. It was very professional and REALLY quick. The two of us were done in 15 minutes. She even put in a nose ring that I had trouble getting in myself (for free).\n\nI would have enjoyed a pit more banter and personal whatever, but all in all it was a fine experience. \n\nNot too pricey either, $65 for the industrial, jewelry included.", "label": 4}, {"sentence1": "Delicious everything, tastes homemade and the coffee is good. However it's a very tiny place, yet somehow we always find parking. The waitress is the cutest lady, awesome personality and remembers you. She makes the place warm and inviting. I love the bulletin board with all the dog rescue & adoption info. They also sell homemade dog food. I took a star off because I would LOVE to come here every Sunday but they're closed!", "label": 4}, {"sentence1": "FINALLY! Authentic Banh Mi's in Atlanta! I ordered a grilled pork and they gave me BBQ pork, either way it was delicious! I also got a Vietnamese iced coffee--YUM. Prices are good but docking a star because they charge more for to-go...which is weird.", "label": 4}, {"sentence1": "Very cozy, warm atmosphere, large menu, great food.  To start they give you some bread, great, thick crust, chewy excellence.  We then got bruschetta which was probably the best I've ever had. Fresh mozzarella, deep, rich olive oil, fresh tomatoes and basil placed on lightly toasted crusty bread. Our food was delicious and plentiful.  Service was spot on, very well done Lucia, we'll be back.", "label": 4}, {"sentence1": "Took my car in to have a \"check engine light\" diagnosed. \"Richie\" came back saying a tail light was out and the part - that was, incidentally supposed to be on warranty - was not and quoted over $1000 for the replacement. They were told to do nothing and we would pick the car right up - which we did. No tail light problem; we checked it completely. Do not trust the information you get here.", "label": 1}, {"sentence1": "Don't go here unless you have 2 hours to go without shoes. I've never had a pedicure where I couldn't put my shoes on but was told I needed to wear the plastic things for 2 hours. Seriously?  Who has time to walk around in those things for 2 hours", "label": 1}, {"sentence1": "Somebody said they might be related to the owners of Tien Hong, because their attitude to customers are about the same. RUDE !!! not worth going there.", "label": 1}, {"sentence1": "Was there yesterday with my son. Afternoon. An employee \"Neil\" was at the mall entrance. He was impatient with every employee in line that had trouble with the self-checkouts. Became belligerent at many employees about how they stood in line. He blocked egress with shopping carts and would try to force people out of line or scold them for not going out of the line. \nSecurity cameras would at least show his demeanor.\nThis employee should be working in the back of the store (stock room) and not have any customer contact.", "label": 1}, {"sentence1": "Maybe one of the best meals I've eaten, anywhere. Jen is skillful and pleasant behind the bar so eat there if you are alone. I didn't want to leave.", "label": 5}, {"sentence1": "These people are hands down awesome to work with. Was able to provide same day delivery on our Fiddle Leaf Fig tree and was very patient with us when we running late to be at the house to bring it in. \nWill definitely be bringing my business here going forward and recommend the same to anyone else reading this!", "label": 5}, {"sentence1": "I am completely, madly, head over heals in love this place! The food is just sooooo delicious! The variety of wines in this place with the option to try them is baffling! You must try it! This is a MUST!", "label": 5}, {"sentence1": "I had my hair done for my wedding here, and Lisa did a phenomenal job! So much so that when I came back to the area for thanksgiving this year, I got my hair cut with her again :) \nI should also add that Lisa was superbly helpful in helping me put in my headpiece for my wedding. I wore traditional south Asian jewellery for my wedding, and Lisa was able to attach my headpiece to my hair so well that it stayed on without any trouble all night!! So glad I found Blow & Go on Yelp", "label": 5}, {"sentence1": "Went on a Monday (12/29- 7:30pm) and the service was extremely poor. My date and I felt less than priority. The food was amazing and the presentation of each plate was very neat and appealing. I would recommend the ra'ckin tacos and the surf and turf roll.", "label": 3}, {"sentence1": "Before it Melts is absolutely amazing.\n\nBoxi Park is almost like a Food Truck Fair. You'll find lots of vendors including food trucks for tacos, lobster rolls, and drinks. \n\nThe environment is LOUD, with any and every demographic present. The music is awkward as it doesn't fit the vibe, but nobody seems to be listening to it anyways. Police patrol surrounding traffic to ensure everybody is safe and parking is not a hassle. Seems like more of a place for a younger crowd.", "label": 3}, {"sentence1": "1 star for service  but a 5 star location and 2 stars for value.  If this wasn't at Ponce city market it would have folded months ago. You have to order at the bar and get a  number then wait for a hostess to seat you, talk about and Identity crisis. I do however enjoy the VERY digestif coffee.", "label": 3}, {"sentence1": "This would be my third Red Robin review.  It's a chain.  They're pretty much all the same.  So, I'm not writing it all again.\n\nThings to point out about this one . . . stay away from it on game nights.\n\nThat's it.  All else is the same.", "label": 3}]