[{"sentence1": "People may love this airline, not me! Seats are way small, people are great, but the Logan gate is in siberia.Gate Food service provided by Cosi is bad. Bad coffee.", "label": 2}, {"sentence1": "Great ice cream terrible service. Guy who didn't know anything and was really spaced out, girl who went really really slow. Line was out the door and hardly moved while they both didn't seem to care and worked on whatever (refilling cups, stocking the fridge) instead of helping with the line", "label": 2}, {"sentence1": "I love chipotle, but avoid the steak! I kept spitting out my beef while having my burrito and could not figure out why....Until...my last piece. it was red and uncooked. Ughhh.", "label": 2}, {"sentence1": "Clean and tidy but not the most inspiring retail experience. Also the beer selection was spotty. With far too much of the space dedicated to overpriced wine. \n\nThe staff were less than friendly.\n\nI would find a better liquor store.", "label": 2}, {"sentence1": "The suite was NOT what we expected since we paid a lot of money for a two bedroom suite. It had a smell of pee, the furniture was stain and the bedroom sheets smelled awful . We ran out of toilet paper and requested more and they took more 2 hours and also they clean our room late afternoon after that was also requested. The waterpark was the most awesome thing, and my kids love it but for the money paid the room was horrible, and the breakfast buffet sucked and super expensive.", "label": 2}, {"sentence1": "I only give this theater two stars because I happen to live down the street so I can walk to it and I honestly love that, but the employees at this place suck. I don't know how else to put it; they don't call you over when they're ready for you at the ticket box, they just start talking to each other and give you attitude when you ask if they're available. Honestly if you don't like what you do please find a job elsewhere, otherwise \"fake it til you make it\". So to recap the customer service is crap.", "label": 2}, {"sentence1": "The food was ok. If you want to get full then go elsewhere, if you want a snack then go here. Other than that, there's not a whole lot to say.", "label": 2}, {"sentence1": "I was not impressed. Seemed like really expensive salad and sandwich/burger place (at least for lunch). The place has a modern decor but just feels cold and unwelcoming - better options exist for sure!", "label": 2}, {"sentence1": "Nordsroms is a great place. They have several brands and many departments. I think the Shoe department is a bit slow even when it's a busy day; and rather rude. They have brought shoes out to me that I haven't even asked about and aren't even the same style as the ones I requested. They often forget that you are waiting for shoes to try on. Sad, because I love shoes.", "label": 2}, {"sentence1": "I was expecting a more professional (and cleaner!) operation.  The process didn't seem to do much of anything for my teeth, tho my teeth are not all that stained.  I was also a little put off that there were signs all over that \"This is a cosmetic procedure, not a dental office and gratuities are appreciated\"", "label": 2}, {"sentence1": "Excellent food but poor management. We ordered food and drinks as soon as we sat down, ate as dishes arrived but as soon as we paid our $300 tab, which we did as soon as we finished our last dish, we were asked to vacate our table and instead sit at the bar. Felt like pretty shabby treatment after having spent so freely on a dinner for 4.", "label": 2}, {"sentence1": "As tacky as it is, I like the talking moose and other assorted animals at Bugaboo Creek, that is probably my favorite part. I have never been a fan of  chains, but it was late, my son was hungry and it was handy. I got a burger, it was surprising cooked properly!! My son had tips, I believe, he didnt have much to say about them, so I guess that tells you how good they were. Our server was peppy and pleasant, but I can't recall her name. If it wasnt so late, I would have gone elsewhere.", "label": 2}, {"sentence1": "I mean the price is decent. I believe my roommate and I paid $595 each for a two bedroom. Pretty great compared to West Campus prices. \nManagement was horrible when I lived there. Very unorganized. \nPretty dirty when we first moved in even though they claimed to have cleaned the carpets and such. \n\nOn the plus side they have free parking.\n\nWouldn't live there again. But if you're looking for affordable....this place is pretty cheap.", "label": 2}, {"sentence1": "Beer was superb and so was the service, but wow do they smoke in here.  Ashtrays on every table and if you dont enjoy smoke with your beer and food then stop somewhere else.\n\nId be a regular there if it was not for the smoke.", "label": 2}, {"sentence1": "Cencentrics no longer owns Stats and I can tell. More attitude and bland service. The good things about this spot are the roof top and the location. The food is fair nothig to write home about. Dantanna'shas great for for a sports bar. Stats has plenty of space which is great. However, having men and women use the same bathroom is gross.", "label": 2}, {"sentence1": "Lame. I admit I'm not into vintage or used clothing. But clean fun antiques intrigue me. They had nothing worth staying awhile. Also rude people!", "label": 2}, {"sentence1": "I really like this place! The food is pretty good, but I think tgey don't really give you as much food as you pay for. But other than that, pretty good!", "label": 4}, {"sentence1": "So, so glad Davis Squared exists -- Davis needed just this place. It has great cards, cute jewelry, fun hats, and great lotions, some cute tote bags, etc.  A great place for a little birthday, hostess, or baby gift.  I've also bought several trinkets for myself - earrings, coin purses - this sort of thing.\n\nLove the silly things too -- creatively shaped ice cube trays, etc.\n\nI wish 2 or 3 more boutiques of this ilk would open, and make Davis more of a go-to shopping destination.", "label": 4}, {"sentence1": "Party of 8. Seated promptly. Server was attentive but not smothering which is always a plus. Had the house made chips (delicious) and onion straws (not amazing just eh). Ordered wings but got fried mushrooms instead (which I preferred lol not a chicken wing fan) My husband and I both had the rib eye. He didn't really seem wowed my his. Mine was good, properly cooked and juicy. But I got a side of sautéed mushrooms and onion and it seemed like the mushrooms and onions were thrown together and briefly warmed. Nothing actually sautéed.", "label": 4}, {"sentence1": "Had a wonderful experience at this relatively new Italian wine bar & restaurant on Oct 6. We started with the mussels & meatballs (lamb) then finished with a margherita pizza - it was all very delicious & the service was prompt. They also tempted us with 25% discount off a bottle of Montepullciano which went very well with our meal. We plan to have HH for the Austin Skiers & Boarders here in Nov.", "label": 4}, {"sentence1": "The décor is a little overwhelming when you first enter I won't lie. It could be turned down a little but it is a cool vide when you walk in to hear live music. I liked sitting on the patio except the wind blew away the menus/napkins all dinner long. The food was good especially my chicken fajita that was seasoned just right. The tortillas could use a little more to them but it wasn't bad. I would go back", "label": 4}, {"sentence1": "Me and my boyfriend  have lived here for 3 months and so far we have had a great experience. The apartment was everything I was looking for. Granite counter tops, a garden sized tub, double sinks, stainless steel  appliances. Maintenance fast and friendly when it comes to getting things done. The staff, especially Luis, is very helpful and informative. So far we love this place", "label": 4}, {"sentence1": "I come here all the time to study. Coffee is great and it's not too loud. The whole place has a cozy feeling.", "label": 4}, {"sentence1": "I probably should have gotten the fish and chips since that is their thing. I opted for the ribeye special with mashed potatoes and asparagus. The ribeye was good and cooked as ordered, but the potatoes tasted like they were instant. It was a good meal but not worth the $46 price tag. Service was great and they had some decent drink options. The location in an old home was nice and quaint with seating outside also.", "label": 4}, {"sentence1": "This down-home place is our go-to for a quick morning pastry or bagels. We have always found the people behind the counter, including the owner, to be incredibly friendly and helpful. They do sell out early - which means that you know your baked goods are fresh!", "label": 4}, {"sentence1": "A very good option in Port Moody. Food here is 100% homemade and delicious. Goat roti is my favourite without any doubt. \nThe lady is great, very friendly and helpful, she cooks everything right after the order is done. Usually food comes pretty fast.\nEven if you like spicy food, don't go for the 'scipy' option, it's crazy spicy sometimes. The mild is good enough and she can serve you some hot sack on a side.\nJust a heads up, only cash!!", "label": 4}, {"sentence1": "If you own a business and you are out networking without a custom name badge, you should contact Michael at Portland Badge and Sign! They do a great job, super quick turnaround, and they'll have you looking like the professional you are in no time! No more paper name tags! Call Michael!", "label": 4}, {"sentence1": "Loved my nails, great selection of colors and professional service. Only con was that my polish and gel top coat weren't put on as evenly as I would have liked so the edges came off a little, but overall they still look good a month later!", "label": 4}, {"sentence1": "omg, cheap Asian produce!\nmmm, shrimp-filled rice noodles!\nomfg, somewhere i can eat near my boyfriend's rundown, red solo-cup-covered suburb of Boston!", "label": 4}, {"sentence1": "Two notes, I went to their posted hours on their website and decided to go to the barton springs location since it's closer, they were closed..so I decided to trek all the way over to the other location, which isn't bad, but the time I choose traffic was god awful.  so I was hoping the east location better be open, and it was....phew..it was awesome, the best I've had, but I haven't had many.  it is a tad peppery, so my husband doesn''t like too much pepper, but I do, so I loved it", "label": 4}, {"sentence1": "I always stop here for a latte or mocha and some chocolates when traveling through Columbus.  I have always found the service to be fast and friendly.   I have also always liked the lattes/mochas that I have ordered, and the Fig Vanilla Pepper Mocha is particularly good.  For the most part, the chocolates have been fresh and delicious, but I have had a couple that were not made in-house that were stale (so minus 1 star). \n\nIt is also a nice, comfortable place to sit and relax, especially after experiencing some of the surrounding shops.", "label": 4}, {"sentence1": "Pretty good pizza. I ordered out and got several different pizzas. I like thick crust, this isn't super thick or too thin. I will try it again.", "label": 4}, {"sentence1": "Very unorganized. Food was ok but I had better burgers. The staff had the order wrong. It was a long wait. I doubt we will return. Also it was overprized.", "label": 1}, {"sentence1": "After waiting 20 min I was asked what type of henna I wanted then immediately told the artist wasn't there.  I called earlier and asked about the service, they told me it was available until close. Now that I've arrived conveniently I was told it could be done", "label": 1}, {"sentence1": "They los my bag and would not do anything to find it claiming that I bought the ticket from american airlines.", "label": 1}, {"sentence1": "Did not have a pleasant experience at all! My husband and I got stalked the whole time. It got to the point where we were hiding from the sales rep. I get that they need to make sales, but stalking customers and hawking them is the last thing you want to do. We went to Rooms To Go instead and Ashley's lost our business. We will never return again!", "label": 1}, {"sentence1": "Great place if you want to do solo research because it's hard to get assistance.  I was ok with the location until my last visit, when I was laughed at because I was asking for a 30-prong charger cable for a tablet.  Apparently tech that is a year old is too outdated for some staff to bother helping with.  The other staff member attending was embarrassed and suggested I try the Samsung shop at Metrotown across the street (4 star experience by the way).  I will never return to this BB.", "label": 1}, {"sentence1": "This is by far the worst place you could possibly stay in Portland. I stayed there one night last week during the storm, online the price at $71. When I got there he told me it was 95 plus tax. And then when I got charged on my credit card they charged me $144.95!!! When I called and asked to dispute it with him he said you signed the papers. The worst customer service I've ever had at any Motel. Do youself a favor never stay there!!!!", "label": 1}, {"sentence1": "Terrible service, uninspired food.  Came in for lunch buffet, nobody even stopped by my table until my 3rd trip to buffet, at which point I was done.  None of the food had been refreshed for 45 mins I was there, half of buffet was completely empty skillets.  Waste of time and money.", "label": 1}, {"sentence1": "Was in last night and ordered the Viet sub. My friend ordered the same thing - both took nearly 30 minutes each to make. None of the staff - the cook or the cashier -  were moving quickly to get food made and served quickly. People who ordered before us were still waiting for their order once we had our food and were leaving. Very disappointed.", "label": 1}, {"sentence1": "This place needs to close down and make room for another business. The food here is so disgusting, I wouldn't even recommend this place to my worst enemy. You can tell there is no pride in this restaurant. The food is microwaved or something. The waiters/waitresses are all rude and if there was a 0 star. This place damn sure deserves it.", "label": 1}, {"sentence1": "Horrible service tonight. I've been waiting 45 minutes for dine in tacos. The restaurant isn't busy and no explanation is offered. This happened before recently. Disappointing.", "label": 1}, {"sentence1": "The host was so rude. This place won't see my business. Hire some friendly people who don't hate their life and their job.", "label": 1}, {"sentence1": "I ordered a 1/4lb of the pulled pork which came with in house ciabatta bread, pickled veggies, and bbq sauce. The pulled pork was heavily peppered and completely over salted. Half-way though eating my tongue was completely numb to any other flavor other than salt. I had to drink four full glasses of water just to choke down the meat. The only thing that was slightly redeeming was the toasty bread and a wonderful gin and tonic. The ambiance was great, but the BBQ was the worst I've ever had.", "label": 1}, {"sentence1": "Message to Managers: Please, pay attention to your hostess, they are so uneducated and impolite that they rather keep going into their conversation than greeting or something as simple as \"have a great day\" is hard for them. I am always shocked that anyone could be so impolite as to continue talking despite me looking at them as I leave almost waving goodbye! And i am a regular, meaning i come here often. How rude! Lol", "label": 1}, {"sentence1": "It's a serviceable location when you are in a pinch. Don't see how the owner makes money, clearly the staff doesn't know how to use the right amount of product. \n\nI order medium and there is so much left over for another large. \n\nNext time I ordered two smalls, and there was still more than half a pitcher left. \n\nKeep this mind when you ask for add one. \n\nIf you need a carb fix before the gym it will do. Nothing nutritious about this place.", "label": 1}, {"sentence1": "The absolute worst service. The bartender/manager Xavier was rude and tried to beat me out my money. I will never go to this restaurant again. The food is subpar and overpriced.", "label": 1}, {"sentence1": "I love subway and have visited multiple locations. This location had mold visible in the soda dispensers, the tables were filthy and the bread was definitely not fresh. There was also only one worker. The mold in the soda dispensers was nauseating. I didn't drink my fountain drink.", "label": 1}, {"sentence1": "Ridiculously delicious.  Came through with my sister to show her the kind of food this place puts out,  and it didn't disappoint.   We got the Trinity,  Nipsey Hustle, and a Nana pudding.... so dang good.  Nipsey was full of shrimp.  The bread was wonderfully soft but held the shrimp and sauce nicely--  perfect on a warm day.   Trinity had so much going on with every bite, didn't matter what the weather was.  Zero Nana pudding survived.  Food aside,  their hospitality was enthusiastic and genuine.  Benches available for immediate eating (which you'll really want to do).", "label": 5}, {"sentence1": "Repaired my wife's shoes after they broke at a wedding.\n\nTurnaround time was great and we had them fixed before we had to fly back home to Texas.\n\nPrice was competitive and fair.\n\nHighly recommended!", "label": 5}, {"sentence1": "Sarah was very helpful, suggesting good places to bike and making the rental process smooth and easy.", "label": 5}, {"sentence1": "I just moved to Colorado in December and have been coming here since. Everybody here is great-knowledgeable and friendly. I always ask for Jason, as he always has helpful suggestions and feedback.", "label": 5}, {"sentence1": "Coming from Europe recently, this place resembles home so much that I wanted to stay for as long as possible. I had breakfast and every thing from the omlette to the fruit salad was top by any standard\n The portions are quite generous and the taste is extraordinary. The people are very friendly and make you feel like you are a regular here.", "label": 5}, {"sentence1": "Games, books, and coffee. Need I say more?  Glass mugs or to go.  Friendly staff. Quaint.  A piano too;)  oh and the coffee was good.", "label": 5}, {"sentence1": "Amazing food! Kind service! Great prices. Lots of good groceries and take out.", "label": 5}, {"sentence1": "Tiny place, but really love their pasta dishes of any kind actually! They could perhaps put cushions down on the seats (they're hard wood). Will continue to come back to dinner here.", "label": 5}, {"sentence1": "First time and it was amazing!! The brisket and pork was so tender and delicious. Hands down the street corn was the star of this meal. The tacos al pastor were flavorful and gone all too soon. The owner stopped by our table and such a gracious host, he gave us a banana pudding to try and let me tell ya, his mom knows her stuff.  That dessert was tasty and just the right amount of sweetness. Give this place a try, you will be just as amazed and satisfied.", "label": 5}, {"sentence1": "Delicious cocktails! Delicious food! Beautiful restaurant. Great service. I'll be returning next week.", "label": 5}, {"sentence1": "Food is wonderful, atmosphere is wonderful, customer service is great!  I was having dinner with a group of 6.  Everyone's dinner came and mine didn't come until 4-5 minutes later.  A manager brought my plate out, apologized, and insisted on giving me a free piece of cheesecake.  That is the way to keep customers happy!", "label": 5}, {"sentence1": "I have only been here once and that was on a Sunday afternoon to watch football. The have the NFL ticket and enough TV's so that you can watch every game. Great place to throw back some beers and watch the game. I got a bacon and blue cheese burger, it was pretty solid.", "label": 5}, {"sentence1": "Visiting my daughter for the week.  Found dolce on yelp.  Called to get an appt. for a cut and partial color with low lights.  To my surprise, they had an appt with Wes within the hour.  \nIt's a beautiful salon with friendly staff.  I am very happy with my color and cut.   Wes was very friendly and funny.  I will come back when I need another cut.  I'm only a couple of hours away and it will be time for a family visit.", "label": 5}, {"sentence1": "I was visiting Bolder and was en route to Estes Park when the  dash light for tire pressure came on. I stopped by Grease Monkey and the guys helped me out. They were incredibly nice and very helpful. Thank you guys!", "label": 5}, {"sentence1": "Love this place every time I come never disappointed! I usually go to Ruby or another stylist sorry forgot the name. I have thick natural hair that takes a while to detangle and straighten. I never fell rushed. My appointments take 1.5-2h. They use roller brushes, and flat iron if you want more smooth style.", "label": 5}, {"sentence1": "Beautiful and clean park area in Boston, lots of locals!  Located in the heart of downtown boston, nice for taking a stroll or even to just hang out and have a bite to eat.  I would say that the Boston Common is equivalent to central park in new York. \n\nThis is where the freedom trail begins and is a great meet up spot for tourist or even locals. There's s lot of history here. If you visit boston you must go!", "label": 5}, {"sentence1": "It's unfair to rate an Indian buffet when:\n\n1. Your first choice for Indian restaurant In Somerville was closed due to the owner going on vacation and had to quickly Yelp up option B.\n2. You didn't realize that the menu was all vegetarian.\n3. You had know idea what you were eating despite description at the buffet counter and you had to google up lassi when simply ordering from the drink menu. \n\nAll that being said, just about everything was delicious. My favorite was the vegetarian doughnut. I am going to go bite into a juicy hamburger now.", "label": 3}, {"sentence1": "Nice find. Went here on a friend suggestion and it was pretty darn good. Had the iceberg/wedge salad and custom pizza: tomato, mushroom, ham and green pepper. Everything was fresh and tasty. The pizza was hot and crispy. The salad was refreshingly cold made with fresh ingredients. I would eat here again.", "label": 3}, {"sentence1": "This is a decent airport with an easy layout and lots of stuff to do if you have to wait for a flight. Security is never pleasant, but I find that to be the case with most US airports. Canadian security is just a lot more... Friendly. The regular (read: non-security) staff are plentiful and know what's what. I'm not a huge fan of airports in general, but this one is fine enough.", "label": 3}, {"sentence1": "I thought it was interesting how she rolled it! Interesting how they put together a sushi and ice cream shop. However, it was quite expensive.", "label": 3}, {"sentence1": "I will start off with the best-  great Americana omelet (steak and cheese) as the eggs were cooked perfectly! The food was very tasty.   Wonderful selection of root beer and a terrific cup of coffee.  I say if you have time and are patient, then head here for breakfast.  If you are in a rush and inpatient when there are other things to do, stay away.  The service was inefficient, the staff was disorganized, inattentive, and forgetful.   No one was very friendly.", "label": 3}, {"sentence1": "Used to live across the street from here, making this a convenient location to go to on a weekday or weekend. Food comes out quick. Service is good. Good neighborhood spot for locals close by.", "label": 3}, {"sentence1": "I like the food. It's far from the best Mexican food I've had, but it's not bad. My main issue is the service. It should never take 15 minutes to get drinks on the table for three people", "label": 3}, {"sentence1": "Super Gyro. Yum. ($9; used to be $5.50) The best I've had so far but the quality has gone down hill. They never seem to take the time to get the meat even a little bit crispy anymore, and the topping proportions have been way off a few times.\nAlthough the price has gone up dramatically in the last several years, it's still where I go when I want a gyro.\nI'm of the opinion that sandwiches shouldn't cost too much, especially at food carts where overhead is supposed to be lower.\n\nStill, I keep going back.", "label": 3}, {"sentence1": "We only came into Kornblatt's for what we thought would be a quick bagel to go. It was not quick at all - it wasn't that busy in the dining room but for whatever reason the staff were having some difficulties with the register and arguing about one of the to go orders. It took forever for just one bagel with salmon cream cheese. The bagel was alright, but not amazing, and the cream cheese only had just one tiny piece of smoke salmon. For the long wait and alright bagel, I don't think I'd be back.", "label": 3}, {"sentence1": "I only ever went to the buffet, but I consistently enjoyed this place. The prices were very fair .", "label": 3}, {"sentence1": "good coffee, i end up coming here cuz its right by my yoga studio. i got some pretty snarky service a couple times though, so i don't know... wish they were a little friendlier. and why are they so stingy with the almond milk and stevia? come on.", "label": 3}, {"sentence1": "I received a phone call today from the Oxford Suites informing me that they saw the review on yelp and had processed the refund.", "label": 3}, {"sentence1": "I am going to have to try this place again.   I wasn't as impressed as everyone else, and many of the rave reviews are coming from yelpers that I generally trust.  I absolutely appreciate that there is a place like this in Atlanta, but did I miss something?  The food was okay, but not of the caliber deserving this much praise and reception.  \n\nI found the fried dishes overcooked and dry.  As for the ramen, the texture wasn't quite there.  There are better places in Atlanta.\n\nPerhaps it was an off night?  I'll be back.", "label": 3}, {"sentence1": "Another straightforward spot in the North End.  Bustling atmosphere, nice service, cheapish wine.  It's a Southern Italian place - lots of tomato based sauces, the stuff I ate growing up in Jersey.  Nothing wrong with that.  \n\nCould have gone with two stars though because the seafood in the Puttanesca was super chewy.  Yeah, the calamari.  Pretty off-putting stuff really.  But all in all not a bad spot since it's comfortable, family friendly, the people are nice, etc.", "label": 3}, {"sentence1": "This was a nice place to land after being 86'd from Lincoln. The bartender was chill and responsive and comped me a drink, so that is extra credit. I met some new people who I might start a podcast with. I would go back if I am ever back in southie again.", "label": 3}, {"sentence1": "Good pizza, but nothing especially special.\nStop in for a slice.....", "label": 3}]