[{"sentence1": "I had heard so many good things, I had to give it a try.  Unfortunately, I found the sauce to be watery and crust to be soggy.  Not terribly impressed.", "label": 2}, {"sentence1": "It is a different experience with take out and dine in. The flavors are just alright the portion for the $$ goto your neighborhood Italian spot. Very nice pick up hosts during this weird time, gloves, masks. Hopefully they can get it back together. Its tough right now a so try later.", "label": 2}, {"sentence1": "Well, we stopped by after reading all the rave reviews. \n\nThe food here is good, but the service, decor, and cleanliness of the restaurant is terrible.\n\nIt took a very long time for us to receive our entrees. \n\nThe burrito was definitely good, but not nearly as memorable as I would have thought based off of all the reviews. \n\nOverall I was not disappointed, but I was also not amazed.\n\nBottom line: it doesn't live up to its hype on Yelp, but it does serve a decent burrito. 2/5", "label": 2}, {"sentence1": "Hurried and sloppy. \n\nI was in-and-out of the chair in 5 min. Ended up leaving the shop with obvious misses that could have been caught if Lucy would have just taken a deep breath, and looked one more time.", "label": 2}, {"sentence1": "The store is chronically understaffed during key times (e.g. Weekends) and often does not have the fresh meat and seafood products we need. Area homeless tend to congregate by exits, redemption area, and in the parking lot. The florist desk is also rarely staffed, and lines at checkout and service desk are always long. The only things that keep me coming back are proximity to home and gas rewards.", "label": 2}, {"sentence1": "We accidentally went to this place because the next Korean restaurant was closed. Thought it would be OK...but it wasn't. We ordered General Tso Chicken and Salt&Peppers Prawns, chicken was stiff and dry also the sauce wasn't delicious. Also prawn dish was too oily and no flavor. It didn't seem like $13.95 dish. The staffs were nice and the place is clean. I don't know about other foods there but our food wasn't delicious.", "label": 2}, {"sentence1": "I've wanted to come here for so long and finally made it today. What a colossal disappointment! Food was unremarkable which made the prices that much more indefensible. No need to come back.", "label": 2}, {"sentence1": "Nothing better than arriving to pick up your $50 pizza order and being told to wait 5 minutes so they can reheat it. \"We always reheat it.\" Is what I was told. It tasted like it, too. Pretty poor effort, Boss Lady. \n\n1st time around wasn't too bad. This time was very disappointing.", "label": 2}, {"sentence1": "Waited 25 mins for a carry-out order. I finally went up to counter to see how much longer.. my food was just sitting there waiting for me to say something I guess. I asked for well done fries having received severely undercooked fries every other visit here but they were just as terrible as always. Wings are good, I just won't order anything else on the menu", "label": 2}, {"sentence1": "Five stars for atmosphere. But the rest is down hill from there. \n\nService is slow and spotty. We had no utensils which took ten minutes to fix. Our steak was cold. The bread comes directly on olive oil. Big delay between our salad course and main meal. \n\nJust not the experience we were hoping for.", "label": 2}, {"sentence1": "If you like beer then you will probably enjoy this place. If you like food then you will be disappointed. Although my wife really liked the meatloaf, my burger came out over cooked and tasteless. The kitchen forgot the bacon and even though I asked for the fries crispy they came out undercooked and soggy. The rest of the food looked lackluster and there are better places in the area to eat so unless you want the \"Brew House\" go elsewhere.", "label": 2}, {"sentence1": "The hotel is a nice one in a convenient location.  The staff is polite and attentive. If I have any complaints it is that for the price of a Hilton quality hotel, I don't expect to pay extra for every little amenity that the hotel has to offer such as wi-fi, parking and use of the internet in their business center ($.25 per minute) - services that are free with cheaper hotels.  Also, who installs a bathroom towel rack INSIDE the shower stall?  Hilton does.", "label": 2}, {"sentence1": "If you need a quick car wash, go ahead and pay for the cheap wash. I went in primarily to use the vacuum. The vacuums out there suck. No suction whatsoever. You are better off using your own vacuum at home or using one at a gas station. \nI ended up finding a vacuum that had decent suction, then it broke. Don't waste your time or money here......Also, their driveway is designed to get you in; if you don't want their services, you have to backup into a curvy/twisty driveway and only if there isn't someone behind you.", "label": 2}, {"sentence1": "We ordered online and went to the Denny's on Marine instead of Kingsway. So after realizing our mistake we drove to Kingsway. Guess what our order was not ready! We had to wait 15 min till we got our order.  If we got to Kingsway, we probably would have to wait another 40 min. The service was very slow because it must of been very busy. Food is always so so, however will think twice when ordering on the weekend", "label": 2}, {"sentence1": "I found this place on yelp and thought it looked adorable. I wanted to try a new place for coffee and a breakfast treat. While the interior is very cute, the pastry selection was disappointing and my $4 latte was horrible. I tried to muscle through it out of spite, but eventually I cut my losses and threw it out. I'd love to say that my almond croissant made up for the horrific coffee, but sadly it was only just above the quality that one would find at HEB. Pretty disappointing.", "label": 2}, {"sentence1": "Short and sweet:  Overcooked salmon. Manager had it remade; same result. Dirty floor. Inattentive waiter. Won't return. We would rather drive twice as far for a different Cheddar's location.", "label": 2}, {"sentence1": "Clean, lots of options for toppings and type of froyo you want. You pay for the cup not by the weight. So glad I found this hidden gem in Norwood!", "label": 4}, {"sentence1": "I eat here often. I love there regular donair. It is affordable and tasty.", "label": 4}, {"sentence1": "We had the bento box and it was delicious.  The salmon was cooked to perfection and was large enough to fill me.  The fried rice was not augmented with vegetables but the flavor was delicious.  The edimames were nicely salted and good to eat and the california roll pieces were not bad.  I'd go back there again if I was in the area.\n\nThe service was quick for freshly cooked salmon and very pleasant.", "label": 4}, {"sentence1": "I love this jj bean location. It's smaller, but much nicer atmosphere than commercial drive or main st. Same great service, drinks and baked goodies! :)", "label": 4}, {"sentence1": "This place does great what it does! Tasty sandwiches, good drinks and very affordable.  I even eat their veggie sandwich on purpose because it's good!", "label": 4}, {"sentence1": "Very good wings. Staff was helpful with determining which sauces to order. Wings were a nice size and prices were good.", "label": 4}, {"sentence1": "The mozzarella sticks are ok.  The fried chicken wings are super good.  The Greek family that runs it are really nice and make you feel like a valued customer regardless of the size of your order.", "label": 4}, {"sentence1": "I found some really unique calendars for my holiday shopping list here recently. A bird song calendar with actual bird songs for each month of the year will entertain my grandmother this season. And the Wallace and Grommit calendar is perfect for my brother-in-law, who is a huge fan but has otherwise been hard to shop for in years past.", "label": 4}, {"sentence1": "Scarlett Marquette and her boss impressed us with their professionalism. The apartment that was posted by this company on craigslist was indeed available for viewing. We did not take it in the end but nevertheless only have good things to say about our experience with this company. \n\nScarlett is a rare find among agents in this line of business. She listened very well, took our needs into consideration and was not as pushy as other agents we delt with in the past. \n\nThanks! \nDoerte and Sam", "label": 4}, {"sentence1": "Had a wonderful dinner here.  I love that they cater so much to Paleo, but don't fret if you're not Paleo and by all means, don't add it to a list of places you're not interested in if you're not, because they all sorts of delightful food, they just happen to have a lovely selection for Paleo folks.  They also have a great cocktail and alcoholic milkshake selection. :)  Most of the food is done a little healthier, but full of flavor.  Whether you want a burger or the vegan version, you're covered!", "label": 4}, {"sentence1": "The first time the food was Excellent!!! Yesterday the food was ok.   The three times I visit this place I enjoyed the seafood", "label": 4}, {"sentence1": "The experience is great. If you have a picky or sensory challenged toddler, nothing here for them to eat.Food a bit pricy but hey, that's ok!", "label": 4}, {"sentence1": "Love the wings - smoked especially.  Always a great and interesting beer selection.  I also like the shrimp and andouille sausage quesadilla.  I think the tastiest thing on the menu is the short rib tacos - exceptional option!!  The patio is phenomenal when the weather cooperates.  The service is typically pretty good and the regular servers seem to remember you after a few visits.", "label": 4}, {"sentence1": "Seems like a pretty classy joint, going the quasi-Whole Foods route while still carrying all of the brands I need.", "label": 4}, {"sentence1": "Great filet. Great risoto with mushrooms sticky. ..\nAmazing lobster soap with salmon and haddock.\nOverall great sunday lunch with the family. .", "label": 4}, {"sentence1": "I got the Thai bowl (to go) which I really liked.  Also got a piece of pecan pie which was awesome.  Didn't stay long but people are nice and it was quick.", "label": 4}, {"sentence1": "I have given this place so many chances to be good. But it's not. There was like a tablespoon of black pepper on top of my pad see eww. It was the worst pad see eww I have had. I will say the Tom Yum was satisfying. I live super close so it's a bummer it taste so bad. The previous owners were much better. I feel harsh but I speak the truth", "label": 1}, {"sentence1": "This ABP is appallingly overwhelmed at the slightest hint of a crowd.  The sandwich they threw together for me today wasn't even edible.  Currently #2 on the regulars list, but my check-ins won't be changing for awhile.  The vending machine in my building is a better option.", "label": 1}, {"sentence1": "One of the top teams in the country deserves a better facility. How can you make people pay top dollar to sit on the floor? Obstructed views and no blood in my ass. Great.", "label": 1}, {"sentence1": "I tried eating vegan for the very first time here. \n\nI ordered this weird burger that tastes like a million plants dying all at once. The mac n cheese tasted like the air at a tire shop. The brownie and drinks were good though. \n\nSorry vegans, not my cup of tea.", "label": 1}, {"sentence1": "Don't go here... got a terrible pedicure. So overpriced. Spa pedicure only lasted 20 minutes. They didn't even put a top coat on my nails.", "label": 1}, {"sentence1": "Cozzoli's wins the Bodank Ogleby Award for Best Imitation Middle School Cafeteria\n\nif you are a fan of iceberg lettuce with a couple of cherry tomators I recommend The Salad", "label": 1}, {"sentence1": "Does any institution controls the price of gas? 5.99 per gallon for regular gas? Are these people crazy? Definitely didn't consume here.", "label": 1}, {"sentence1": "At the airport stand.., a star Just for the fruits... otherwise, not worth a star...  awful attitude by the workers... will never go there again... not worth it...", "label": 1}, {"sentence1": "If you're into BDSM, you'll definitely enjoy how they treat the customers. Sharp, rude, abrupt, uncaring. My visit reminded me of fat-free ice cream: downright awful!", "label": 1}, {"sentence1": "If I could give it zero stars I would!!! Incredibly rude staff. Our waitress didn't even say 1 word to us and never responded when we asked for things. Just walked away. How are you in the service industry? On top of it food was terrible! The only thing that could make this meal any worse is food poisoning!", "label": 1}, {"sentence1": "Love Target but not this one! Used to live by the Hilliard Target on Trueman -it was awesome!\nGraceland Target is out of literally anything I want on a regular basis (a gallon of distilled water) really no shelve light issue here! Rare exotic food like Yogurt - empty sections... Target you are better than this- fix this store in Columbus Ohio!!!", "label": 1}, {"sentence1": "This place has gone way down hill. The quality of food is terrible. My family would order take out at least 3 times a week. My husband and I are hard working professionals that do always have the time to cook. We have 3 kids. Ever since Sal left.... This place has gone to sh$t. Now when we order from her we cringe.", "label": 1}, {"sentence1": "I just want to say one thing- I have never had a pizza with no tomato sauce, and I hope to never have one again. We ordered a deep dish Italian style pizza. When the pizza arrived, it was not deep dish (just looked like a large). The toppings were falling off the pizza- mainly because there were only diced tomatoes providing a base. The bread sticks were also unappetizing. The worst part is that me and the man both felt sick after eating here. I really wanted to like this place, but happa-not-gonna.", "label": 1}, {"sentence1": "We did not even eat. As soon as we stepped in the door, there was a strong smell coming from the bathroom. Bathroom is right up front, turned right around and left", "label": 1}, {"sentence1": "I've sold out and taken the details of this rating down, however, I IMPLORE that you read the other reviews and dictate if this is a company you wish to do business with or not.\n\nThe ONE STAR is well earned.", "label": 1}, {"sentence1": "20 minutes + in the drive through due to the broken intercom system.  \n\nRecieved a lovely over iced - watered down coffee too.", "label": 1}, {"sentence1": "Had a very good experience with this company!  They arrived early, stuck to their quote and did a very good job.", "label": 5}, {"sentence1": "I should really try to branch out from my usual order, but the grilled cheese is the most insane mouthful of happiness I've ever experienced. At this point I should be making a commission off all the people I've recommended it to because I can't keep this delicious sandwich out of my mouth - literally and figuratively.", "label": 5}, {"sentence1": "I favor this for my coworkers all the time.  It's amazing no matter the taco you get.  Delicious.", "label": 5}, {"sentence1": "I have been many times and have never been disappointed. Everything I've ever ordered was amazing, especially the pasta dishes. Amazing italian food!", "label": 5}, {"sentence1": "Kay and her staff have been great to me the past five years. Whenever I needed something very nice they made it happen and went above and beyond my expectations. Thank you for the great service and always being so accommodating!", "label": 5}, {"sentence1": "The bacon wrapped stuffed shrimp appetizer, tasted spectacular! The fish and chips had a great fry as well. Lastly the New York cheesecake was decent.", "label": 5}, {"sentence1": "I dream about their coconut popsicle. The absolute best popsicle I've every had in my whole life.  I will gladly drive in to SoWa every week for one.  Perfection!", "label": 5}, {"sentence1": "neat and meticulous. I'm so happy I found this hidden 5-starred place. One of the two nail salons in GA I'd love to come back again.", "label": 5}, {"sentence1": "A little pricey, but the food is worth it! I came in for the first time on a recommendation from a friend, and I was not disappointed.", "label": 5}, {"sentence1": "Great atmosphere. Great service. Great food. What more can you ask for. This is a little gem on the water on Lake Monroe in Sanford.", "label": 5}, {"sentence1": "We dine at this habaneros whenever we get a chance.  The service is wonderful and the food is amazing! Fresher tasting than Don Pablos for sure. The margaritas are delish too. Nice atmosphere and friendly folks", "label": 5}, {"sentence1": "Great wine, friendly people, cute place. I would recommend this place and will be going back.", "label": 5}, {"sentence1": "Super fun, great place to get drinks. Though you may be tempted to go for the cheapest pitcher of margarita's on the menu, the extra few dollars you throw down are well worth it. Cheapest place to eat and drink in Fanuel Hall Love!", "label": 5}, {"sentence1": "Becca has been quite helpful with our communication and working through challenges during a transitional time in our marriage. We look forward to seeing her and feel a sense of accomplishment after every session. She is very comforting and easy to talk to whilst having a professional yet welcoming environment. Both myself and my spouse would highly recommend her services. She also provides the convenience of online scheduling and a streamlined billing service to make everything very easy.", "label": 5}, {"sentence1": "Someone recommended Canine House of Style to me and I am so glad they did. They do a great job grooming, always listening to what I want. It is a small and very personal atmosphere and Barry, the owner, is passionate about what he does and it shows.", "label": 5}, {"sentence1": "Straight up smackadoodle. Had the 4 P's Prompt service, Personable employees, Price was right, Painless food delivery. For sure coming back", "label": 5}, {"sentence1": "The old fashioned buttermilk cruler was really good. The other unique flavors were just meh. One of the workers was really snarky.", "label": 3}, {"sentence1": "Not one of my favorites, but it is very convenient to the house.\n\nFood is good, staff is friendly.  If I was a beer drinker I'm sure this would be higher on my list.", "label": 3}, {"sentence1": "Dickey's is fine when other restaurants might be busy and we don't feel like waiting.  Or when we have a coupon.  The food tastes fine, they have root beer which is great, and warm sauces make it special, but the prices are just a bit too high for their portion sizes.  I'd rather spend a little more somewhere else and have leftovers for the next day.\n\nThe management is always friendly, but sometimes the counter service can lack a connection.", "label": 3}, {"sentence1": "Opa! has the best coffee patio in South Austin, possibly the city, and the beer/wine/drink selection is pretty good. The backroom is okay to study in, but not ideal, seeing as Opa! regularly hosts loud music and louder wine drinkers. The food is fine, but definitely over priced. Come to Opa! for a drink, but plan to eat elsewhere.", "label": 3}, {"sentence1": "I really want to love this place!\nand the only reason why i am giving it 3 stars is because the people there were more than friendly and nice! in terms of cleanliness and customer service...it was fantastic!\n\nbut i will never get my nails done there again..a waste of money!\nits been less than 12 hours, and they already chipped! \nmy nailpolish lasts longer when i do it!", "label": 3}, {"sentence1": "Went to Portland and had to make a stop here to try their chicken wings. Don't see the hype as they were very salty and over priced imo. definitely not worth the wait. We waited almost an hour before getting seated!", "label": 3}, {"sentence1": "Waited 20 mins for a quasi-cooked item. Not impressed, and not the first time this has happened", "label": 3}, {"sentence1": "Service is good. Kind of like a 50's diner. It's downtown and I support anything downtown. I got the Rueben sandwich. They serve waffle fries. Mine were cold and not many of them. Rueben was meh...worth maybe $8 but not a $12 Rueben. 3 out of 5 stars. I'll check it out again. Good late night spot maybe.", "label": 3}, {"sentence1": "Food is pretty good but it's definitely caters to the Non-Chinese crowd.  The food is a bit on the expensive side for Chinese and most of the sauces are over powered.  Surprisingly, Shanghai dumplings are pretty good here.  Expect this place to be pretty busy with Hipsters and Yuppie families.", "label": 3}, {"sentence1": "I ordered Bun Rieu. Very disappointing. It was so sweet that I barely finished 1/3 of it. My husband ordered fish in clay pot and they told us they ran out of all the fish: ridiculous! He ordered broken rice combo. The meatloaf and the pork were so dry. He said it was good because he was so hungry. Later on he agreed with me that the food was not good. I also ordered steamed rice cake for appetizer: awful! I will not come back: other reviews are so misleading.", "label": 3}, {"sentence1": "Malaysian laksa was pretty good... side dish fishballs is average. But their cash only policy (no credit or debit cards) made them lose a star.", "label": 3}, {"sentence1": "Probably better from a food truck. The restaurant has more of a to go type feel. Counter order, delivered to your table. The website says they have a large selection of craft beer and wine, which they do. BUT, no liquor license, so you can't have a beer with your burger if you are eating there. We were really looking forward to a beer, so that was disappointing. Upside, the burger was solid, with lots of options for dietary restrictions. Sweet potato fries were okay, salty but not crispy.", "label": 3}, {"sentence1": "Ok I love this place...  but it just the physical building.....not the workers , they are so arrogant.. I do not feel welcome...  so went out and got a juice outside after shopping.. ....I can drive to McMinnville to harvest fresh get the same juice and green shot for less $ and attitude..  I will continue to shop here as a coop. It's not corporate....But i now have to play the attitude game... to even get help.. sorry but good food is about caring and sharing not I am better than you..", "label": 3}, {"sentence1": "A very clever and comfortable space. Apps are very good as is the beer selection. It was a great choice for a rainy Saturday afternoon.", "label": 3}, {"sentence1": "A year ago, I would give it 5 stars. Now, they moved from two layers of bread to one thin layer which is not strong enough to hold the sandwich. So, at the end, your donair sandwich becomes donair salad.", "label": 3}, {"sentence1": "Great location, great room, efficient staff. I truly love and always look to stay at the Westin wherever I travel however this trip left a sour taste in my mouth. After a lovely weekend stay in Boston my fiance and I go to retrieve our car and get slapped with a close to $100 bill for parking. Are you people insane? This is what you charge your loyalty SPG guests? The price is not warranted and I'll give it a second thought before booking with the Westin again.", "label": 3}]