[{"sentence1": "They don't allow dancing... 'nuff said.  Seriously?  You're the only bar open till 2am in Brighton, you have a juke box, and you don't allow dancing???  What will be next, no smiling? no laughing? no being drunk?  Also, they don't like my boyfriend... one time, many many moons ago he got kicked out, and now they barely let him in... buuut I still find myself here at 2 am closing some weekend nights... oh last drop, why are you so tempting...", "label": 2}, {"sentence1": "I would not recommend this place to anyone.  We placed an order to go and you would think that we had inconvenienced the person that handed us our food.  They forgot to give us the drinks we ordered and were almost rude about it.  The food was at best mediocre but the plantains were great.  The chips were soggy and salsa was Awful. Will not go back.", "label": 2}, {"sentence1": "Been waiting all day for Veterans day.  Person that took my order was just rude. \nThe Sandwich was flat and tasted old, fries were cold and full of broken bits.  This was not a good experience for my family on veterans day. This shall be remembered.  The worst Veterans day meal I've ever had.", "label": 2}, {"sentence1": "Honestly the airport should be evaluated based on Terminals. The terminal I went through this time was really old. \n\nMonorails are cool for the 1 minute that you're in them but the terminal needs to be refurbished. (Particularly discussing the terminal Jet Blue uses at the moment.", "label": 2}, {"sentence1": "The restaurant is very nice. Service is good but food is another story. I ordered filet mignon medium rare and expected the meat to be pink inside but it was more like medium done. My husband ordered churasco and usually it is very tasty but in here is under seasoned. My friend had pork loin. Not only was it over cooked, but also was so bland.\nThe manager was so nice to ask my friend to order something else from the menu and gave all of us free dessert but the food does not meet my expectation.", "label": 2}, {"sentence1": "Good atmosphere and music . Bad BBQ and sides . This is not the real deal. Maybe passable for a naive new englander who doesn't know better but being a southern boy this doesn't come close to satisfactory. More if a novelty. Crap service too. Gotta have the southern hospitality. Maybe a good place to grab a beer and burrito but that's it.", "label": 2}, {"sentence1": "Had Tom Yum soup and pad Thai.  Mediocre at best but then again why did I order Thai food from a Chinese restaurant.", "label": 2}, {"sentence1": "Oh no.... You gave me everything I ordered but guess what it's cold very cold as in a refrigerator befor you.gave it to me cold. Yes I ordered a hot item an xxl chicken burrito, ugg disappointed... I'll give you one more chance then I'm moving on...", "label": 2}, {"sentence1": "Great food -- Tons of flavor.  Some of my dearest friends think it is the best food they have ever had.", "label": 4}, {"sentence1": "Good service, but a little limited on the curry selection. Would come here again next time I'm in Austin.", "label": 4}, {"sentence1": "Buffalo bites are on point!! Beers good as usual but don't waste your time with the Bloody Mary it wasn't served like the photo in the menu or garnished with what it says.", "label": 4}, {"sentence1": "I really enjoyed their margherita pizza!! Great place to talk and enjoy a good meal! Would definitely go back", "label": 4}, {"sentence1": "My boyfriend and I went to The Fireplace last week and walked out confused about the service. Our food was incredible and the ambiance was great but we didn't feel like our service was all that great.\n\nRather than just complain on Yelp, I emailed the restaurant to explain my concerns from the previous night. Not only did the GM get right back to me, but she addressed our concerns and couldn't have been nicer. I'd highly suggest The Fireplace to anyone looking for quality, fresh local food and excellent commitment to the customer.", "label": 4}, {"sentence1": "Stopped by for lunch. It wasn't very crowded went in but the food was good and service was very prompt.", "label": 4}, {"sentence1": "Really good for quick lunch on the go - they make it quick. Like the other VERTS in Boston, they're super friendly and the food is always flavorful and consistent.\n\nNot a great place to hang out - no outlets - but it's clean and functional.", "label": 4}, {"sentence1": "Delicious burger!  But definately pricey (which is why I dinged a star).  And parking can be a pain but if you're lucky, you can score a spot right in the front of the restaurant!  I had the No.3- Banh Mi Burger which was great but a little spicy due to the jalapenos.  The parmesan garlic fries were to die for!  Yummy!  Next time I will try a shake.  Try to get out there for lunch - 1130 - 330 for the $8.25 lunch which include burger, fries and a drink! cant beat that!! Cant wait to go back!", "label": 4}, {"sentence1": "Sushi here was not good at all. Fish and rolls...not fresh...very disappointing. \n\nThe rice...\n\nWhat is going on with all these sushi places that cannot make good sushi rice? Hey guys, go on Amazon and buy a commercial grade Zohurishi rice maker. Bam! You have sushi quality rice.\n\nAlso, the place looked a little run down inside.", "label": 1}, {"sentence1": "Check out the Better Business Bureau's page on these yahoos.\n\nhttps://www.bbb.org/us/or/portland/profile/internet-marketing-services/vendors-united-1296-22952135/complaints", "label": 1}, {"sentence1": "Heads up! This location is under new ownership as of 3 weeks ago. I knew something was wrong when we sat in the empty dining room, ate flavorless food and then to top it off, they refused to accept a gift card. Supposedly the new owners cannot process Dexters gift cards even though the card clearly states Windermere locations and they retain the name on both the physical restaurant and menu. Bad business and great way to lose customers.", "label": 1}, {"sentence1": "Came to Austin to check out some popular eats, was sorely disappointed with ESK. Friends said it was good, reviews said it was good, the actual food was terrible. Four of us did not like anything and we ordered 1/3 of the menu to try it all! Not sure what the hype is about, y'all crazy.", "label": 1}, {"sentence1": "I should have read the reviews before grabbing a quick bite here. The food was cold and the cashier was rude. When I asked for ketchup for my fries, you would have thought it was the end of the world. Seriously, she could have just cussed me out instead of grumbling under her breath and then glaring at me while she shoved handful after handful of condiment packs into the basket. Lesson learned!", "label": 1}, {"sentence1": "Do not eat here!! Found roaches and yellow crap in my rice!!! Horrible! Will not be ordering from here again..\n\n\nWhen we called to tell them the problem, the women on the phone pretended not to speak English... Poor Food and Customer Service", "label": 1}, {"sentence1": "purchased a product from here and the next day the price was reduced over a hundred the manager refused a priced reduction refund and said they do not do this.", "label": 1}, {"sentence1": "salad was not very good. I paid extra for the chicken and it was dry, too small and not much flavor. I called in to management to let them know and they did not seem to care... :/", "label": 1}, {"sentence1": "Best sandwich shop in Portland. They call out me by name as soon as I walk in the joint. Chuck, the owner, is a great guy. Treats his staff well. Super affordable and the sandwiches are great. I drive out of my way to go there. They don't make places like this anymore.", "label": 5}, {"sentence1": "Daniel is amazing! Recommended a juice cleanse and I also purchased a super juice shot with my green goddess. Delish!! Will be back", "label": 5}, {"sentence1": "One of Boston's best, but be careful if you're on a budget. It's easy to rack up a bill here! Not that you'll care...\n\nOrder a bottle of wine, a variety of oysters, 2 crab legs, a lobster roll with butter and entree to share. You'll leave full and happy.", "label": 5}, {"sentence1": "Hands down the best Italian food I've had! The staff was friendly, ambiance just like a hideaway, and the food was delicious. As a tiramisu fanatic, I would go back just for the tiramisu. It was perfectly dipped in the espresso, and super smooth. Would definitely come back here.", "label": 5}, {"sentence1": "Consistently good food. I typically get the Pho with side items and they are very good. Simple atmosphere but good for a little computer work.", "label": 5}, {"sentence1": "This place is amazing.  Bread very fresh, they cut the meats in front of you including the cheese.  They take pride in there subs and service and give you the best of both. My daughter who is three loves coming here because they're so friendly and nice.", "label": 5}, {"sentence1": "We reserved a car late at night the night before we were getting a single day rental. It happened to be a bad day for the new branch (people called in sick unexpectedly, etc) and we could barely tell. Everybody was so accommodating, genuine, helpful and generous that I'm almost glad that we did catch them on an off day. I highly recommend this location and the NW Sandy one. Diane, Victor and Blake were awesome!", "label": 5}, {"sentence1": "Congratulations on having the world's BEST cup of coffee! Today was my second time to get the best Latte I have EVER had! My favorite place in the world for coffee!", "label": 5}, {"sentence1": "So this was my first manicure ever, and my second pedicure. $40 seems like a great deal. I didnt get the awesome asian woman who is really focused and meticulous (and i saw her give really rigorous massages), but I had a good experience. My main issue is that the polish started chipping that same day, and now, a week out, it's awful. Maybe that's the case everywhere, but either way, Im not so impressed with that part...", "label": 3}, {"sentence1": "I have always had good experiences here but today i was completely unsatisfied. The server was unable to adjust to small everyday things. We had just received our appetizers when our entrees arrived and, didn't clear empty glasses from the table. Also asked my 11 year old daughter to pass my margarita to me. Some of the food was not the best but the manager handled it very well. I was not completely satisfied with the experience.", "label": 3}, {"sentence1": "Pretty big restaurant near Sandy Springs. We ordered a bunch of tapas and a paella. Was disappointed at the paella as it wasn't cooked properly (definitely tasted like stir-fry).\n\nPlace is cheap and good place for bigger groups. I didn't think the food was particularly good or special.", "label": 3}, {"sentence1": "It's one of the slower customer service-oriented ones, but I like the corner layout, single row of tables in the back, and relatively easy to find parking in this area.  Even try the side streets too as there's enough on Broadway & Fir.\n\nAnd really, not as hectic as the DT ones.", "label": 3}, {"sentence1": "Maybe invest in a better blender or at least send a fork n knife with your delivery. I had to chew my entire smoothie lol.", "label": 3}, {"sentence1": "We were attractive by its high rate in website. I just want to said it was not bad after eating, not really good than my imagination. It is easy to find.", "label": 3}, {"sentence1": "Casual Greek cafe food. great for the money. Not bad food either.", "label": 3}, {"sentence1": "3.5 stars for Red Star. Incidentally this was stop number 2 on our first night in portland. We had a very unimpressive with the karaoke bar (it was inside the mall) so we were hoping this might be a better experience. \n\nI wasn't impressed with their cocktails however the small bites, specifically the lamb meatballs were pretty damn good -- and I'm not a lamb fan.\n\nThe vibe was a little odd that evening, extremely quiet considering it was a Thursday night. We stayed about half an hour and moved on to the next spot.", "label": 3}]