[{"sentence1": "Not a fan.\n\nI tried the OG with chicken today.  It was a strange mishmash of flavors.  I found the portion to be generous, unlike a few other reviewers.  The soggy greens were bleh, but on the positive side, the pickled daikon & carrots were tasty.   Sorry, I tried to like it.", "label": 2}, {"sentence1": "It was disappointing.  I expected more considering the reviews.  We went in Dec for the Holiday show.  It was a bit amateurish and silly.  Not a real holiday show other than a few songs and decor and the characters were in their gangsta mode to be in line with the theme of the establishment. The food was OK.  Lots of options but not great.  Even the presentation was lacking.  We spoke to a woman in the next table.  She had been to Capone's when they actually had a mystery and she said it was a better show.", "label": 2}, {"sentence1": "Friendly staff.  Surprised with Marriott name and price the quality of mattresses and bedding.  Seriously makes me debate switching back to Hilton.  Haven't  tried breakfast yet.  Laying here listening to springs on the very uncomfortable bed.  Bathroom is clean but needs renovation.", "label": 2}, {"sentence1": "Food was alright but service was mediocre.  JT didn't get his burger until it was time to leave but they gave it to him for free and that was pretty chill.", "label": 2}, {"sentence1": "Overall, very good.  Started with Gin and Tonic that was made with housemade tonic and clarified lime juice.  Very refreshing on a warm Saturday evening.\nOur group of 5 shared 2 paella and 5 tapas as recommended by our server.  Perfect amount of food.  Bravas was good, Ataula's is sl better but close.  Porcini croquette was so yummy!\nThe vegetarian paella was better than the seafood Barcellonetta, in my opinion.\nHad to run before we could get the Xurros next door.  Next time!!", "label": 4}, {"sentence1": "Absolutely love this place. Great options for Vegetarians & Vegans. Besides the long wait and the non-vegan wines I give this place 4 stars.", "label": 4}, {"sentence1": "This is a great park, just across the street from trendy shops and The Thinkery. A big pond with ducks, a paved walking path, a huge fenced in playground with plenty of options, nice landscaping, big dramatic fountains and pergolas, and plenty of parking. I spent a day here with a friend and her daughter and was charmed by all of the lovely amenities.", "label": 4}, {"sentence1": "Best Mac & Cheese on the planet! Our sweet waitress brought us a free sample of  Collards & cornbread muffins since we were first time guests & they were amazing too! Some good Ol' southern hospitality! Love it!", "label": 4}, {"sentence1": "I have never eaten anything so salty in my whole life. It was so bad that I won't try again. The service was super friendly and I appreciated that.", "label": 1}, {"sentence1": "If 0 stars was a rating I would have given it that. The service was alright, everyone was pleasant for the most part and pretty fast. The chips and salsa were pretty good. When the food came we were in shock! Honestly I have had better food at Taco Bell! The rice had absolutely no flavor the beans definitely came from the can and the enchilada and hard taco were definitely microwaved. The worst part, the ground beef was still pink! Please do yourself a favor and DO NOT GO HERE!", "label": 1}, {"sentence1": "All is can say is over the years,the service here has gone from bad to worse. Even the quality of food as well. You have got better choices in terms of quality of food and service right next to this.", "label": 1}, {"sentence1": "They took an hour and a half to give us the food and they gave us really cold tacos after that wait! I do not recommend this restaurant.", "label": 1}, {"sentence1": "Incredible breakfast spot. Was only in Portland for 48 hrs and I'm so glad that I picked this out of a very small list of places to eat.", "label": 5}, {"sentence1": "To kick off, im only 19 years of age. For any youngster out here, this is the BEST hotel to stay in and it is Inexpensive. I would like to give a HUGE shout out to the manager Jeffery, he made a lot possible for us to have an AMAZING stay!", "label": 5}, {"sentence1": "I love this place, it's a great lunch spot. Sandwiches are made fresh as you order with good quality ingredients too... \n\nThe sandwiches are so good and well worth the price. They are quite quick and efficient so there isn't a big wait or anything to receive your food which makes it perfect to grab something and bring it back to the office.\n\nIt's in the food court at Royal Centre mall so it can get quite busy with the lunch rush so best to go early!", "label": 5}, {"sentence1": "Delicious tacos. Had one of each meat kind and couldn't pick a favorite. Normal spice was pretty spicy for me but I'm a weenie. Friendly fast service.", "label": 5}, {"sentence1": "Classic north End location for an after dinner coffee and italian dessert. This place is almost always busy but it is not overly difficult to grab a seat. They serve typical italian desserts, nothing spectacular but there is something everyone in your group will be happy with.", "label": 3}, {"sentence1": "The food is good but the plates have gotten smaller over the years, which is a real downer because the food is also very overpriced for the amount given. Depending on when u go u will get good service but i have also been in there with an older woman that gave me a death look and totally turned me off to the place for a while.", "label": 3}, {"sentence1": "I got a chicken fajita burrito and it was awful. The chicken was tasteless and watery. My mom got a chicken taco salad, same deal. My husband got a fish burrito that he said was fine.\n\nMy toddler loves cheeseburgers, so I ordered one for her (I've never done that in a Mexican restaurant) and the burger was really good, hence the three stars. The fries with cheese and jalapenos were also good.", "label": 3}, {"sentence1": "I Love coming to this place.  I always see something odd here, weather it's the people or the art on the wall.  This is always a stop when I'm in Austin!   So, tonight when coming my food was a tad bit cold.  my eggs COLD, my bacon, COLD and my pancake was COLD.  Granted it was good but I do like HOT FOOD!  Not a happy camper!", "label": 3}]