[{"sentence1": "Had pad Thai with pork. I once saw a Thai chef school Gordon Ramsay on TV that his had no flavor, that it needed to be a battle between sweet and sour flavors. I thought the same of this. Good ingredients but minimal flavor. There must be better in Boston.", "label": 2}, {"sentence1": "I satarted going to Sage clinic about one month ago. i had an experience with anotther clinic before. I found this clinic more money oriented than patient care focused. They charge the first visit and any lab readings or any consults afterwards also you have to pay , even when you have a question!!!  And during your consult time that you have paid for, the doctor promote the services to make more money therefore there is no time left for you to ask any questions!!!!! \nI am very disappointed!", "label": 2}, {"sentence1": "This place has not aged well. Or maybe I've aged too well to \"get\" this place anymore. \n\nThe music is rarely retro. It's mumble rap and worst. The bartenders are rarely thrilled to take your order. The bathroom is a cash bomb of a (nice woman) trying to get tips for handing you a paper towel and to sell you stuff.\n\nPlus, unless you show up early enough...a $10. Nah.", "label": 2}, {"sentence1": "Service for take out was great but the wrap was so mushy by the time I got home in 15 it was inedible.  $14 in the trash...", "label": 2}, {"sentence1": "Met up with friends for a celebration dinner.  I had the veggie burger with french fries.  The burger was remarkably moist and delicious. It almost tasted like stuffing from Thanksgiving. The french fries were large chip style, and it also came with a salad for only $10.  Service was very pleasant and not rushed. Will definitely go back the next time I'm in Porter Square.", "label": 4}, {"sentence1": "Trip there during restaurant week and am glad we got there, place is not real hugh but the sound was nicely controlled as it was full, service was good and attentive(they kept the water glass full) , service was very good, steak tartar was excellent as was the 12 oz steak (great!), dessert was ok but we are not big desert eaters, drinks were good, overall nice experience, must get back again to try their burger!!", "label": 4}, {"sentence1": "Scott the maintenance team lead & Jovan the concierge lead are both great. Very friendly, helpful, & professional. \n\nAdvice to management: give maintenance more room on the capital/maintenance expenses. Just because the building is less than 10 years old doesn't mean there aren't real and frequent needs. If the building isn't kept in as-new condition, the dozen other even newer, luxury apt buildings in walking distance will quickly become a lot more attractive.", "label": 4}, {"sentence1": "Great local dinner option, plenty of options and the specials are always great. The sangria is my favorite. Past 9pm the night life really picks up and it is a great place to stop in for a beverage and a good time. They have live music a lot too which is great! Awesome addition to revere!", "label": 4}, {"sentence1": "My husband ordered a chicken sandwich and after 30 minutes he finally got a sandwich with FROZEN Bell peppers on it. Terrible service", "label": 1}, {"sentence1": "Not sure if this place is still open. Tried to call multiple times within a week and never had a message returned.", "label": 1}, {"sentence1": "HORRIBLE and UNFRIENDLY SERVICE!\nServer behind the gelato counter simply stared at us when we entered. He was eating gelato and using his phone, ignoring us---the only customers in the room. \nWe asked his opinion about favors. He said very little and told us to go to the other counter to order. When ticket printed, it had the size but not flavor. We had to repeat information to him. VERY INEFFICIENT!\nCouldn't the company find someone who is cordial?", "label": 1}, {"sentence1": "Absolute garbage. Not fresh fish, high prices, and all around low value. Also took forever for our warm dishes to come out.", "label": 1}, {"sentence1": "Great variety of yogurts and toppings.  Friendly staff.  Very nice decor, very inviting and fun.", "label": 5}, {"sentence1": "The reason this gets 5 stars is because of our great waitress. She made the experience worth every star. She was on top of her game, offered us samples of beer, and offered to split our check for our party of 8 without us asking. Now for the important part the food. I got the smoked chicken, it was moist and well seasoned. A good choice for sure. Overall I like this place and wouldn't mind coming back for a casual bite to eat", "label": 5}, {"sentence1": "One of my favorite dining experience in atlanta! The staff here is incredibly welcoming and helpful in creating an atmosphere of genuine southern hospitality. I had their shrimp and grits for main and peach cobbler for dessert(both are a must try). This is definitely a place to visit for both locals and travelers.", "label": 5}, {"sentence1": "Best pizza. Best espresso martinis. Fantastic service. Super clean, and all safety protocols in place. Couldn't recommend more!", "label": 5}, {"sentence1": "I went to lamberts on a mission to devour no less than half a cow. I dreamed of shoveling piles and piles of BBQ into my face ALL day. I would normally go to franklins but they were sold out....\n\nAnyways, my food arrives and it was...pretty? The flavors were good but the portions were ridiculous for the price.\n\nThis would be a cute date spot though. Service was great and the ambiance was very cozy.", "label": 3}, {"sentence1": "Not set up well and always crowded. Plan to spend at least an hour when you get here or you're trying to leave. Avoid it on spring break or over summer if possible", "label": 3}, {"sentence1": "Typical McDonalds. Always get my order right, food is good, fast service and it is clean.", "label": 3}, {"sentence1": "Tasted the Bulgogi, which was pretty tasty.  The rest well you know, rice, kimchi (which was good but not spicy enough for me).  For food cart food it was good stuff.  I would eat it again. :)", "label": 3}]