[{"sentence1": "Ok chinese food.. Dimsum is ok not a full variety.. Liked the beef noodle special it will definitely fill u up.. American menu is typical", "label": 2}, {"sentence1": "I'm down with food trailers and all and I love soco freaks, but the service was weird, the food came out of tin foil in a crockpot, the sauce is an oily salt lick ripoff, was overpriced, and the kicker.....diarreah at 3 am. Muck fo sho.", "label": 2}, {"sentence1": "Ate here for the first time & it was pretty average. I ordered the breakfast burger and it took 15-20 minutes to make (with only one customer ahead of me in line). It wasn't bad but definitely not great.", "label": 2}, {"sentence1": "No microwave in the rooms, also don't have a public microwave... so if you are hungry at night or you want to microwave some water (without using their questionable coffee maker), you are out of luck. Totally surprised by the lack of microwave, beware if you frequently travels/work at night/ business traveler from a different time zone.", "label": 2}, {"sentence1": "Thai tea- some of the best I've had. We ordered sticky rice, wings, and a curry dish. The curry was wonderful, wings were really packed full of flavor. Our server forgot our sticky rice, but gave it to us for free after noticing the mistake! Great service. Wish I had more!", "label": 4}, {"sentence1": "2 of us returned accompanied by 9 year old twins from California and a retired birthday child. The sometimes picky young eaters ate their share, as did the rest of us. So I should upgrade my rating. The spicy shrimp required white rice, but was eaten even by the young ones. The beef and vegetable chow foon was better than the beef chow foon we had the last time.one of the young eaters helped herself to more Lo mein without prompting.", "label": 4}, {"sentence1": "Decent quality for the price. Been going there for yrs. Not fancy or high end & doesn't pretend to be. Staff are always friendly. Menu has typical selection of J food so nothing overly creative or imaginative but food is always fresh.", "label": 4}, {"sentence1": "Not the cheapest sandwiches but pretty delicious after the fact.\n\nI like that you get to really customize your sandwich. I wish they had more toppings though.\n\nYou pick the bread.\nYou pick the meat.\nYou pick the cheese.\nYou pick the toppings.\nOlive oil and/or balsamic\nSalt and/or Pepper\n\nIt's a nice stop if you're in the area.", "label": 4}, {"sentence1": "Avoid this place. On Friday September 25, 2015 they had a bartender who didn't know how to make a drink, waited an hour to get the check, then DOUBLE CHARGED my credit card. Classic bar scam and zero respect or regards for customers. Don't support this place.", "label": 1}, {"sentence1": "Yes Jennifer. It is your job to properly manage your relationship with uber and any other provider , for that matter.", "label": 1}, {"sentence1": "THE WORST SERVICE EVER!  I dropped my camera off in March of 2014 and just decided to drop in today (July) to see if it was fixed.  Not only did the OWNER not have any recollection of my camera, but he tried to blame his lack of organization on me not calling to check on the status.  There's junk every where and it looks like this guy doesn't stay on top of his work.  Buyers beware!!!", "label": 1}, {"sentence1": "Lousy service, food is poor quality (Publix supermarket cook better chicken)will never go back", "label": 1}, {"sentence1": "This company is the best!! From the 1st person you speak to to the last of the installations they are  really professional. We were very comfortable talking and asking questions to everyone we spoke to. We had a Bay window put in our dining Room and we absolutely love it!!!!\nWe will be definately recommending to all of family and friends!!", "label": 5}, {"sentence1": "I've only tried their bubble milk tea and salted cheese tea but both were really good, I usually ask for little sugar but their regular sugar is the perfect level (definitely not too sweet). If you're near downtown crossing this is definitely the most convenient and best option!", "label": 5}, {"sentence1": "I had a really positive experience with this company. I've dealt with a number of moving companies in the past, and I had a friend that needed some large items moved last second on a weekend. Nick showed up and took care of it quickly and without issue. Nothing broken, no walls scraped. It was great. I will recommend you guys to my other friends and myself when I move.", "label": 5}, {"sentence1": "Welcome to Moe's! This is by far my favorite place to grab a quick burrito or a bowl. I like it much better than their competition - it tastes fresher to me, and the rice is always cooked through. \n\nRecommend getting the homewrecker - it comes with guac and sour cream and your choice of proteins and veggies. They also have free chips and a salsa bar.\n\n::Tip:: make sure you have them add some chipotle ranch to whatever you order :)", "label": 5}, {"sentence1": "Good seafood. I did not like the tuna sushi roll...but one bad item does not define a restaurant!!! \nHappy hour is perfect for a group after work! The crab cakes, lobster bisque and shrimp cocktail are my fav appetizers to have!!\nGreat bar scene!", "label": 3}, {"sentence1": "Food was mediocre and service was good. Three stars is the most I could give. I been to real diners in New York and this one couldn't compare but the local aspect of it made it convenient and decent.", "label": 3}, {"sentence1": "3 Stars for location & beautiful covered patio.  Food is fresh but seriously bland.  My husband ordered the burrito, I ordered the chicken tacos... nothing special and I was a little taken back by the bright yellow color of the cheese on top.  The best part about the meal is the tortilla chips and a Borracho beans.  Slowwwww service.  Will not be returning here... Too many other awesome restaurants in Austin", "label": 3}, {"sentence1": "A solid 3.  The food is all American in a convenient spot close to the freeway.  Breakfast is served all day and the portions are large, except if you're ordering a salad.  Cobb was pretty average with chopped iceberg, 2 grape tomatoes and 2 slices of cucumber and avocado on top with slices chicken and blue crumbles.  Meh.  My friends enjoyed their corned beef hash and pancakes/egg combo.  All was fine.", "label": 3}]