[{"sentence1": "A little misleading considering this CVS does not have a Pharmacy. So no flu shots available. Update the verbiage on maps to not call it a Pharmacy and instead, call it a store.", "label": 2}, {"sentence1": "Everything is over priced. If you're not careful in calculating what you purchased they will over charge you. I also got charged for drinks I didn't order. Not very friendly service. A glass of champagne cost $11s. My friend was drunk, even after I told them no they didn't stop her from ordering.", "label": 2}, {"sentence1": "Vegies are too salty，猪肉炖粉条没有酸菜我的天...跟以前吃过的东北菜很不一样，很失望....如果不是东北菜的名头那应该还不错！到底要写多少才能post？很烦", "label": 2}, {"sentence1": "I cannot believe this is a cash-only restaurant. We are in 2019... come on! And it's not well advertised either, you basically only find it out when you have to pay.\nFood is average and service is ok... not great but sufficient to get by. They seemed to be overwhelmed by many guests and too few waiters.", "label": 2}, {"sentence1": "Meh. Food is A-OK, but rarely exactly what was ordered. 50% of the time wraps come in white wraps when wheat was ordered. Somehow my order of a grilled chicken salad with feta, turned into a Caesar salad with no parm, no caesar, add feta. As if I ordered a plate of lettuce and croutons?\n\nQuick and convenient, but huge lack of attention to detail. Food is 4 stars when correct, unfortunately that seems to be a rarity.", "label": 2}, {"sentence1": "Pretty bad food; this place seems like a great place for sports people and gamers as there are plenty of TV's, shuffleboard, billiards, etc. If you're visiting from out of town I'd stay away from here.", "label": 2}, {"sentence1": "First, the drive thru lady bungled my order, she seemed to not understand the word \"glazed\". I asked which of the cake donuts were unglazed and she looked confused. I ordered unglazed cake donuts and received just a mixed bag of glazed and unglazed, confirming that she did not understand this basic donut concept. It felt like a language barrier, but I don't know. \n\nTo top this off, the donuts were really not good. They tasted bland and squishy (good cake donuts should have a bit of a crust). Luckily there are plenty of places nearby to choose from.", "label": 2}, {"sentence1": "We used to LOVE to come here. Especially for the wonderful mussels. Well not only are the mussels no longer on the menu they replaced them with microscopely small clams.  No even in the same hemisphere. And our waiter was a hummer. Absolutely weird.", "label": 2}, {"sentence1": "Lunch buffet was awesome, sevres were attentive and polite. All in all a great lunch expereince for $9!", "label": 4}, {"sentence1": "My friend found a BEAUTIFUL dress here- loved their style.  She found a simple cowl-neck, sleeveless lace number that really suited her figure and she said it was really comfortable.    Really appreciate their emphasis on non-child-labor materials as well. However, the salespeople are a bit pushy.", "label": 4}, {"sentence1": "The migas here rock.  \n\nYeah, its pretty gay that they charge for chips and salsa but its damn good.  \n\nThey could do a little better with they're drink specials but you can't go wrong with a cold beer either.", "label": 4}, {"sentence1": "While the exterior of the restaurant could be spruced up the food is a god value. I've enjoyed the meals I've had hear including pork chops, lunch specials with soup and a chicken sandwich.", "label": 4}, {"sentence1": "I went there one night and got soup dumplings and rice cake noodles with a brown sauce. These are probably one of the best soup dumpling I've had and some of the best rice cake noodles I've also had very comparable to the other dumpling restaurants around Boston.", "label": 4}, {"sentence1": "We came here today with a rather big group of 20.  Everyone seemed to have an awesome time.  Even though the place was packed, service was decent.  The beer I had was just okay, but everyone seemed to enjoy their food.  I got the BBQ Chicken sandwich, which was excellent.  Many of the folks were happy with their mimosas and cool Bloody Mary bar.  Overall, very good experience!", "label": 4}, {"sentence1": "Vietnamese restaurant with a hipster decor, where you get to enjoy pho and water served in mason jars.\n\nI've had pho and lemongrass beef noodle soups here and was happy with the food.\n\nIf you get a window seat, you can also enjoy some sunset / beach / people watching at English Bay and Denman Street.\n\nOne negative though: better maintenance of the eating are could be useful. Each time I was here if would find some debris from the previous guests - newspaper / food remains left behind. Improvements on this front will improve the atmosphere.", "label": 4}, {"sentence1": "Solid take on modern dim sum. Be sure to try the tiger tears. I eat here regularly and rolled in at about 10:04pm the other night - 4 minutes after they normally stop seating; however the staff was gracious enough to accomodate me and my party anyway. Real class from a well run staff - Kudos to Joanne Chang and Christopher Myers.", "label": 4}, {"sentence1": "I 'll never seen something like this. If I could rate 0 stars I would do it. It is a scam I will never order from that place again!!!", "label": 1}, {"sentence1": "Worse delivered pizza ever.  I think I got someone's cancelled order.  Little sauce zero cheese barely warm and the are .3 miles fr ok m my house. This pizza hut used to be good  what happened. Last order ever from mr", "label": 1}, {"sentence1": "Did not deliver food after taking money. When I called to check up, the hostess was rude, won't even listen, and hung up on me. Also, noticed the consistency of the rude behavior of the hostess on other reviews. Really bad experience, stay away and spend your money somewhere else.", "label": 1}, {"sentence1": "Bad service.\nEvery time I got there they usually give me a very cold face. I felt that I am a waiter ,not a customer.\n\nOne time I ordered food form this shop. My friend went to pick up. When my friend come back, she said She Will  NEVER go this shop again.  I didn't get the food, I feel I got a lot of angry.\n\nFrom that time I didn't go this shop again.", "label": 1}, {"sentence1": "I was really looking forward to this meal in the north end but our experience was underwhelming. It's not really near the action and food scene of the north end. Lulu our waiter was wonderful, providing great friendly service. That's about the nicest thing I could say. The food was mediocre and the menu was uninspired, very basic fair. Our meatballs were even served cold. No love was put into the preparation of our food and it showed. And there was no kids menu which wasn't necessary but would have been nice not to pay $12 for spaghetti with butter.", "label": 1}, {"sentence1": "Food was very expensive, listed as $$, but had $45 cauliflower and other outrageous prices.  The service was very poor, with the waitstaff asking us if we wanted a simplified menu.  Would only recommend to those looking for pigs head and cauliflower at a car payments prices.", "label": 1}, {"sentence1": "Waitress talked more about the damn Club then our order. Steak House feel with a Boston Market type food which is very subpar. And a waitress Dawn was the worst. I don't think I'll be frequenting this place at all ever again. I overheard another guest talk about how their pasta was very dry and when they ask for more sauce and wanted to charge them extra WTF.", "label": 1}, {"sentence1": "We tried the newest location of Cup and Saucer twice. Both times our food was cold, potatoes raw and the waitstaff was too busy chatting with oneanother to serve us.\nTerrible!\nI wish you guys could get your act together because Kenton and North Portland in general needs more breakfast spots.", "label": 1}, {"sentence1": "Among the lobster roll I've ever had.  The Johnnycake was also delicious.  I went here a while back but I mainly remember the long wait.  I think it was close to 3 hours before we were finally seated.", "label": 5}, {"sentence1": "These are the BEST cupcakes. Don't even try any other place in Boston, nothing can compare. \n\nThey are the perfect level of sweetness and aren't too big. I normally don't like cupcakes because the frosting is too sweet but Georgetown's is perfect. Even my boyfriend who doesn't like sweets loves Georgetown. \n\nIf you go during off hours (weekdays after 5pm or weekend mornings) there is normally no line.\n\nMy favorites are the Red Velvet, Salted Caramel, and Lava Fudge.", "label": 5}, {"sentence1": "When in the Vancouver/Camas area, there isn't a better Thai place than Thai Lotus. We've tried numerous items. Favorite items include: pad woon sen, pad kee mao, yellow curry, pineapple fried rice, and holy basil (a.k.a ground chicken with crispy basil). The service is very friendly and they tolerate my 2yo daughter well.", "label": 5}, {"sentence1": "BOOM. Margarita pizza hmm TRIPLE DANK. And the atmosphere is BOMB DIGGITY. YEEOOWW", "label": 5}, {"sentence1": "If you love spice or hot pot this is the right place for you! I came to Six Po for dinner, the first impression is its wooden and modern clean atmosphere, which is very unique and welcoming. As for its food, everything was super fresh and just the right taste I expected and tons of options for you to choose from meat, veggies and seafood, etc. Strongly recommend it and would definitely come back!", "label": 5}, {"sentence1": "Exceptional and very friendly service. I love this place. The donuts and kolaches are amazing. EAT AT SUPER DONUT!!", "label": 5}, {"sentence1": "I like the verity of healthy options. It's great for people that like different tastes from vegan to meat lover. \n\nThe service was good and will go again.", "label": 5}, {"sentence1": "I have been coming here for many years and it has always been a favorite place for Chai or a variety of Oolongs and a nice selection of delicious vegetarian meals in a relaxing atmosphere. The wait staff are tea experts and always very friendly, even when it is really busy, they work really hard to provide the best service they can.\n\nYour tea will never go cold because they provide hot water heated by a candle for the Oolongs and the chai is in a nice tea pot that keeps the tea hot.", "label": 5}, {"sentence1": "Finally, actually got on this ride with the kids.  They really liked it.  I thought it was good, but the wait is unreasonable at this time.  I actually preferred the Frozen attraction at Hollywood Studios more.  It is a show instead of a ride, but that was really enjoyable.", "label": 3}, {"sentence1": "I had the Philly Cheesesteak and also the Grilled Salmon. I must say the Grilled Salmon was very Well done. The CheeseSteak was fulfilling but average. Nothing tooo \"Authentic\" about it, but tasty. Good Service! Pretty Staff all around the board. Will come again for drinks etc when in the area.", "label": 3}, {"sentence1": "Went here last night to watch the football game. The food was ok. I had the house salad with pulled pork. DO NOT Order the peach cobbler!! It was horrible! Basically canned peaches with granola! Yuk! We didnt even finish it. The waitress was really nice and even comped the desserts..when she realized no one had eaten them.", "label": 3}, {"sentence1": "This place is a reiteration of YeYe - a place I wasn't too fond of. This is definitely an upgrade, and the cold brew on tap is awesome. Of course, the location itself and the patio is also great.\n\nMy main complaints is that given its high-end look, the espresso was a bit disappointing. My girlfriend didn't finish her capp and the paninis were meh (but the lunch deal is good). \n\nI'll be back and if the espresso improves, I'm a fan.", "label": 3}, {"sentence1": "The bartender i had was trash! The drinks tasted like juice she didn't even greet us. She threw menus in front of us and waked off! The food was lukewarm ... i was just so disappointed this time around! It wasent even that crowded for a Saturday afternoon so i was quite confused as to why everything was bad. The first time i went the food was good but obviously they're inconsistent, they need better customer service, and better waitress, bartenders trained in service, professional, & mannerisms.", "label": 3}, {"sentence1": "The museum is good, but not great. It's nice for a visit, but if you've been to any of the major museums around the country, you'll probably be underwhelmed. I haven't been in a few years, so I'm not sure if it's any better. The Chihuly sculpture is nice at least, and I've never had a negative interaction with the staff. 3 stars because I'm spoiled and expect more, I guess, but it's not terrible. The building's pretty, and some of the art is good.", "label": 3}, {"sentence1": "They serve stumptown, beer and other drinks. Their vegan dishes were good but the space didn't work for me.", "label": 3}, {"sentence1": "Always a treat with the lamb lollipops and love the salad BUT as noisy as it gets!", "label": 3}]