[{"sentence1": "I had high expectations of this place and was greatly disappointed.  I did like the grits and the biscuits were ehhh....\n\nI'm really sad because I wanted to like this place sooo much, but oh well", "label": 2}, {"sentence1": "Can't get just a pita without paying for sides. Manager has to approve and its only  50 cents less.", "label": 2}, {"sentence1": "I went into Kupel's today to buy a few things. The whole staff had various protective gear including gloves. The person who took my order was very good and she changed her gloves twice especially after handling money.  I was surprised to see the owner in the white shirt and the manager counting money without gloves.  The manager (gray shirt) did not wash his hands or use sanitizer afterwards.  Very unappetizing especially from management. You would think with the coronavirus going around he would be more careful especially being the manager.", "label": 2}, {"sentence1": "I wasn't so impressed with Frozeland. It is the self serve then weighed out style of froyo, I prefer that someone else does the pouring. Plus if you are not careful about the weight it can get close to $10 for a cup, if it is big. My biggest problem with their froyo was that the consistency seemed grainy. not the smooth kind I'm used to elsewhere.", "label": 2}, {"sentence1": "Nice atmosphere but I was seated on the hardest most uncomfortable chair imaginable. I ordered a Grey Goose martini but was informed that there was no Grey Goose. It took my friend twenty minutes to get served a glass of white wine.", "label": 2}, {"sentence1": "Cold \"chips\", soggy bland fish. Sad that I made an effort to go there this eve. Obv just dialing it in and not concerned about quality of their \"flagship famous\" Fish & Chips. Blech", "label": 2}, {"sentence1": "This place has become very very inconsistent. I don't know if it's a change in cook, but every other time I order here now the food is very awful. The rice is mushy, and a few times I've just thrown the whole order in the trash. This really use to be a favorite of mine, however as I sit here right now struggling to finish food from earlier today.. I think I'm done with this place.", "label": 2}, {"sentence1": "Friendly staff, but the food was over cooked & overly saucy, one over powering flavor.", "label": 2}, {"sentence1": "Nice little place in downtown Buda!  Great downtown Austin alternative without the crazy waits! Great chilled atmosphere and good food and great bar! \nOur waiter Elliott was great, very nice and attentive. Explained menu well and recommended his favorite dishes.\nWell definitely be back soon. All food was great, only thing that could use a little improvement was Blackened snapper was a little over cooked. Please tell chef to watch that. My wife ordered the blackened catfish and that was perfect! \n\nCE", "label": 4}, {"sentence1": "First time here and got the full experience interior and exterior.  Car looks great on exterior and passenger areas.  Rear storage of the GMC Terrain could have been vacuumed out better but as I had my barn gear in that area it could have been too much of a challenge.  Over all I am satisfied and will go back", "label": 4}, {"sentence1": "We had a great time. Friendly service and not too crowded. We went in July around 5:00PM, though, so it was miserably hot. That's probably why it wasn't crowded... Fun nonetheless. Not stroller or wheelchair friendly--a lot of stairs. Go after 7:00 to beat the heat!", "label": 4}, {"sentence1": "Great tasting steak and really wonderful service. Eclectic atmosphere and really personable service. \n\nThe Churrasco was fabulous. And the Parrillada Para Uno was melt-in-your mouth tasty. Great place for meat. \n\nDefinitely stop in. Delicious food.", "label": 4}, {"sentence1": "I enjoyed the buffet here. It's a buffet so the service is minimal, but that is somewhat expected. They have all the common Indian buffet dishes. It wasn't phenomenal but it fulfilled my taste buds for Indian food for the price. I would go here again for some Indian buffet.", "label": 4}, {"sentence1": "Service was awesome and extremely personable. I tried my first lobster roll and it did not let down. The tempura green beans are always a good choice.", "label": 4}, {"sentence1": "Whoever said there were 9 dollar plates must have been on crack, there's no entree on the menu below $12.  That being said, if you're looking for some FANTASTIC Indian food and don't mind spending a couple of dollar signs, you should stop on by, or at least order from them as they do delivery too!", "label": 4}, {"sentence1": "With a row of fire on their window sill, the entrance is very eye catching and sitting by the fire with the windows open was a bonus on a sunny evening. \n\nService was quick, attentive, informative and friendly.  \n\nDaily Specials are great!  $4 Coronas on Sunday!  ... and chips and really good fresh salsa for only $5... \n\nAlthough I did not try, their tequila menu is very thorough and inclusive of many varieties and \"flight\" options.\n\nHigh quality food.  Very reasonably priced.  Great service and good atmosphere.\n\nWish I had tried sooner... will be back again soon!", "label": 4}, {"sentence1": "Not sure what the ravings are about but not worth the trip. Flour bakery has better sticky buns and the service is lot more nicer!", "label": 1}, {"sentence1": "Over price drinks and very rude staff. Plenty of other bars in Boston to visit that are far superior. I recommend passing this place and visiting any other bar in the area.", "label": 1}, {"sentence1": "Very cute store with a nice selection of candy offerings. This review score reflects the fact that there was one employee on site that didn't acknowledge us at all and stayed sitting in a corner on their phone. It is disappointing to not receive any customer service or greeting at the least. Super off putting.", "label": 1}, {"sentence1": "We had four dishes on Wednesday. One dish was good, one was acceptable, and two of them were so salty they were inedible.\n\nThe underlying ingredients were ok, but the kitchen was pouring salt on the food after it was plated. It was disgusting.\n\nThis used to be one of our favorite Indian restaurants in Boston. After this, I can't imagine going back.", "label": 1}, {"sentence1": "Nasty coffee. Wasted $5 for an Americano misto that tasted like hot water. \n\nNot going back here. I'd rather walk a few more blocks to the Caffe Artigiano that makes 100% better Americanos for half the price!!", "label": 1}, {"sentence1": "Food is not clean, terrible and overpriced. I would strongly request someone to inspect their food quality and hygieism! The crawfish is totally black, can not eat at all...\nAuful place!", "label": 1}, {"sentence1": "this isnt a \"I love or I hate\" costco review...it is an ISSUE with their Pharmacy.  Twice when presented a prescription with a manufacturers coupon for \"no more than $25\" they have refused to take it saying 'read the fine print and how it didnt apply'.  Funny I moved my prescription to my neighborhood pharmacy and they downloaded the coupon without even being told about it and charged me $25.  So I'm out of pocket $50 for the privilege of paying an annual membership and standing in their lines?  Im done here", "label": 1}, {"sentence1": "Drove 15 miles to dine here. It appeared as open on Yelp until 10:30. Got there at around 6 pm. A person sitting in front told us that restaurant is closed because they have a catering assignment. Really!!! Is this how you do business that you will close the shack at a whim. Definitely they don't have the will and desire to run a competitive business. Never even attempting to go back to this joint.", "label": 1}, {"sentence1": "I love this salon. Everyone is friendly and hospitable, the rosé in the summer doesn't hurt either.\n\nTaylor is wonderful. She consistently does a great job, I always leave loving my hair.", "label": 5}, {"sentence1": "East Andrews is a great place to go with friends to have a good time. Atmosphere and music are awesome. Marcus, along with the other great bartenders, makes spectacular drinks and crowd is fun and entertaining! Definitely recommend.", "label": 5}, {"sentence1": "I'm giving this a glowing review purely because of the incredibly nice and sincere people who work here, who deserve better than to work at a lousy underpaying fast food job. You can stand to pay your workers higher, Taco Bell corporate.", "label": 5}, {"sentence1": "The reviews are right...this place serves the best pasta I've had in Boulder (and anywhere else, for that matter). I come from a big Italian family and their food rivals even what my Grandma makes...now that's saying a lot! The service has always been very friendly, and although the ambiance leaves something to be desired, the service is always fast and efficient and the food more than makes up for it. We've also ordered off of their party menu and everything was wonderful and went smoothly. \n\nIl Pastio for the win!", "label": 5}, {"sentence1": "Love it here because of the bread would be really funny if you added dolphin meat as a meal here just because of the name LMAO. Love to bring the grandson here to eat he enjoys crabs", "label": 5}, {"sentence1": "Holy cow! SOOOO good! Our daughter had the eggs Benedict with the cheesy hashbrowns (YUMMM!) and my husband and I shared the prime rib dip and the tuna bake. Both were really good, especially the au jus and the creamy horseradish! We also had the regular mule and their special marionberry mule. Seriously some of the best food we've had since we've been here for the long weekend in the NW! Would definitely recommend to anyone traveling to Portland", "label": 5}, {"sentence1": "Phyllis did a wonderful job; great service and she's just an overall great person! Definitely recommend her.", "label": 5}, {"sentence1": "We went to Outback the other day for lunch. I didn't feel like anything too heavy so I ordered the unlimited soup and salad for $6.99. I upgraded to a wedge salad for a buck which was excellent. I tried both the chicken tortilla and potato soups which were both very good. My dad raved about the french onion soup. \nThe wait service was also very good. Overall, a very enjoyable lunch experience. We will definitely visit again.", "label": 5}, {"sentence1": "Was stuffed into a little room to listen to an Economist explain why Vancouver Real Estate rocks, They had the usual buffet... eggs (until they ran out) Bacon, hash brown pellets I think they have bigger and better rooms than the one we got ... it was long and skinny just not good for a speaker and buffet", "label": 3}, {"sentence1": "So conflicted - first place I ever had queso so when we were back in the area, I asked to come here for breakfast. If it is wrong to have queso for breakfast, I don't want to be right. I think if that is your mission - queso - you are aces here. The wait and the other items, meh. I think this place is an institution and needs to be experienced (did I mention the queso).", "label": 3}, {"sentence1": "Well I guess the low stars are based on service. I've eaten here several times and the food is passably good. The service each time has been slow and not very helpful. Note that it is 2019 and almost every restaurant should be sensitive to food allergies so being told there are no substitutions without paying full price for the item (according to the menu the same price as the substituted item)is not helpful.", "label": 3}, {"sentence1": "Not my favorite place in the North End, but it's a decent place.  Probably a better place for drinks than dinner.  You walk in and you see all these pictures of famous people who have been there...felt more like a tourist trap.  I had the lobster ravioli and it was just OK.  Nothing wow'd me about Strega.", "label": 3}, {"sentence1": "Let me repeat myself:  \"33 Washington St in Quincy is a convenience store.  All of the reviews you'll find below are for the Quincy Market in downtown Boston. \"\n\nI love coming by this convenience store and wondering if any tourists ever drive down to Quincy Center and then wonder what all the fuss is about.", "label": 3}, {"sentence1": "As a HUGE Disney World fan, I think this ride gets too much hype. Yes it's fun but it is so so short. After waiting two hours in line you'd hope to enjoy a ride for more than a minute and a half.", "label": 3}, {"sentence1": "Like so many before me have said, the layout of the Beer Garden makes no sense. There isn't much room and it's not very easy to have a conversation unless you are lucky enough to get a table. The Beer Garden is also a breeding ground for skeezy guys. On the plus side, the food is usually really good and on a nice night they open up the front so you're basically eating outside.", "label": 3}, {"sentence1": "Gave this place another chance and the beers were pretty spot on. The service and friendliness of the bartender was awful. Nothing magical at all. Had a hickory bacon burger that was okay. You get chips out of a lays bag. I'd just have a beer here and eat elsewhere!", "label": 3}]