[{"sentence1": "This is a very short 9 hole course located in Cambridge.  The greens are like a carpet, extremely slow.  Because of the proximity to the city it is usually very crowded and can take forever to get around.  If you are any kind of golfer, it is worth the drive out of the city to a better course.  Try Mt. Hood in Melrose for something close.", "label": 2}, {"sentence1": "If you have to go to the hospital only come here during the weekdays never on a weekend this place has got to be the worst hospital ever on the weekends. The way my wife has been treated is like something you would only see on a movie it is literally night and day difference between the weekends and the weekdays... her next visit will be to Emory", "label": 2}, {"sentence1": "After not having panda for several years. Went here for lunch. Not only was the food not great but it was very expensive for a small amount. After debating with the server  if whether or not I have to get rice or noodles he charges me a extra 1.80 for 3 pieces of shrimp and chicken with veggies only total bill coming to 9.50....not worth the money.  I even had to beg for a bowl instead of a tiny Chinese box. All set don't think I will be returning", "label": 2}, {"sentence1": "Me and my boyfriend went here and did not enjoy the food. It was edible but this place could really step it up. the service was that of what you would expect of a chinese restaurant. I would not recommend this to anyone, because of the food. I remember adding soy sauce and it tasted a lot better. I guess the food was really bland and just, not special.", "label": 2}, {"sentence1": "Not worth it for someone who has many better restaurants in Beverly to choose from.  I would go if it was the only alternative to fast food.  Nothing was spectacular here...just meh.  I didn't even like the clientele....losers.  Sorry goathill...you could have potential, but there's nothing about you that really makes you different or better than just meh.", "label": 2}, {"sentence1": "We got a few different types of sushi, dumplings, crab rangoons and the general gao's chicken. None of it was standout. The shrimp tempura roll tasted fishy. The dumplings were a B-, and the general gao's was just OK. The only redeeming factor was that delivery was very fast. I'm not sure why they have 4* rating...", "label": 2}, {"sentence1": "The Rice Barn used to be amazing - great service and great food.  Now something has definitely changed and the service is terrible - there are never enough people there.  The take out service is a long wait and the food is DEFINITELY gone way down hill!!!!  They don't even seem to care enough to have a website with menus and info.  \nIt's really too bad - it used to be so good there.", "label": 2}, {"sentence1": "Of the times I have tried to use these guys, they have been closed during normal business hours due to employee issues. This makes me worry that my packages won't ship and arrive on time. I run an online business which means prompt shipping is a must. \n\nRather try the CU Book store 10 feet to the right. They are quite unfriendly but reliable nonetheless.", "label": 2}, {"sentence1": "I made reservations for 15 the night of the Rose parade. They had the tables all ready for us upstairs. The pizza, beer and salads were excellent. The vegetarian margarita pizza was fantastic. \n\nI would have given them five stars if they'd served pitchers of beer and brought my cocktail promptly.", "label": 4}, {"sentence1": "Disappointed one of the employees came in beyond drunk then proceeded to pass out in bathroom. I need to pee. Disregarding the actions of an immature employee, awesome place!  Will be back in a day or so to try a new combination!!!  I had the tomato broth with chicken and extra mushrooms...fell totally in love with their food!  The guy working behind the counter was also exceptionally nice and ran the whole front of the house, including serving by him self and STILL managed to be quick.", "label": 4}, {"sentence1": "Simple menu with solids burgers, apps and beers. Everything is so reasonably priced yet tasty. We tried the spicy fried pickles, grilled chicken burger and renegade burger. All very good and each burger was $6! How can you beat that?", "label": 4}, {"sentence1": "We ordered two samosas, Lamb Rogan Josh and naan bread. It was hot, fast and fresh. The spice level was ordered medium and still gave a little kick. Very yummy. I didn't care for the mango lassi, too sweet for me.\n\nThere is a screen showing Bollywood music videos which is mildly entertaining since I don't know the language. \n\n We'll definitely come back again.", "label": 4}, {"sentence1": "I believed the hype. And it all came true. As you can see I am the one thousand eight hundredth person to write nice things about Uchi, but damn girl... hirame with a hint of shiso and crunchy, fried quinoa sprinkles? Heaven. Also, sea bass crudo - citrus garlic party in my mouth. Lastly, they definitely did not fail at dessert. Panna cotta that looks like a poached egg? Mango for runny yolk? Coffee macadamia nut crunchies with white chocolate sorbet? Youz fine too.\n\nOnly thing I didn't love: hamachi nabe. But everyone else did.", "label": 4}, {"sentence1": "I got the lamb wrap and two kinds of potatoes. The potatoes were amazing, but the wrap was just okay. I'm not much of a wrap person though, so that was my fault. The fried potatoes with yogurt are so so so good, as are the small potatoes that are kind of tart. Everything looked super fresh, and I really enjoyed my meal here.", "label": 4}, {"sentence1": "Had my 1st massage here yesterday, the girl at the front desk was extremely helpful and patient with my questions. The min I walked in the door I felt relaxed and comfortable enjoying the aroma and energy from every employee I interacted with. The massage was great. I signed up as a member and can't wait for next appt for a facial. I Ike that you can go back n forth with a massage or a facial as a member.", "label": 4}, {"sentence1": "Their seasons fries are delicious, though they can sometimes overdo it. Their burgers are alright, having had In-N-Out, it just doesn't have the fresh flavors I'm used to. But beyond that, the burgers are decent and there are plenty of options for you to customize them with. And for chili cheese dog lovers, this is still a good place if you're not in the mood for a burger.", "label": 4}, {"sentence1": "They treat business customers like crap, so we finally closed all our accounts and moved over to Wells Fargo. So much better , and they actually work with me on issues like accepting credit cards and how to protect yourself.", "label": 1}, {"sentence1": "Marginal quality.  I would be better off washing my car myself and paying myself the $24 plus tip.  I would end up with a better job done.  The old Carriage House car wash had superior quality for the same amount of money.  I doubt I'll ever go back again", "label": 1}, {"sentence1": "Wow! Almost $5 for gas. What a rip off....definitely takes advantage of customers in a weak economy. DO NOT USE!", "label": 1}, {"sentence1": "35 days passed, still not able to issue my title, with 20+ calls. Be aware... Left many voicemail, no call back. They are saying I am being taken care of, and nothing happens.", "label": 1}, {"sentence1": "How can a restaurant accept a reservation for 6 people, then turn you away when you arrive 10 minutes early with the lame excuse the person taking the reservation made a mistake and made it for 4 people! We were told we would have to wait for a table of 5 to finish before we could be seated. Inexcusable! Not the first time that the front desk has been less than inviting.  And this was at 4:50 in the afternoon!\n  Needles to say, we left,", "label": 1}, {"sentence1": "Terrible food, took almost 2 hours for the delivery guy to get 10 min down the street. We ordered the 2 large pizza special and they gave us 2 small pizzas that are about 8\" wide. We ordered food for 3 people, and barely fed 2 of us. The pizza has a sweet sauce (disgusting imo) the pizza is greek so it is oily as anything. And the buffalo chicken pizza is horrendous. I will never be ordering from here again. I have had better pizza from a chuck e cheese dumpster.", "label": 1}, {"sentence1": "Learn what the fuck WellDone means!!! I don't come here for barely cooked chicken that tastes disgusting.", "label": 1}, {"sentence1": "Walls are super thin. You can hear all the dogs barking day/night. You can hear your upstairs neighbors water running if you're on the bottom floor. Floors are warped. Cockroaches. Would not recommend this place if you like peace", "label": 1}, {"sentence1": "Honest and professional. The work they did is beautiful and my car has never looked this good. Happy to do business again and promote their work!", "label": 5}, {"sentence1": "Must be one of the best/better sushi experiences I've had. Sushi is immediately available to eat if you find something as it passes by. You can wait and order something too. The quality was great and it was cheaply priced. It's a fun place if you like a variety. Highly recommend this place.", "label": 5}, {"sentence1": "So, it's a laundromat. Not much to say other than, it's clean, there's adequate seating, very hot dryers and various sized washers. \n\nIf you're in the NW and need a place to wash the threads- this is the spot. Plus, you've got Dragonfly Coffee two blocks away to help get you through the chores. \n\nOh and the machines are named? You can't help but smile at that :)", "label": 5}, {"sentence1": "I've been searching for a nail salon for five years. The workers are excellent in every way...courteous and skilled. It's the first time my nails didn't turn out looking like Chiclets glued to them.", "label": 5}, {"sentence1": "The food is amazing!!!! To die for service was spectacular a nice family place that is warm and inviting i would go back in a heartbeat.", "label": 5}, {"sentence1": "got an iced latte today on my way to work, and the employees were so nice and funny, and the coffee was DELICIOUS!! so impressed by how many alternative milk options and flavors they have! keep up the good work! and thanks for making my morning so bright!!", "label": 5}, {"sentence1": "This is a welcome addition to the Zipper, I may or may not be drinking in Paydirt on any given day and now Sari is my go to food spot here. Everything I've had so far is great, especially the bibimbap. The fried chicken is perfect, and the dumplings are sumptuous. Even the kimchi (so many places in town seem to have kimchi everything now) has a perfect spice/tang flavor combo. The service is also great, everybody including the owners are super friendly and accommodating.", "label": 5}, {"sentence1": "I was very happy with the overall service, the office staff and professionalism of the technician. The coil in my HVAC needed replacement.  An upgraded coil was installed and the AC has been working well since.", "label": 5}, {"sentence1": "Food was ok, service is fast and attentive, ambience is cool, overall its decent for Ramen bar, i like their salmon tartare, and spicy miso ramen!", "label": 3}, {"sentence1": "This place is ok nothing great about it. Ive had their extra cheese pizza and the cheese was a bit too rubbery for my liking. \nTheir burgers are smaller than I feel a sub shops burgers should be.\nI'll give it a C", "label": 3}, {"sentence1": "Authentic Polish Austrian Hungarian selection.  The food was ok but not great. Worth a visit.", "label": 3}, {"sentence1": "Tried out the Cafe at Vandusen just last weekend. The spot is awesome, overlooking the gardens. I tried the afternoon tea. Really great that you get a whole panini with it, but although the website says you get a choice of tea, I was told it came only with the VanDusen private label one. It would have been much better if the croissant and scone was warm as it isn't as enjoyable eating it cold and didn't taste freshly made.", "label": 3}, {"sentence1": "I like that this place is 24 hours on the weekend. Other than that, food was mediocre. Overpriced American food is what I got from it. Service was good.parking sucks cuz u have to valet. Chicken wings were mediocre ...nothing special.", "label": 3}, {"sentence1": "3.5 *.  Was told this was better than hmart...not sure what definition of better you are using.  Cheaper..yes.  Food court..yes/no.  Less fancy.  Yes. Cheaper.  Yes.  Location...better.  More central.  Selection ...not better.  Produce...not better.\n\nWould I return?  Prob but not if hmart was equidistant.", "label": 3}, {"sentence1": "They got the job done. But they did not honor my time and I ended up waiting about an hour longer than I was told. Then my seats after being shampooed were not covered. It's just sort of a mess. But after all its a car wash...", "label": 3}, {"sentence1": "The food to me seems just average. The portion sizes are good but the food is just mediocre. There certainly are a lot better Chinese restaurants in Clark County. They do have a bar which is a plus and they make a pretty stiff drink.", "label": 3}]