[{"sentence1": "The service was very slow. I went in for lunch and came out for dinner. Our waitress(Sandra) needs a raise. She is working very hard. No this is not anyone who knows her or forced just my opinion. Our drinks were a little watered down but I didn't really mind it. The orange soda machine was broke. Also I didn't get my apple slices with my cheesywich . Also sub to h3h3 * Dabs on h8rs*        #PapaBless", "label": 2}, {"sentence1": "Got in, server didn't ask for drinks started with apps .. apps hit the table before she even got our drink order... then some of the drinks didn't hit the table until some of our meals were finished. Server seemed like she was brand new. Maybe some more training on the management side of it will help. Good is good I had the Toston Montañero really really good. My wife had the bandeja paisa. The most typical Colombian dish but not the best here.", "label": 2}, {"sentence1": "Great drinks, great dessert but in between not so much...marrow over crusted with something covering that lost the flavor of the marrow, frog legs that were greasy, how do you get greasy frog legs?  Too much salt over all. As someone who has lived in France, this is NOT a French experience...perhaps a Texas, French experience but not a true French experience.", "label": 2}, {"sentence1": "Set aside 25-35 minutes to get a car wash if you go here. Never seems to have enough people working to keep the line moving. Got in line on 7/5/18 at 3:30pm. It is now 3:53 and literally leaving the blow dry portion of the carwash...", "label": 2}, {"sentence1": "No matter how hard you try, can't get your wow here. Shop these joints east to west coast, give me H&M.", "label": 2}, {"sentence1": "Good drinks. Bland food, especially the beef tacos. I'm over this place. The cool name can only help so much.", "label": 2}, {"sentence1": "Absolutely loved it the first time! But that was almost a year ago. Sat down, not that busy and 2 people working, it was 10 minutes before someone came to my table. I've been busier than thus at work by myself!!! I would most likely get into a lot of trouble from my boss if I made a table wait that long with no acknowledgement!", "label": 2}, {"sentence1": "I reckon if you're not from Texas, this is probably good BBQ to you.   But it's more of a production BBQ joint.   Overpriced and just so so...  the real BBQ is at Blacks", "label": 2}, {"sentence1": "Lots of good stuff that has a very good turnover. We've bought several things here over the last couple years and have always been happy.", "label": 4}, {"sentence1": "Anytime the owner of a restaurant reaches out to make things better, that's a plus in my book.  (Even if I don't respond)\n\nOverall, this seems like a fine company and I hope they do well.", "label": 4}, {"sentence1": "I sprung for the caffeinated mocha chip in a cup, one of the monthly specials (hard scooped ice cream). My aunts brownie batter was loaded with chunks of chocolate, and my cousins cookie dough was equally as enjoyable. Flavors change by season and month.\n\nAlso offering milkshakes, drinks, smoothies, and a small selection of pastries and bakery items I would love to come back and support this small chain! A little pricey, but worth the quality. A small was almost too much for me, they don't skimp on packing the cup!", "label": 4}, {"sentence1": "I've been here three times now.  Agree with Ajay that drinks are pricey, $13 for an Old Forrest (a good reason to hit happy hour and be thankful that I'm not a huge drinker).  It's definitely loud with increasing volume as the evening progresses. That being said, +1 star for atmosphere and easy access to S Boulder/parking.", "label": 4}, {"sentence1": "Love their punches, they're big for $8!! Free popcorn during happy hour, it was really salty though. Pimento cheese and saltine crackers were pretty good. Fun to spend an afternoon there, love the decor and vibe.", "label": 4}, {"sentence1": "Target is much nicer cleaner inside than their opponents. The prices are a bit higher but the help is available. Plus Sub-Way inside.", "label": 4}, {"sentence1": "Great hotel right by the airport with convenient and quick shuttle service. Unique circular floor plan and decent amenities such as a large atrium, small gym, small walking path in the rear, and outdoor pool and hot tub. There Small comfortable bar/cafe that is in the center of the atrium, and many comfortable chairs and couches where you can meet, relax and socialize.", "label": 4}, {"sentence1": "Pearl has really turned out nice. I've lived here a month and prior to that only visited a handful of times. There are decent options that eat that will not break your wallet and if it weren't for all of the \"Summer Travelers\" aka Drunk/Stoner Beggars all over I'd say this is a 4.5 and a fantastic part of PDX.", "label": 4}, {"sentence1": "Requiring customers to wear a face mask outdoors is a nonstarter for me, especially when its 80 degrees outside. Really too bad since the system that was in place during the shortened hours seemed to work just fine. Lets hope they invent a vaccine soon for covid-19 paranoia.", "label": 1}, {"sentence1": "Absolutely the worst customer service here,any other VS I've been in had much better service!! Where's the management in this place!?!?", "label": 1}, {"sentence1": "1 star credited to Bhavesh, the owner. I have a mail box agreement with them and the owner is so greedy that he keeps increasing fees like consolidation fee, taping fee, forwarding fee that are not agreed in previous contract. Will not use his mail box service anymore. Be careful what is in the contract and extra fees will be included in your future bill. Do not recommend this store!", "label": 1}, {"sentence1": "This is the WORST Steak 'n Shake in the city. They all SUCK. I'm tired of going here, sitting in the drive thru for no lie 35-50 minutes, THE ORDER IS WRONG AND THE FOOD IS COLD. All the employees do is goof off inside. It's highly annoying because Steak 'n Shake isn't the cheapest place. I need my money back or a lifetime discount. I will be back in the morning to get a refund if not I'm calling corporate. DO NOT GO TO THIS ONE", "label": 1}, {"sentence1": "I'm getting ass raped in here. The lady is nice but overall sprint just sucks. I feel sad today. My loyalty of 17 years I think is useless. What did I do to deserve this. My Christmas cheer has been stolen. It would behove them to turn off this cheery music before I throw a tablet through the plate glass window.", "label": 1}, {"sentence1": "I came here with a friend for happy hour few weeks ago. When we walked in no one greeted you. Finally we just sat down at a table. It took over 10 minutes before the waitress came over to take our order. The beer we ordered was not cold. The taco was not good at all. I don't think I will be visiting this place again.", "label": 1}, {"sentence1": "HORRIBLE! The one in buckhead is 100x better! Burger doesnt even taste like a burger. The meat is not cooked properly. Employees have an attitude. I would have given it a negative rating but yelp requires at least 1 star. Positive thing: looks clean and not as crowded. But the quality of the food lacks INCREDIBLY LOW. I had to return my burger and ask for a refund.", "label": 1}, {"sentence1": "I ordered food to go, T-Bone steak was burned the food was so burned . I can't believe !!!", "label": 1}, {"sentence1": "I have been seeing Lindsey Little for nearly 15 years for my hair color & cuts. She is such a perfectionist and a true professional. My hair always looks and feels amazing, she really honors her craft and never disappoints!", "label": 5}, {"sentence1": "The Kung Pao  Chicken is one of the best dish I have eaten. It is very yummy.  This is must eat restaurant when I am in Portland.  The egg plant with garlic is also yummy.", "label": 5}, {"sentence1": "The new  management has been great! The food is delicious!!  beef teriyaki, chicken teriyaki, crab Rangoon's, lobster sauce!!! AMAZING!! will dedicatedly come again!", "label": 5}, {"sentence1": "I got lucky with seating as I went there for breakfast on a Saturday at 10 by myself and got a place instantly. The place is loud but nothing too extreme, I really liked the vibe and the food was just perfect!", "label": 5}, {"sentence1": "I eat here too much :).  The lunch buffet keeps me coming back.  They rotate a few dishes, which is nice.", "label": 5}, {"sentence1": "Village Health Wellness Spa never disappoints. I have gotten an appointment several times at the last minute and they have been able to accommodate. I always leave feeling brand new! \n\nThe prices are very reasonable. The customer service is outstanding. The quality of the massage is superb. Highly recommend! I don't think you can get what you get at Village Health for their prices anywhere else. Give them a try, you will not be disappointed!", "label": 5}, {"sentence1": "They are completely amazing. We had a startling and scary episode (swarm) of yellowjackets that I couldn't imagine a solution for. Waltham Pest came and fixed it in 45 minutes, for half the price that I was expecting. I recommend them!", "label": 5}, {"sentence1": "I have never had bad takeout from here. We have been ordering for 4 years. Our fav is chicken in black pepper sauce.", "label": 5}, {"sentence1": "The ambience is great but the food quality (weekend brunch) only so-so. Still, worth considering if you're looking for a reasonably priced sit-down brunch place in Beacon Hill.", "label": 3}, {"sentence1": "CLOSED.  A paper signed taped up said it was closed, no chairs or tables visible inside.  This was Tuesday night at 630 PM.  Not sure if it's permanent, but it sure looks like it.", "label": 3}, {"sentence1": "The service was slow for the amount of people present. It's kind of pricy for the selection of food. But the food is still pretty good. And they have a decent alcohol selection.  Final verdict: try it out even if you wait 30 mins for food for two.", "label": 3}, {"sentence1": "The nails are hit or miss.. I have had really amazing mani/pedis and I have walked out with bubbles and rushed mani/pedis.  They can get busy and rush and be really rude.  \n\nI would give 5 stars for the eyebrow waxing- the girl who does the waxing is INCREDIBLE!  Skip the nails.. get your eyebrows done and go down the st to Paradise for your nails! (o;", "label": 3}, {"sentence1": "Very well laid out store, full bakery and lots of gluten free and organic products. Line ups are long. Til doesn't seem to be organized at times. So why the 3 stars.....prices. Prices aren't competitive as they should be and often are higher than some of the Superstores and Extra foods even though it is all under the Loblaws branch. Decent hours of operation.", "label": 3}, {"sentence1": "The service is acceptable. Don't be in a hurry.\nThe bartenders are usually very good. The mixed drinks are not inexpensive but very good.\nI have never  had anything worth eating...the food is never very good and I have tried hard to like it.\nI simply can not give this place any better than 3 stars...and that is generous...", "label": 3}, {"sentence1": "Why why why would you serve such wonderful food in such a chaotic, impersonal and deafeningly loud atmosphere?! Maybe on a slow night this place is magic but on a night with a full house and loud people, it was so unpleasant. \nWe have eaten all over the world and consider ourselves foodies but the food was so overshadowed by the noise and catering-like delivery of it, that we just couldn't enjoy the (almost $400) dinner. We felt relieved to leave. So sad.", "label": 3}, {"sentence1": "Nothing too great, nothing too bad about this place.  Liked the patio out back.  We only had the crawfish, so next time we will try some of their poboys.  \n\nService was good, they were very busy but still managed to be very attentive.", "label": 3}]