[{"sentence1": "Ordered the Beef Lo Mein and Shrimp Lo Mein. Beef Lo Mein had a decent amount of meat and was flavored ok, but could have used some pepping up. Shrimp Lo Mein was the same, but shrimp were incredibly tiny, probably won't order the shrimp again.\n\nInside of the restaurant is very basic and plain and needs a total redo, but food was okay.", "label": 2}, {"sentence1": "We have been waiting here forever to get our food! I ordered the chicken/pasta and my husband ordered the chicken fajitas. \n\nThe chicken/pasta wasn't good at all the pasta was soggy! Gross! But the fajitas were good. I have had better food from them! And service too.", "label": 2}, {"sentence1": "Nice room and the band was great! However the place seems quite popular as the crowd was overwhelming the staff/management! Didn't stay too long as there were no seats available at 9pm on a Friday night... Make reservations but still be prepared to wait!", "label": 2}, {"sentence1": "Not sure why this place exists. Brisket was bland and boring. Sausage was decent (using this word generously). When in Austin, TX you expect better.", "label": 2}, {"sentence1": "really sad about having to stop coming to this dutch: The quality of the expresso has declined. Often my drink tasted burnt. The charge for water is also a major turn off.", "label": 2}, {"sentence1": "The last stop on my Boulder business trip food tour.  I got the roast beef, with cheddar cheese, and it was... meh.  The bread was tasty, but the cheese wasn't sharp enough for my liking, and the roast beef was stringy and not well-seasoned.  On the bright side, I didn't get a rude sandwich maker or think the place was some dank hole in the wall.", "label": 2}, {"sentence1": "Came here for dinner, ordered appies and entrees. They forgot our entrees, no apologies, no restitution. I've been here before and loved the food, service and atmosphere, so was extremely disappointed. Will not be back.", "label": 2}, {"sentence1": "These people never cease to amaze me - it's so busy and they are just shooting the shit and taking their time. God forbid you alter the order, they completely break down. I wish these reviews meant something but this place has the business so they can get away with incompetence. What a joke!", "label": 2}, {"sentence1": "Salsa was dull, flavors were bland.  Margaritas weren't even that impressive. Disappointing as the location is great. Service was good.  Maybe 7 other tables on a Friday night.", "label": 2}, {"sentence1": "Worst service at any chilis I've been to, my party and I got up and left before we even ordered and never returned. And I love chilis.", "label": 2}, {"sentence1": "Soggy fries. Waitress repetitively forgot things: a knife, a beer for about 45 minutes. Had to remind her about both. The pasta dish I had was seriously lacking in flavor. The grits were interesting; try 'em. The drinks were good, and our bartender was very personable.", "label": 2}, {"sentence1": "Went after Franklin's and La Barbeque were sold out. They only had pulled pork and brisket left. The pulled pork was succulent but flavorless and considering their sauce isn't good it's hard to eat. The brisket is alright. Not juicy. Not that fatty. \n\nAs for the sides, potato salad and the grits are very good, the beans and coleslaw are bad. They were outta bread but we got the bun which is also very good.\n\nDesserts the pecan pie is tasty and the moon pie is good but a little one bite.", "label": 2}, {"sentence1": "Meh. I ordered the  scrambled egg with swiss tomato and artichoke on the Parm and Herb bagel. The bagel was probably the best part. The egg was so weird tasting, very pale in color, still kinda \"wet\" and just plain bland. My boyfriend had the Jalapeno Cheddar bagel with the scrambled egg bacon cheddar. We both agreed we've had better. I think it's the lack of seasoning and the weird egg that put us off", "label": 2}, {"sentence1": "Probably the worst Panera I've ever been to. The employees seem demoralized, apathetic and generally confused. The seating and decor is standard Panera, only everything looks worse for wear.", "label": 2}, {"sentence1": "Dirty, small shop. Rude, nasty experience. I won't be going back.", "label": 2}, {"sentence1": "First room the sink didn't drain and was dirty.  Second room was just ok but not worth the money.", "label": 2}, {"sentence1": "Jambalaya was good red base sauce, not do not ge the Po-Boy its more like a Sub than a PoBoy, they still have a good spice base on their food so I'm still a fan.", "label": 4}, {"sentence1": "Very good Thai food, reasonable prices. \n\nLunch combos are great. You get a soup, egg roll and your entree. \n\nSpring rolls were ok but they skimp on the shrimp. For a single spring roll, there was one small shrimp. \n\nIts on campus, so dont expect a great ambiance and I expect it would be busy during lunch / dinner time. \n\nthere is a private parking lot.\n\nportions are a bit on the smaller side.", "label": 4}, {"sentence1": "Quaint and authentic. More Nuremberg style food and atmosphere. Food was above average. Beer is served authenticity, more room temp than very cold. Lentils soup was exceptional. Even our server was from Nuremberg. Ihra Deutsch ware gut", "label": 4}, {"sentence1": "Good dinner!  We tried both kinds of balls and a couple sandwiches.  Best part was bs'ing", "label": 4}, {"sentence1": "Healthy and tasty meals conveniently portioned out for the Iceman because Ice doesn't cook.\n\nSo dangerous. Highly recommended.", "label": 4}, {"sentence1": "On our visit we ordered the 3 wings, 3 fish, and a waffle with a side of waffle fries. The atmosphere was very relaxed, good music , friendly staff, great prices. The chicken and fish were seasoned great. Fried but not greasy. The waffles was cooked well soft and fluffy. The food overall was amazing. My only issue was there was a bit of a wait from the time we ordered to the time our food came out, but it was fresh and delicious.  In my opinion, well worth the wait. Can't wait to come back.", "label": 4}, {"sentence1": "Came here with my Wife by her self discovery. I must say, its a more upscale version of other poke places I've been. The ingredients were fresh, the place had good amount of seating. I liked how there is more choices and found the available sauces nice! Overall, I recommend it and would come back!", "label": 4}, {"sentence1": "Great food and great service!  I would have given 5*...except it took almost an hour and a half to receive our entrees. That snag aside, the (rotating) cheese board was a surprise highlight; we contemplated ordering a second one because it was so good. We'll definitely be going back, as the food was stellar, staff was attentive, and ambiance perfect for a fun night out.", "label": 4}, {"sentence1": "I'm a fan!\n\nManagement is super responsive and friendly! Sometimes its hard to get in contact with them, but they always respond back to your voicemail/text. Tacos come out really fast and they have more toppings than most other trucks in Austin.\n\nI would definitely recommend the Al Pastor taco and the Fajita Beef taco! :)", "label": 4}, {"sentence1": "I enjoyed my food !!! Got full real Quik.  Lol. Great staff.   I was nervous about downtown parking.  But we got a spot right in front !!!", "label": 4}, {"sentence1": "Best martinis ever! They're also HUGE! \n\nThis place is tucked in a small shopping center and it doesn't look like much from the outside but the food is honestly worth the try. I've lived close to there for about 3 years and I wish I tried this place sooner! Their menu specials changes daily but they also have their classics that they are known for daily. \n\nI got their black and bleu salad and it was delish!!! The value was phenomenal. It was quite a large portion of steak over a hearty robust salad. Blue cheese dressing was also great.", "label": 4}, {"sentence1": "I'm visiting from out of town, I had an amazing veggie burger. Great local beers on tap. Service was wonderful. Staff went out of their way to be welcoming. Would definitely return!", "label": 4}, {"sentence1": "Environmentally friendly and health conscience food that are yummy burgers and fries. Great playground for the kiddos. Shakes are good.", "label": 4}, {"sentence1": "Definitely one of my favorite Chinese restaurants of all time. \n\nI usually write very wordy reviews, but to truly drive my point home, i will keep it short.\n\n1. House Tofu\n2. Basil Chicken\n3. Seafood Soup \n\nBLASTED with flavor, freshly prepared, completely delicious.  Kind staff... I am Chinese, and I have brought both Chinese (young people and parents) and westerners to this restaurants, and all who cometh leaveth with a mighty full stomach.", "label": 4}, {"sentence1": "Had a good time and a delicious breakfast! I ordered the blueberry pancakes and orange juice.  A little pricey but worth it.", "label": 4}, {"sentence1": "This has always been my favourite Chinese bakery. Their quality is top of the line. They have a good variety of buns. I love their cakes and I always order all my birthday cakes from them. The blackforrest and chestnut cakes are the standouts for me. If you are in Metrotown, buy your Chinese buns here and stay away from TnT.", "label": 4}, {"sentence1": "I visited here today to quickly sweep out my car. Swiped my card for a $1 vacuum sweep. Checked later in the day and I was charged $10. I have little contact info and no receipt bc it doesn't print them. Now what?", "label": 1}, {"sentence1": "If you can get ANYWHERE that is 10% more expensive than this place, do it there. This place sucks. Warranteed work means nothing. It means, they'll get to that AFTER they take care of any new sucker who is paying now. \n\nI was told they would call me when they could get to the work. Never happened. \n\nI can see this place (Pep Boys) will be out of business in the near future.\n\nYou suck.", "label": 1}, {"sentence1": "We tried this place base on the 4 star reviews, food was ok, not great, service is a 2 Star. The price on the internet is not correct, they're trying to deceive you, so expect to pay an additional 30% more, they nickel & dime on items that other Resturant don't charge.  Pho Hoa food is much better for the price.", "label": 1}, {"sentence1": "Why do I keep giving this place a chance?  I was roped into going here with some friends even tho I know the pizza is not good. So, after 3 visits I still must say the pizza is way over hyped. I'd say it has trouble making the top 10 in ATL. let alone the best in the country. Come Jeff, you talked such a good game and now you can't produce in the paint.", "label": 1}, {"sentence1": "awful. I enter early am ...store not crowded. Rude young blonde coffee guy\nHope out by coffee , I kindly ask for 6 feet. He had Light hair. Caucasian. \nMultiple unmasked customers roaming around harassing me. I'm just \nBuying coffee. Spanish male employee about 25 male starts yelling at me\nFor asking for social distance,  and why don't they enforce mask sign on\nDoor. Awful,  disease ridden dump with unprofessional employees.\nYuk. See pic . One of many unmasked,  abusive customers allowed in.", "label": 1}, {"sentence1": "Get your stuff together..  A 20 minute wait for a Pacifico draft?  Food not much better..  Stay away.  Waterfront view is not worth the wait and price.  Boo on you island cafe", "label": 1}, {"sentence1": "If you are not female stay away from this place. We were looking for a place to C&W dance and this was the only option. First we were denied entrance and told to come back later. On our return we danced one song and the owner asked us to not return to the dance floor until after 10PM. Although the website promotes inclusiveness this applies to females only.", "label": 1}, {"sentence1": "My sister and 2 of the bridesmaides came to Atlanta to go Wedding Dress shopping and we decided stop and get something to eat here. Horrible Mistake! The manager kept rubbing his nose, touching his hair and we never saw him wash his hands. The expo didn't have on any gloves and one of the servers was smoothing his hair back and never washed his hands. We could see that the kitchen staff did have gloves on, that's why I'm giving 1 star. This location needs a class on hygiene in the food industry.", "label": 1}, {"sentence1": "I made reservations on Friday morning and explained that we would be a late check in, possibly 2AM Saturday morning. They said it would be fine, someone will be at the front desk. We arrived at 3AM and was told that our card was declined (it was not) and the room was sold. They never contacted us prior and left us stranded in Orlando. After driving around to numerous hotels, most were closed, we finally found a room at the Doubletree at 4AM. I am planning to call the corporate office today. Terrible customer service!", "label": 1}, {"sentence1": "Umm, I am new to Vancouver and need to find a doctor. This walk in clinic is very close to where I have moved and so I was excited to phone and make an appointment. It is Monday morning just before 12 o'clock and their website says they open at 10am. No one answered the phone and I couldn't leave a message because their message bank is full. O boy I may not have luck here!! :(", "label": 1}, {"sentence1": "This place has the sloooooowest drivethru ever. Every single time I go even if I'm the only one in line it takes at least 5 min and it's not uncommon they get my order wrong", "label": 1}, {"sentence1": "Who baked their eclairs absolutely no taste. If they can win awards, we would own the world.\nHopefully they partake of the eclairs, which are tasteless! Someone who has tastebuds need to try them. Too bad : (", "label": 1}, {"sentence1": "This place is gross. Your wash doesn't come out clean and if prior users don't check under the rubber lining where the washer door closes, not only does all your detergent turn into a swamp and just sit there, but you may also find someone else's underwear stuck under the rubber piece as well. Disgusting.", "label": 1}, {"sentence1": "Contracted Lowe's to put up vinyl fence. Job was incomplete for over a month. They left the fence laying in my back drive way, it was an eye sore. My property was left unsecured. They left gaps in the fence. They did no call no shows. Corporate has not resolved this issue. I would never recommend there services to anyone!!!!", "label": 1}, {"sentence1": "very poor service, ive been waiting  3 weeks to change the tires, i just found out they havent even ordered yet, which is unprofessional, they said it would take 3-4 days to get the tires\nThey dont know what they are doing", "label": 1}, {"sentence1": "Edible burger with cheddar that was unlike any I had ever seen on a hamburger.  The cheese didn't melt like the other burger at the table. It looked like it was old and dried out.  I pointed it out to the waitress but she barely responded.\nThe fries were undercooked and limp.\nThe tap beer was good.", "label": 1}, {"sentence1": "Finally went to Red Lentil last evening.  Just a wonderful place.  Food was fantastic, the space very comfortable, parking is easy enough.  Can't wait to go back.  And I'm not even vegan :)", "label": 5}, {"sentence1": "Awesome place for stakes! Great atmosphere, staff, service, and food. We had our work year end dinner there; it was a large group and the service was really good. They were ready for a large group. All of our food came out together and cooked to our liking. Great experience.", "label": 5}, {"sentence1": "ESP makes a delicious gluten free crust using Smart Flour.  I like a classic pepperoni pizza, and a personal size is only $10!  Such a great price!", "label": 5}, {"sentence1": "Ok, I seriously thought I was just getting a pita  filled with stir fry. Much to my surprise, this was a burst of flavors in a delicious tasty pocket. I got the Korean beef. But they had so many varieties: pork, vegetarian, chicken. They make it hot & fresh right in front of you. I would definitely come back! Whatever sauce they put on it is AMAZING!!", "label": 5}, {"sentence1": "Dare I say B&G has the best lobster roll in the city? Yes, yes it does. Super fresh & crisp, and those fries.. My mouth is watering as we speak. Their outdoor patio is perfect in the warmer months, but inside is just as nice. I also couldn't get over the wine selection, found a great sparkling rose to go with my lobster roll.", "label": 5}, {"sentence1": "Had a key fob replaced there ... great customer service and excellent prices would highly recommended these guys ....they are not trying to rip you off like the dealers", "label": 5}, {"sentence1": "This was a terrific place! I had the lamb shawarma platter with brown rice and grilled vegetables and their nutty bread. The meat was perfectly spiced. Everything was warm and delicious. To top it off, they sent warm falafel down the waiting line of people and later delivered fresh cut watermelon for all the customers who were eating in. This was a wonderful experience. I wish they would open a place in Fort Myers, FL.", "label": 5}, {"sentence1": "Hot lobster roll is amazing!  I mean what is not to love, lobster+butter+roll=yum.  We also tried the fish tacos, and seafood stew.  Everything was delicious and worth the 45min wait.  Put your name in, get a drink at the bar down the street and they will call you when your table is ready.", "label": 5}, {"sentence1": "Simple and easy. Staff is really the reason I come here. Rob Money and Nikki are true homies in every sense of the word. Not a bar I feel out of place at all and a real sense of community at this spot. All ages/types of people come together and mix for an eclectic crowd.", "label": 5}, {"sentence1": "The triple chocolate sundae is amazing, and the Pinterest loving girl in me loves it even more because it comes in a mason jar.\n\nAnd the musicians tonight (That One Eyed Kid, Kyle Harris & Brian Staples) were fantastic. Come in on a night when they're playing, grab a dessert in a mason jar, and it'll be the best $6 you've ever spent.", "label": 5}, {"sentence1": "One of my favorites.  All the dishes are delicious and well proportioned.  The painted hills beef they use in the kabobs and attention to detail make this place stand out.  Mediterranean food at its finest.  Can be a bit loud when it's busy, but not so loud to require shout talking.  Staff is pays attention to their customers and keep you in the loop when there's a wait at the door for a table.", "label": 5}, {"sentence1": "This is one of my favorites! Meat is good quality, it's a great value, and the service is perfect. We request Brian every time we go, because he is the most fantastic server. He is attentive, sweet, professional, knowledgeable and we really enjoy him in general. Before you even have a chance to ask for anything, Brian has already seen that you need it and delivered it. That kind of seamless service is rare. Great food, great price fantastic service.. Charm hits the mark in every area and that's no easy task.", "label": 5}, {"sentence1": "This place is amazing and way under rated! We live in Lakeway and was so happy to see a great restaurant move in. The menu is terrific, the service is stellar, the drinks are awesome. The lunch menu is a great value with variety.  We have tried every Mexican restaurant in Lakeway/ Bee Cave and have been unimpressed, until Santa Catarina. We eat there once or twice a week and are never disappointed.", "label": 5}, {"sentence1": "Hands down the best chiropractor I've found!!! Dr Steve is very nice and truly cares about his patients!!! Only problem is he's always booked cause he's that good!!! Highly recommend!!!", "label": 5}, {"sentence1": "Being a \"Yankee\", I made it my mission to try great Texas BBQ. The sides are delicious, especially the mac and cheese. I made the tough choice between brisket and ribs, and I feel like I made the right choice. You have the option of leaner and less fatty or moist and more fatty. I got the leaner pieces and it was delicious. The brisket just falls apart as you are cutting and melts in your mouth. I'm disappointed that I will not get to chow down again (unless I make it back to Austin).", "label": 5}, {"sentence1": "Absolutely fantastic! I showed them a picture of what I wanted and then left it up to them and they gave me exactly what I wanted. Took time to perfect every nail as well. A little bit expensive for what I got particularly, but earned by the hard work. First pictures are what they did, last picture is what I asked for (identical!).", "label": 5}, {"sentence1": "The simple mexican food here is good...like the quesadilla etc.. The fancier food really isn't good at all..they also substitute tequila here... I ordered my favorite tequila here of which I really know the taste of, and it wasn't they...it was substituted with some other kind of cheaper tequila...very disappointing...", "label": 3}, {"sentence1": "Lobster salad: tasteless\nGreen salad: very good\nView: outstanding\nService: clueless but eager\nOnce the management wakes up and trains the employees properly, there may be some hope for the future. For now, it's one of the few waterfront locations in town, so guests will choose it despite the reviews. Yacht club members would find better meals at Shubie's Marketplace; picnic on your boat, folks!", "label": 3}, {"sentence1": "Food: 3.0/5.0\nService: 3.5/5.0\nValue: 4.0/5.0\nDecor: 2.0/5.0\nOverall: 3.5/5.0 \n\nMy first time in a Waffle House - and boy did I feel special.  Very interesting concept that I can appreciate.  Very inexpensive, not the fanciest ingredients in the world but it works and tastes just fine.  Friendly service.  Just need to be ok w/the big cholesterol volumes that are part and parcel with breakfast establishments like this (and I am).", "label": 3}, {"sentence1": "Ok, I enjoyed my chicken shawarma wrap but was shocked that hummus, tabouli, and garlic sauce cost $1 extra each. Pretty unheard of and definitely didn't win any favors from me.", "label": 3}, {"sentence1": "Pay for wifi unless you purchased through Marriott.  Parking is 24.00 and up (self).   Rooms are nice.  Bathrooms are a little small.  Water pressure is great.", "label": 3}, {"sentence1": "This place has some of the best non healthy Mexican food anywhere. If you want healthy stuff stick to Alexander's Mexican food (Sadly this has closed). If you want some amazing deep fried tofu fajitas or some other really unique Mexican dishes I can't recommend this place enough. They also have over 100 kinds of tequila, so if you want to explore it is a great place to start.", "label": 3}, {"sentence1": "Not really a fan of the actual CVS pharmacy (bad customer service in the past), but the store employees are very customer services oriented. They offer great products that save you time and the CVS rewards program saves you money.", "label": 3}, {"sentence1": "Siu mai, ha gao, chee cheong fan and chashao bao was pretty good. Porridge, lo mai fan, xiao long bao and service was not very good.", "label": 3}, {"sentence1": "Ordered take out and it was ok. Pretty pricey for average sushi. We ordered the ebi sunomono, 2x ika nigiri, 2x masago nigiri, 2x salmon nigiri, 2x Saba nigiri, a chopped scallop roll and another set and it came out to about 40$. Fish was fresh and rolls were ok. Would come back.", "label": 3}, {"sentence1": "It was OK but didn't live up to the higher expectations that I had. The ingredients all look fresh and the crust turned out fantastic. The reason for the average review is simply I didn't care for the pizza sauce. I found the marinara to have an overpowering sweetness.", "label": 3}, {"sentence1": "Bought lunch at 1250 pm. Fries should be fresh right ? Yet they were lukewarm at best and all broken little pieces.\nThe Filet fish i ordered was very dark in color. Old oil maybe??\nOverall not a great experience.", "label": 3}, {"sentence1": "I went here the other night for dinner. I had never been before and my friends told me it was awesome. I had their special, chicken fired chicken with mashed potatoes and green beans. The CFC was battered in something I had never had before, which made it awesome. Their mashed potatoes were awesome!! And I'm really picky about my MP's. I will probably go back to try something different, but I don't think I will make it one of my regular spots.", "label": 3}, {"sentence1": "Very good sushi and shrimp lo mein but the waitresses are the absolute worst!! They try to up sell you on all their specials and get pissed when you pass on them. They give you warm water, and take 15 minutes to get you a drink when there is only 5 people in the whole restaurant. I would give 5 stars on the food and 1 on service so a three is a happy medium.", "label": 3}, {"sentence1": "80% of the fun of this place is getting drunk and telling people on the phone that you've got an ass guard.", "label": 3}, {"sentence1": "Yup, its a tourist trap and overpriced...but the clam chowder is soooo delicious!", "label": 3}, {"sentence1": "New B. Good opened in Downtown Crossing today.\nI had a :\n\nADOPTED LUKE --  mushrooms, caramelized onions, swiss, homemade bbq $6.29\n\nMaybe a bit much for a semi fast food burger but it was made to order from fresh lean meat. I watched them cook it on a grill.\n\nAnd it was delicious.  They also have Sweet potato fries.  I look forward to eating more stuff there.  Check out the menu:\n\nhttp://www.bgood.com/menu.php\n\n Welcome to the neighborhood!", "label": 3}]