[{"sentence1": "I have to update my review because the last two times I've been, they have not been using their grill. I'm not sure what happened, but they now microwave eggs, which is not as tasty as when they used to grill them. Boo.", "label": 2}, {"sentence1": "Love the Chinese food from this place and have been ordering take out from here since we've moved to Natick 13 years ago. However, you'd think after 13 years of ordering maybe twice a month the owner could recognize you or not be such a bitch every time you walk in there!  \n\nGot take out order and the owner mentioned above was breaking up fish with her hands, not wearing gloves. She took my CC to process, handed it back with the fish juice form her hands and then went back to the fish! Real sanitary!!!", "label": 2}, {"sentence1": "I gave this place a try and it was nothing to write home about. The portions were skimpy with the meat and who runs out of collard greens at a BBQ restaurant? I ordered the cabbage and it was pedestrian.  For 14.00 i exoected a bit more meat. I can say at least i tried it.", "label": 2}, {"sentence1": "The sauce for the Roti could be improved (e.g. Texture and taste are far from what I expected).", "label": 2}, {"sentence1": "Well I ordered the baked haddock and it was awful!! Dry, boring...for the price I was expecting something much more delicious. I should of sent it back. Should of had the mission cheeseburger, it looked incredible. I was very disappointed. The service was ok. Nothing special.", "label": 2}, {"sentence1": "Address lists as Jervis. Business receipt lists as something else. Fast reply from phone call. Fast visit. It's my opinion that the service rep was only there to sell a new machine. Seemed to have the new machine in stock for quick delivery. Paid my money and sent them on their way. Called the manufacturer and they replaced the part, for a charge of course, and all is well.", "label": 2}, {"sentence1": "As a Korean I know Korean food's taste better than others. I hope this restaurant using more fresh ingredients. When I had dinner at this place, I noticed my octopuses beef tofu soup tasted very weird and old.\nTexture was really tough. \nEven Kimchi was tasted weird. Chiken and almost every other dishes.\nI think health inspector should visit this place. Or... Gordon Ramsay's Kichen Nightmare TV show.", "label": 2}, {"sentence1": "It's certainly conveniently located, but jeeze, what a mess.  It takes forever to get between terminals.  This may be a Southwest issue, but Terminal E is devoid of any good shopping or eating options.  Also, even the slightest weather issue will result in a delay.", "label": 2}, {"sentence1": "Probably the worst SNS manicure I've received. I had to have it done twice because the first color looked nothing like it was supposed to. The shape is of my nails is awful. The nail tech was only going to do one layer of glitter and I had to ask him to do 2 layers because it wasn't even everywhere. They use 2 layers of clear powder (to save on color I guess?). And then they did my \"manicure\" after they did my SNS nails. Still trying to find a regular nail salon to go to.", "label": 2}, {"sentence1": "Good gyros but rude staff.  The woman did not seem interested in helping us and when she did she was very snappy.  Not helpful at all.", "label": 2}, {"sentence1": "Is a hip vibe an adequate excuse for indifferent servers to serve tasteless food?  Sadly, they seem to think so.  Ordinary omelet, totally tasteless grits, cold biscuit, lukewarm coffee.  I was at the counter, the server knocks over the creamer.  Apologetic, wipes up the spilled milk, but leaves all the surrounding crumbs on the counter (was she thinking \"those weren't MY crumbs?\")  Had been there twice before, was so hoping to think that the first two visits were flukes, clearly not the case.  Will not return.", "label": 2}, {"sentence1": "Service was attentive but EVERYTHING was overcooked!!!!!\nI asked for a medium rare burger it came  out medium well. My wife got the chicken finger sandwich which was \"ok\" and her steak fries were so over done that my daughter was making drum sounds on the table. We had nachos to start. They were decent but again old stale nachos and burnt cheese. \nWe live in Waltham and wanted this to work but it was a HUGE disappointment.\nWe won't be back.", "label": 2}, {"sentence1": "I've given this O'Charleys several chances.  I keep going back and I WANT to like them, but I don't.  I've never had a problem with the food (except our rolls were a bit overdone this time), but the service is TERRIBLE!  The staff is very slow and very indifferent.  I will not eat at this location again despite how much I love their rolls.", "label": 2}, {"sentence1": "I enjoy the food here if I'm looking for something easy but delicious. I was happy to see new offerings recently as well. However the staff and cleanliness of this one in particular could use a refresh. The hostess at the time was cold and disinterested and there was a lot of servers talking poorly about one another, not what I need to be hearing. Our waitress was great about being accommodating to our child's peanut allergy but otherwise if this was my first time, it would be my last.", "label": 2}, {"sentence1": "To all of you that raves about this LOL it's not even the food was bad...just no seasoning...customer service was good, pricing isn't the worst", "label": 2}, {"sentence1": "Ha ha ha ha. I totally forgot how lame the Atlanta food service groups are! While I did get my drink fast the sub text of the entire transaction was \" go away-you're bothering me.\" Anyhow, as far as coffee goes, it's the best of the worst. (Peet's was a complete nightmare w 1 person behind the counter taking orders and making drinks-as slow as pondwater.)", "label": 2}, {"sentence1": "Came here for lunch, food was on the mark. Fried green tomatoes and the pimento cheese plate was a great story followed up with the hot chicken sandwich which was the perfect amount of flavor. One of us had the BLT which was great too. \n\nI'll be back for dinner.", "label": 4}, {"sentence1": "Well I could not wait just had to try this spot. Delish is all I am still thinking about.  Ordered the sliders, one naked two with guacamole, jalapeno and frozen lemonade.  No fries since I dont eat fried food. A bit pricey but no regrets. I would love to go for breakfast, I bet the sausage is good with eggs. Will definitely be back.", "label": 4}, {"sentence1": "The flavours are pretty good. It's a small little place with good Filipino food and good friendly service. You got to keep in mind Filipino food isn't the highest rating in cuisine compare to French, Chinese or Japanese food. The food is a bit greasy, but that's the type cuisine. Price is pretty decent. It's a place worth trying if you want to mix up your outing.", "label": 4}, {"sentence1": "A great hotel located just off Davie Street.  For the price it can't be beat.  Attentive staff, great space, close to great restaurants and culture.  We plan on staying here the next time we are in Vancouver.", "label": 4}, {"sentence1": "Affordable place,  food was not bad. Gave four stars because service was slow and food was hit or miss. I liked about half of what I ordered. Fiesta plate is a good deal if it's your first time here! Rice was good", "label": 4}, {"sentence1": "Yummy, quick, flavor blasting. Wonderful kind service and plenty of seating. Great for a quick bite.", "label": 4}, {"sentence1": "The service at Tokyo Dining is always great. We have been here a handful of times and are always impressed and delighted by the service! The waitresses are marvelous and the manager takes an active role in making sure that guests with dietary restrictions are taken care of. As far as the food, I especially enjoy the miso soup and vegetable roll. The Mango Mousse Cake is phenomenal...it's a must-try!", "label": 4}, {"sentence1": "Like this gym and they are open 24/7 which is pretty convenient for me.", "label": 4}, {"sentence1": "Menu is a really great combo of recipes from chefs from all over. I had an awesome Mediterranean tuna salad sandwich.", "label": 4}, {"sentence1": "Food was good but a little on the salty and greasy side.  We had burgers with a side of mashed potatoes and gravy.  Everything had an interesting favor that made me asking myself, what is that flavor I'm tasting.  It was good but I couldn't eat it everyday.", "label": 4}, {"sentence1": "The food here is plentiful and good. The service is attentive; food arrives pretty fast.  The decor is fairly utilitarian. When crowded, it can get a bit noisy.", "label": 4}, {"sentence1": "The wings from here are great! So many different flavors to chose from.Tuesdays are wing night I think 50 cents a wing?Definitely worth checking out.Most of the bartenders there are friendly/helpful will make sure you have a drink in front of you but Carolena was great she made my friend some yummy drink!!!!", "label": 4}, {"sentence1": "I was looking to taste some wines,  but the menu they gave me didn't have any tasting flights on it. After I ordered a glass of wine,  I noticed people around me tasting, so I guess I should have asked.  The ambiance was really nice and for a big space, it felt cozy.  The staff was really nice and gave everyone in the room a little taste of his new winter cocktail he had made.  I would definitely come back ad spend more time here.  They even have live music which would be fun to see.", "label": 4}, {"sentence1": "The patio is hot. Wear a tank top in December!\n\n\nThe menu is great! \n  The have an attentive staff.  I love this place.\n\nGreat drafts and they even have sofas. {next list}.\n\nI am not fan of gumbo but everything else I have tried has been great. From okra to mac and cheese. The pork tacos are yummo. And the shrimp and grits are tasty.  Don't forget the onions.  Not onion rings ONIONS!  So... good.", "label": 4}, {"sentence1": "OH MY GOD! This place is crazy expensive, but well worth it.  I can't wait to come back. Beautiful and great customer service. Being able to watch wild animals from my room's balcony? Priceless! Only disappointment was that there were some activities we wanted to participate in, such as camp fire stories, and twice, we waited at the right place (double checked with the concierge, and nothing... I wonder what happened there... Also... I feel that for the price, the rooms should be roomier... have a bit more space. The restroom was tiny!", "label": 4}, {"sentence1": "A smaller and quieter location of Nuba, but the food was amazing as usual. The lamb lunch plate was so goooood!!!! The lamb patties were juicy and flavourful, the hummus was delicious, and the plate overall was exciting and balanced with salad and tzatziki and roasted potatoes.", "label": 4}, {"sentence1": "Jeff Duff - Well, I never heard back from you about trying to make things right with me or to invite me back so..... By the way, I am glad your website no longer lists prices - much better chance of not ticking off customers that way. I hope my review may have had something to do with that. Oh... your online menu shows an offering of DESERTS - you might want to change that to DESSERTS unless you are serving up portions of the Sahara or Mojave. \nJust saying. Who maintains your website? Sheesh!", "label": 1}, {"sentence1": "Ordered from drizzly from here and an hour and 20 minutes after placing the order (that was supposed to be under an hour)  called the store and they said it would be another 20 minutes. Then when I asked why wouldn't they notify customers about the difference in time they said that's drizzly's job and they don't actually help get products to the customer. The guy was an ass.", "label": 1}, {"sentence1": "Let me start by saying good things. Great cozy ambience with candle on every table. We went on the evening of snow storm. Friendly service.\n\nNow the bad stuff: Really strange menu and also very expensive considering the portions we got. The \"spiciest\" yellow salsa that comes with sweet potato chips tasted like pumpkin purée. The \"Causa\" dish was ice cold- not sure if it is supposed to be. Another dish we ordered from the \"grande\" section was basically 10 potato fries on a bed of arugula...for $15.\n\nThe food here represented everything that's wrong with hipster vegan scene. \n\nAVOID!", "label": 1}, {"sentence1": "Worst restaurant in Atlanta.  Service wss awfully,  they were poor of Hackett of menu,  tried to stick us with appetizer s, we never order.   Please look at Open table for complex review.   The long and short of it is DO NOT GO.", "label": 1}, {"sentence1": "People that came after us got their ordes first. They also took a long time to take our order.  I thought this place would it be better. Not coming for sure.", "label": 1}, {"sentence1": "the service was TERRIBLE, I ordered wheat toast and got white bread, no water unless  I asked for it and had to wait for 10 minutes for the jelly after asking for it. I WILL NEVER go back to this restaurant oh and found hair in my food. The waiter or owner I assume didn't apologize for anything. Terrible place to eat and very dirty,rundown", "label": 1}, {"sentence1": "Nothing to recommend except nice waitresses. How can you mess up scrambled eggs! They had a weird flavor and tasted like they had sat under a warming light. The Library Fries were soggy with grease and over spiced, the coffee tasted awful, like it had sat on the burner all day. The interior is dingy and seems dirty--- you stick to the floor. We sat in the outdoor area in back which unfortunately has numerous trash and recycling bins right next to the fence, had to move to get away from the smell. Will never return...", "label": 1}, {"sentence1": "Wouldn't recommend. Food took forever and when delivered it was wrong. Not sure if the waiter or the restaurant but regardless, In an airport, you need to be efficient and good and neither of these criteria were satisfied. Sad because the atmosphere was nice.", "label": 1}, {"sentence1": "We have eaten here in the past and the food was very good. This time the salt, pepper squid and orange chicken was terrible. Old & hard with bad after taste. We sent the orange chicken back and suffered through the squid. We won't be returning. This is not the quality of food it used to be.", "label": 1}, {"sentence1": "Horrible, horrible, horrible! \n\nAll of their listings look beautiful. I wish someone would contact me back to let me see them.\n\nJessica completely dropped the ball with me. After avoiding my first set of emails I kindly asked her if there was someone else I should contact because I still wanted to work with Advantage. She promptly responded and asked for my price range, amentities, etc. Never heard from her after that.  \n\nShe still continues to post the same apartments. So either she has plently of clients to show these places or it's some kind of scam.", "label": 1}, {"sentence1": "If I could give this place 0 stars I would. Saw countless waiters without masks and all of their tables are full. They are NOT COVID conscious at all. Many waitresses had their mask down while they were carrying and serving food. When we talked to the manager Marlina about our concerns she blew us off completely.", "label": 1}, {"sentence1": "Just spent $84 on take out. One of the meals was fettuccine alfredo with cherry peppers for the vegetarian in the house. Ended up with added chicken, (which cost extra) and no sauce on the fettuccine. They ended up giving us a credit after 20 minutes on hold, but the vegetarian had no meal.", "label": 1}, {"sentence1": "Very disappointed.  The website love to talk about how they have a large number of whiskey. But half of their list doesn't exist on the shelves!! Off to find a better \"whiskey\" bar in Portland. I didn't expect much but I expected better!!!", "label": 1}, {"sentence1": "Farm To Ladle\n\nI simply bought a muffin (which was good).......But my checkout experience, awful. \n\nIdk if she's over worked or just didn't want to be there. But everyone before and including me were were checked out while she did 50-11 other things. No customer service experience here. \nJust hurry up and buy so can go on the the next task.", "label": 1}, {"sentence1": "I chose this company based on the good reviews. I left a message through yelp and got a response immediately. We scheduled an appointment for Saturday at 1. He called to say he was on his way. Then texted me after he arrived in my neighborhood saying he had an emergency, had to leave and would call to reschedule. Never heard a word back from him. I'm not sure why he chose not to call back to reschedule, especially since I noticed the good review from someone else 2 days ago.", "label": 1}, {"sentence1": "This place is the fucking worst when it comes to service. I gave them a chance to redeem themselves after my first encounter when it took them 1 1/2 hours to deliver the wrong fucking order.  Why did I kid myself into thinking that their performance would be any different?  I will NEVER order from them again.  Judging from similar reviews, I don't see how they're even in business. They need to realize that there are consequences for shitty service.", "label": 1}, {"sentence1": "What a place. Would highly recommend the broccoli tempura sushi roll. Does it count as sushi? I doubt it. But for vegetarians it's the best. Also you may think that rolling up in your pajamas to get your take out order is cool but it's definitely not because it's a nice establishment with people wearing nice clothes. I repeat don't wear your pajamas. But order everything.", "label": 5}, {"sentence1": "So good!  I tried the SAMwich and loved it!  The spicy pickles are so good!", "label": 5}, {"sentence1": "Ultra quick response & very professional.  Locksmith was respectful & courteous - handled my lock issue right away (locksmith at my home in less than 20 min).  I was in a big hurry and they accommodated - I can't say enough positive things about my excellent experience, they know what they're doing.", "label": 5}, {"sentence1": "This place is the best! The cakes are always moist and sweet. They're absolutely perfect. I ordered a cake for my mom's birthday and they gave us the wrong cake flavor. They were happy to replace it, so we ended up with two cakes! It's also near my orthodontist so it's a good treat every few months.", "label": 5}, {"sentence1": "Best quick burgers in Harvard square.  Great bread, the burgers are thin but juicy, and they have a good variety of specialty ingredient options.  I've eaten here a few times, and it's been great each time.", "label": 5}, {"sentence1": "Charming little spot in an adorable neighborhood. The staff is so friendly and the atmosphere is perfect for a relaxing afternoon.", "label": 5}, {"sentence1": "I stumbled upon Ritzy Rags while visiting FL. I was instantly pleased by finding such a fun shop! The shop woman (I cannot remember her name) was super welcoming and informative. I asked to try on some wigs, they have a $5 wig cap fee. I ended up purchasing a fun \"china doll\" wig. The woman showed me exactly how to put the wig on and store it. I am a wig newbie so it was nice to have a quick lesson!", "label": 5}, {"sentence1": "I couldn't be happier with my first experience here. I wanted a specific style, a bl nd of two pictures and Amirah fulfilled my wishes perfectly. I am natural so I'm always weary going to new stylist and how they will handle my thick texture and if they will value my edges but she came through. And it was the day of that I called! So happy!", "label": 5}, {"sentence1": "Great clam chowder, plentiful fish options, and ambiance you cannot rival. This place is a must visit when traveling to Boston for any length of time.", "label": 5}, {"sentence1": "Great experience! Great atmosphere!\n\nMy trout was awesome - AWESOME. My husband's Fat Jak burger was amazing. (\"I know! I'm talking about a burger! But, it's amazing,\" he said.)\n\nAnd, when we told the servers we needed to catch a plane, they were kind and accommodating about getting us out of there in a flash. \n\nAlso? A manager refilled my water glass with no fuss at one point. I LOVE an environment where everyone does anything they need to to make sure the customers are having the best experience possible. \n\nI HIGHLY recommend this restaurant for a great overall experience.", "label": 5}, {"sentence1": "Best steak I have ever had in my life. The gravy sauce they complimented it with was so good you couldn't help but lick your plate when no one was looking. I can't wait to go back here.", "label": 5}, {"sentence1": "Great staff, awesome coaches, & killer work outs!! Love this location and Coach Joey is the best!!", "label": 5}, {"sentence1": "I've here twice already and I want to go back. Is it expensive? You betcha! But it's sooooo worth it. Great tasting food. Friendly staff. AND THE DRINKS ARE STRONG! I mean, I don't think you can go wrong at this place. I wish I took some pics of the food but it was too good looking and tasting to even think about bringing my phone out.", "label": 5}, {"sentence1": "Enjoyed every bit of what they offered. This was a last minute decision as the place we were originally looking to eat at had a 45 minute wait. This place was worth it. From the daily specials to the location and variety. We both ordered the Sampler which was on special so it was only $9.99 plus the price for a drink, I also ordered a kids meal spent less than $20. Can't wait to eat there again.", "label": 5}, {"sentence1": "Bufet sábado y domingo buen servicio además contamos con una buen servicio de licor y vinos de buena calidad", "label": 5}, {"sentence1": "Had a lovely patio brunch at roadhouse this last weekend. I know I may just be really happy to have someone else make me drinks, cook my food and clean up after us and our 4 teenagers after the quarantine, but we had an amazing time. Our server, Leah, was probably one of the best we have ever had. She was respectful of Covid, yet you could just tell she was smiling behind that mask! The food was great, drinks were perfect and the atmosphere was exactly what the doctor ordered.", "label": 5}, {"sentence1": "Went for lunch earlier in July.  The beer selection isn't huge, but they do serve it in frozen pint glasses.  Food was OK, service was good, prices a bit high for the quality and imagination.  Was a bit put off by children running around without masks, but hey, it's Lake Oswego.", "label": 3}, {"sentence1": "Not bad. Good decor for Chinatown. I prefer the food at Peach Farm.", "label": 3}, {"sentence1": "A former employer used to order their sandwich platters for lunch often.  This is where they lose stars.  The veggie sandwiches were often soggy, and also hard to identify because they weren't separated from the meat sandwiches or really labeled in any way.\n\nHowever, the enormous baked potato platters were good, and the times that I have gotten to pick out my own food from their menu have been good, too.  I really enjoy their grilled portobello wrap.", "label": 3}, {"sentence1": "I am not the biggest fan of this place. The food isn't that great. The service is decent but nothing special and I always feel a little icky after I eat some of the food. One plus is that they do have online ordering.", "label": 3}, {"sentence1": "My order was taking fast and the food was well made on time. The girl on the phone really didn't seem like she understood my order but it was made correctly. It seems liked they was rushing though... but it is Friday. My fries was not done , they was Soddy and the cheese barely melted on my Philly cheesesteak. The wings was good as always , I just wish the food was made with the same curiosity on a Friday as it will be in a Monday. 3 stars for now until my next visit.", "label": 3}, {"sentence1": "MALL COP!\n\nYep Kevin James comedy was filmed here. I had the pleasure of watching the crew set up and filming almost the entire duration of the filming. My office is located right next door and I would stop by for lunch to see it in action. \n\nCool mall but parking can be a beast. Good selection of stores and places to eat (Cheesecake Factory, Johnny Rockets, Uno, etc).\n\nRock on West Orange, NJ!..... I mean Burlington, MA.", "label": 3}, {"sentence1": "pretty cool brunch spot, I prefer to go during the week when its more chill, rather then the loud music playing. I love to get the salmon patties they are pretty good! and the staff is super nice!\nbesides my one visit where my waiter was apparently going threw relationship problems and  basically was crying and fighting tears back while trying to serve us, and just wasn't able to work at his best because of his broken heart but hey we all go threw stuff right? I hope it all worked out though..", "label": 3}, {"sentence1": "The service is blah but the food was good. I had fried calamari and stuffed shrimp . Drinks r good and gives just enough strength to get u tipsy", "label": 3}, {"sentence1": "Huge store, big selection, prices are kinda high though.", "label": 3}, {"sentence1": "delicious pizza with good ingredients. Disappointed that the roasted red peppers were not fresh but the crust of the pizza was flavorful and crispy. They cook  pizza on the very well done side so a fair bit of charred areas on the crust. Tasted good though. TIP don't go on Fri between 5 and 6:30 unless you like kids, I mean really like em. The place was filled with families with toddlers.", "label": 3}, {"sentence1": "Been wanting to go here for the longest time. The design of this place is remarkable. It's so vast and huge and lots of open lighting! Seating is very comfortable, they even have pillows for some tables! Great place to do work and has some outlets.\n\nI was overwhelmed by the amount of drink options. Some things were overpriced. The bathroom was super cool lol. Great place to catch up with friends!", "label": 3}, {"sentence1": "Best restaurant in the international departure terminal but that is not a huge compliment. Given the poor selection at the terminal, this is the best of the alternatives. Decent food and drinks.", "label": 3}, {"sentence1": "It's ok but service is slow and sometimes they forget about your order. Not worth lining up for too in that case.", "label": 3}, {"sentence1": "Waited ten minutes to find out they forgot my order then waited another ten minutes to get my food and realize they messed up my order. The fries were thrown in the bag upside down and the burger itself was mediocre, a little on the greasy side. Wouldn't recommend trying this place.", "label": 3}, {"sentence1": "Ordered the smoked salmon for $7.95, grilled on fresh wheat bread. Lack of bread options is a minus, otherwise very tasty. A nice little side would be nice. The regular sandwichs are $5.95 which is a good value.\n\nThey always seem to put your order on the glass, instead of walking 5 steps to give it to you.", "label": 3}, {"sentence1": "Another Thundercloud, another sub shop. What else can you say about Thundercloud subs. They are an Austin institution and now they are in Dripping Springs.  Located in the HEB shopping center between Rick's cleaners & Vik's Jewelry. Same side as Hill Country Ranch Pizzaria and Twin liquors. Consistent food quality. Fast service. If you don't  know about Thundercloud Subs.... crawl out of your cave and get some good grub!", "label": 3}]