[{"sentence1": "Used to be an awesome local neighborhood spot. Now it is understaffed and overpriced. The food is not bad, but not worth the price. And the service is usually very slow. Friendly, but very slow. Fine place to go drink with friends, and a nice outdoor patio for warmer days, but without the pizza and with the high prices, you can do better than Joe's.", "label": 2}, {"sentence1": "I'd much rather go to Kizuki Ramen and Izakaya. The miso ramen I got was way too oily,  the pork was too thick and fatty, and the noodles were way too thick and over cooked. It was very disappointing, considering that the restaurant is a literal attachment to a Japanese market. Other than the food the employees  were very nice and the food came fast. Also, right after you eat, you can go to next door to the market. THe market has a bakery, a manga shop, and a place where you can go buy crab and oysters,etc.", "label": 2}, {"sentence1": "Cut me off after having one long island ice tea, decent golf course but wasn't even close to drunk and didn't even drive there (took the train), really not an experience that I'm used to.", "label": 2}, {"sentence1": "This was my first ever time at a Buffalo Wild Wings. Excellent take out setup separate from the main restaurant. The woman who got my food was very helpful and nice. I was very disappointed with my $12 wrap. It was about the size of a large egg roll and tasted only slightly better than a quesadilla from Taco Bell. It was overfilled with gross cheese, very little chicken, and because of that it had a very mild flavor.", "label": 2}, {"sentence1": "My sausage was hard, my husband sweet potato fries was burn he didn't even touch it, I'm not coming back", "label": 2}, {"sentence1": "I'm quite disappointed at this place. Just had lunch there and I won't be coming back for sure. My Hubbie and I was walking around the area and saw Toto ramen. We were hoping it would be as good as the one in NYC but it was no where close. The food was meh and the service was also meh.", "label": 2}, {"sentence1": "The food is good but their old menu was much better. Too many cream sauces with their pasta dishes.  The problem with Romeo's is the service.  Was there for happy hour and ordered items from on the list but was charged full price.  Our waitress had never heard of happy hour.  Manager could have cared less.  After loud discussions, she corrected price for pizza but would not take the $1.00 off for the wine.  How could management let a  waiter work during happy hour and not tell them about it?  And, yes, the music is awful.", "label": 2}, {"sentence1": "A simple 45 minute wait turned into two hours standing waiting. The food was excellent as always, but the hostess was not. Disappointed and don't plan on coming back with a group larger than two.", "label": 2}, {"sentence1": "This was my first time at a zoo since I can remember and it was a sad experience, the animals looked sick and depressed as if they don't get fed, not much could I say about this place. Probably the only positive thing I could say is that the parking wasn't bad. Someone needs to set them prisoners free the cost of the visit I hoped was refundable", "label": 2}, {"sentence1": "I had anticuchos and the peruvian corn was rotten. Let the staff know and they didn't care. Never come back again.", "label": 2}, {"sentence1": "I used to use them constantly but $15 for a watch battery & closing before 5:30 all lights out has soured me. They're not very friendly either- but they must have a reputation and not care. They're fast I'll give them that. Oh well won't be going back.", "label": 2}, {"sentence1": "Way too expensive for food quality. Pasta was okay but nothing close to what we were expecting. Keep in mind you can't order food for a single person, you need to share. Won't go again.", "label": 2}, {"sentence1": "you would think the owner would respond to any of the negative or even positive reviews   he own two locations   perhaps this explains why a talented and honest manager leaves without a comment or response from the owner!!!!", "label": 2}, {"sentence1": "Cute shop love the decor. Cupcake choices were good but nothing special or original. I pick 4 cupcakes mint, pretzel, chocolate, and vanilla. I got them about 8pm and sadly that's how they tasted old. They were not moist like a cupcake should be but I will say the frosting on all of them was delicious that was the saving grace and why they got 2 stars. \n\nIn this day in age cupcakes are over so if your going to sell cupcakes they need to be mind blowing.", "label": 2}, {"sentence1": "Food was okay, but nothing to write home about.  The wait was crazy, even though we had reservations.  Then because there was nowhere for anyone to wait, the door was open all the time and I was freezing cold.  We also had to wait a long time to get our food.  Waitstaff was good, though.", "label": 2}, {"sentence1": "Overpriced \"starter apartment\" furnishings.  It's like a smaller, equally soulless Ikea.  Go to Model Hardware for hardware, and the \"We're Cheaper than You\" fouton place across the street for cheap furniture that's actually cheap.  Go here for kitschy lamps.", "label": 2}, {"sentence1": "A no frills, self service place!\n\nI came here on a late Saturday afternoon and only found one person eating in, while a handful of others were waiting for their takeout. \n\nOrdered the chicken pad see ew; once it was done, you grab the bag and head over to the utensil counter. I like how they have a water dispenser for you and cups instead of having to ask the staff.\n\nThe chicken was chicken breast, a little dry since it is breast, but nonetheless still pretty tasty. Next time I'll have to get the tofu instead of chicken.", "label": 4}, {"sentence1": "Was a bit skeptical at first but the won me over. The absolute convenience of being able to drop off and pick up my clothes at all hours, that is great. The quality of their cleaning and pressing is as good as others and when I do go in, they are friendly and prompt. At this point they are my go to cleaners in Orlando.", "label": 4}, {"sentence1": "Great flavors, great topping choices. Nice and clean. Nothing was empty or low. Looked pretty. Customer service is lacking. No emotion. Very robot like. Didn't really interact or have any interest in doing so. But other than that, great place :)", "label": 4}, {"sentence1": "LOVE this place! However, beware the air conditioning! It's always very cold in here, and nothing the staff can do about it. Also, tonight my slaw seemed soggy. Otherwise, very good and consistent. Kid-friendly as well.", "label": 4}, {"sentence1": "THE BEST and my favorite Thai Spot in Boston.  Yen Ta-Fo Noodle Soup is my ultimate favorite. Delicious sweet and spicy red soup with an assortment of seafood (scallops, shrimp, and squid).  The Crazy rolls are also an exceptional starter (very filling).  \n\nDining in:  They let my room mate roll in there with just a bathrobe on... nothing under.  Staff didnt seem to care which was cool.\n\nTakeout:  Expedited our order but I would not recommend doing delivery.  Portions are way smaller.\n\nThey take husky-card which is a huge plus in my book = Fat tab on the parental units.", "label": 4}, {"sentence1": "Great Nashville Hot Chicken. You won't be disappointed.  Service is a bit slow, but the food more than makes up for it.  I definitely recommend.", "label": 4}, {"sentence1": "Went here with 2 friends for happy hour. The waitress was great and once I let her know my preferences in red wine, she brought me two options to sample and they were both wonderful. We only ate appetizers, but those were fantastic. The ambiance is very nice- cozy and warm. It's not inexpensive, but you get your money's worth.", "label": 4}, {"sentence1": "I highly recommend Barefoot mosquito service. It is the most effective treatment we've tried to date and is safe for kids/pets. Excellent service and not a mosquito in sight!", "label": 4}, {"sentence1": "OMG! This place is awesome, love the food, love the prices, love the full bar! The staff is super nice. The only complaint is they need to have a Sauce/No Sauce option, the \"Special Soy Sauce\" is super delish but sometimes way too heavy. The burritos are stupid good! This is a great little addition to L5P!", "label": 4}, {"sentence1": "I got great, polite service here when I went if for an oil change one Sunday morning. Sure, they try to upsell you, but that's what businesspeople do; you can always say no. I would definitely go back for my oil changes here.", "label": 4}, {"sentence1": "I love this place. Friendly staff. Good food. Try the juices!!!", "label": 4}, {"sentence1": "I'm surprised by the mixed reviews here.\n\nWe had a great time at Tableau last night, walked in without a reservation and had great service and food.  The bartender was knowledgeable and friendly, as were the hostesses and wait staff.\n\nWe both had pasta (garganelli and the ravioli special) which we found to be delicious and well prepared.  We shared a rhubarb cake with buttermilk ice cream dessert, which was excellent (I may have to go back for another).\n\nWe walked away thinking this is a hidden gem, we weren't aware of the restaurant until we stumbled on it.", "label": 4}, {"sentence1": "Great variety and selection of different pastas and sauces. Good service and nice areas to sit and eat. They have specials which are always interesting and you can choose where you want to sit. Instead of a number to let waiters know where to bring food, they give you a hand-painted pepper grinder.", "label": 4}, {"sentence1": "I was really craving beef noodle soup so I decided to try this place out.  I ordered my food to-go.  They were timely and the place looked very clean.\nThe soup was tasty, though, not as flavorful as what I'm used to getting in Flushing, NY.  However, the flavor was still good and the beef was very tender.  \nI will definitely be coming back and I look forward to trying more from the menu.", "label": 4}, {"sentence1": "Delta terminal significant updates with restaurants and local eats. Easy tram getting around from a,b,c,d, and T concourses. They still have those nasty smoking areas though. Not a fan, and their pet area was bigger then expected however it'd be nice to post placards to define rules of the pet area. We had numerous passengers come in while we were there. Not very courteous.", "label": 4}, {"sentence1": "This is the only place where I will buy hummus when I can't get my mom to make it for me! They are always friendly and helpful and have a good selection for such a little place.", "label": 4}, {"sentence1": "Place and owners are crap. Made an appointment, we show up and door is locked . Saw people inside and waited 45 minutes, knocking at least 5 to 6 times. No one cared enouGh to come tell us anything  and then they just disappeared out the back and left us out front. Unprofessional, no more like in-humane. Animals behave this way!", "label": 1}, {"sentence1": "Stopped here while on a shopping trip from out of town after reading positive reviews. Complete waste of time. Dresses were dirty, the stock was laughable and outdated. I was looking for something for a red carpet event and these weren't even mediocre prom dresses. Also, the two ladies working (one was obviously the owner) were less than accommodating and incredibly rude. What a disappointment.", "label": 1}, {"sentence1": "Pretty much the worst service I've ever seen in my entire life. Refused entrance to 8 out of state people who were probably going to give them $500 profit. If you are not from Mass don't bother. I can not imagine any bar in Florida doing that. ZERO stars.", "label": 1}, {"sentence1": "They were awful - they raped me of my entire savings... and I ended up settling in mediation.  They were not proactive.   They sent in-house emails to up the bill.  Do not waste your money, they are crooks.   If you need a referral for someone who has your back, happy to help... it is not these guys.  I would've given zero stars if that were an option.", "label": 1}, {"sentence1": "Awful job on my hair, was there a whole day just for color touch up then again, for longer to fix it. Not worth the price either.", "label": 1}, {"sentence1": "I have tried this restaurant five times hoping to find something that I liked and so far it has been a strikeout every time.  I can say that the coffee is good. The pancakes, the pulled pork, the soup...things that I love to eat...not good. I kept trying this place because it is close and because my daughter raves about the other Austin Java's but I have given up.", "label": 1}, {"sentence1": "Hyped, overpriced pizza.  Waited 95 minutes after being seated for our pizza.   Got sick after eating it.", "label": 1}, {"sentence1": "awful service, no one seems to know what's actually going on. It's not that hard to keep things organized and help a customer who is trying to give you money during a pandemic. EVERYONE AVOID THIS GOD AWFUL PLACE!!", "label": 1}, {"sentence1": "This place is terrible. I rarely write reviews, but felt I needed to as a PSA. \n\nService: I ordered food and coffee to go. They forgot both my orders as I sat at the bar waiting on them. This took over 30 minutes to resolve.\n\nFood: Not good and absolutely not worth the wait time. I ordered a spicy egg sandwich: the bread was completely burned and they forgot to put the spicy mayo on it. Super.\n\nCoffee: Mediocre at best. Starbucks or DD would probably be better. \n\nDo not waste your time or money here.", "label": 1}, {"sentence1": "Awful service. Took over 3 months for them to even come close to dealing with my porter cable air compressor. Then when I called he said he was eating and couldn't gather any information on the repair until after he was done eating! DON NOT TAKE ANYTHING TO GET REPAIRED HERE. Awful", "label": 1}, {"sentence1": "Painfully slow if you order anything beyond a muffin or bagel.  We waited over 35 minutes for a sandwich from the grill and were ignored by the staff at the half hour mark when we asked (still kindly, btw) about the status of the sandwich.  We were not even there at a busy time - so not sure what was going on.   There are much better lunch options in the area.", "label": 1}, {"sentence1": "I live in German Village and frequent Stauf's regularly and have generally had agreeable interactions with staff members. This morning I had an incredibly unpleasant exchange with a staff member when I asked for a very simple thing (correcting an error that another staff member made when I put in my order). I was treated rudely and sensed a very negative energy amongst staff members.", "label": 1}, {"sentence1": "Went for breakfast on a Saturday, sat for 30 minutes without service. Probably not the best weekend breakfast spot.", "label": 1}, {"sentence1": "So during this corona virus chaos, I was standing out side organizing my groceries that I had just khrcbased and this rude lady with grey hair started yelling at me saying it's a $1000 fine. And never let me explain myself and pushed me with her hands. So awkward", "label": 1}, {"sentence1": "Today my son and I order the Parmesan pizza style instead of that Alfredo sauce, we had marinara instead on it it had hardly any sauce very dry even the spaghetti was dry with no sauce on it the worse chicken Parm pizza style I've have ever had it actually upset my stomach after eating about eight bites I had to actually have two glasses of tea that is how dry the food was. I am hoping next time we come here it will not be so dry that is my sons favorite dish that we alway share!", "label": 1}, {"sentence1": "The restaurant was empty, but it still took them 30mins to seat us. Once we got the table, the server never showed up to till 40 more minutes after we seated. Hope the service improves.", "label": 1}, {"sentence1": "Dr Lubin is kind, professional and very knowledgeable. I'm a nurse and I highly recommend Austin Gastroenterology", "label": 5}, {"sentence1": "I have written a review before so I'm. It sure why I'm writing another one, however, I typically eat the fried fish from here, it's about $13.00 and it's all fresh to order!", "label": 5}, {"sentence1": "Good service and great food.\n\nI arrived at 5:30pm on a Sunday and was immediately seated with no wait. I ordered the gyu-don and sumai. Both came out quickly and were great. Meat was well cooked and juicy - no complaints.", "label": 5}, {"sentence1": "Went for brunch on Sunday morning and loved the food from FoxFire Tacos! That was maybe the best burrito I've ever had in my life. Top 5, easily. Great ingredients, great execution, great taste. The other items (tacos, tostada, & bacon) were great, too! Great drinks at the bar, too, obvs.", "label": 5}, {"sentence1": "I brought a group of 17 co-workers here for a dinner following our meeting. The owner was very welcoming and the wait staff was fantastic. We were in a rush to get to a social outing, but the drinks and food came out in a timely manner. The chef did a great job and the food was delicious! We will return the next time we are in Austin!", "label": 5}, {"sentence1": "Love this place! Haven't had a tapa I don't like, and I've tried several! A fun atmosphere, great staff, and love the drinks! Would recommend to anyone!", "label": 5}, {"sentence1": "This is the best darn pizza I've had in a very long time. The store was very clean and the customer service was spot on. The pizza came out fast and HOT!  I ordered the cauliflower pizza crust and I was not disappointed.  I will definitely be eating here more often.", "label": 5}, {"sentence1": "Who would have known that not all good Chinese food exists in Chinatown?? This place is sort of off the beaten path and fairly small. But, definitely a must try! \n\nThe noodles are amazing. I'm not a fan of spicy, but they can accommodate and it still tastes great! It's super filling so don't try and order multiple items.\n\nAlso, keep in mind they only take cash!!", "label": 5}, {"sentence1": "I LOVE this place. WAY better than Felipe's/Anna's.   The Summer and Mediterranean Burritos are amazing.  Whoever invented  Mango Salsa is a god.", "label": 5}, {"sentence1": "I have been bringing my child here for quite a while now and let me just tell you that I love Cassie! She has a very welcoming personality, her professionalism and the fact that she cares is just awesome! My son son can't wait to come back! I cant thank you enough for people like her in this world!", "label": 5}, {"sentence1": "We wanted to get a new restaurant while we had friends in town.  Ran across this restaurant when looking for some top rated restaurants.  Awesome food selection, most of us went with the recommended burgers. The pickelback burger was delicious along with then sublime everyone else loved.  The place is very loud. They do have few tvs to watch the games.", "label": 5}, {"sentence1": "Love this place.  They have the best selection of beer, of any restaurant in/around Boston, and it is always changing.  The ribs are great.  One of my favorite things there are the sausages!  \n\nIf you love BBQ, you must go to Redbones!", "label": 5}, {"sentence1": "These are the perfect little pies when you're craving something sweet.  I recommend the s'mores and thebanana cream.  One is enough for one person.  Great for tourists.  Parking is a little tricky, like everywhere in the area.  I went in about 45 mins before close and they still had a good selection.", "label": 5}, {"sentence1": "Visiting for work, and this place was recommended.  If I lived here, I'd be a regular.  The staff was friendly, and professional. The food and drinks were wonderful. The atmosphere is refreshing!", "label": 5}, {"sentence1": "I had a wonderful experience at Lexus of Watertown. Tony Viveiros is a great salesman and he is very patient and gave me a good price. The customer service here is very professional and I am very satisfied. Highly recommended!", "label": 5}, {"sentence1": "Besides the food being great as always, the thing that impressed me the most with this particular Jack Allen's was the phenomenal customer service and team work I noticed from the staff. Everyone was friendly, upbeat, timely, professional and just overall very impressive.", "label": 5}, {"sentence1": "Tea was great however both the selection of food served for afternoon tea and the taste thereof were boring. I had higher expectations for such an iconic place.", "label": 3}, {"sentence1": "OK is the best way to describe this hotel. It serves its purpose but everything feels a little bit run down and worn out. As other have said the air conditioners in the rooms are also very loud. I was here in early October and wished that I could have just opened my window. Unfortunately that wasn't an option so if I wanted any fresh air I needed to  put up with AC noise.", "label": 3}, {"sentence1": "Order the fancy macaron, with the toasted almond really adds a nice crunch with the organic ice cream. This place is pretty similar to soft peak, with the inside of the ice cream hollow also. But in my opinon I prefer soft peak more. Kul cup isn't anything special or different from other organic ice cream places.", "label": 3}, {"sentence1": "Oh boy, another wine bar with just ok food,poor presentation and over priced.", "label": 3}, {"sentence1": "I ordered steamed dumplings and vegetable Lo Mein. Being of oriental descent, I have very very high standards for Chinese food. The steamed dumplings were not that good. The skin was too thick which made it not cooked all the way. The Lo Mein is fairly good. The flavor is just right which makes it delicious and good to eat.", "label": 3}, {"sentence1": "As a clinic, I think TVC does a pretty good job. I like the setup on 87th and how accessible all of the different offices are. Maybe this is just exciting to me because I had Kaiser my entire life prior to this! \n\nCan't really fault the doctor's offices here, but I have to say the pharmacy is RIDICULOUSLY slow. If you end up picking up a prescription here, just be warned the wait is pretty long. I waited 30 minutes just for a basic medication. The pharmacist hardly consulted with me. It was lame.", "label": 3}, {"sentence1": "If you are going to venture out to Kerbey Lane make sure to visit the original. One of the things that makes the original so cool is the atmoshpere, which the South Lamar location is missing. The food isn't as good, and the crowd is older and more family oriented than the original. \n\nA big fan of Kerbey Lane, but not a fan of this location .", "label": 3}, {"sentence1": "I have eaten at Manuel's dozens of times, and my conclusion is that you can expect to have an average experience and average food for an above-average price.", "label": 3}, {"sentence1": "I find this place to be overrated and overcrowded. If ben and Jerry's is your thing, you will love it. It is not mine", "label": 3}, {"sentence1": "Went here when trying to grab a quick bite.  service was prompt especially give it was only a single waitress working the while room.  The food was good but not spectacular.", "label": 3}, {"sentence1": "Great place for kids but it is not adhering by proper COVID guidelines. Only staff wore mask and everyone inside Adults/Children were not wearing masks or social distancing. High risk for Covid transmission.", "label": 3}, {"sentence1": "I drive by this place everyday. What I do not understand is why she has dead plants in front of her shop !? Great used gowns etc...I am sure. But for crying out loud...get some inviting plants or foliage to add to your nice planters!\nThat is all", "label": 3}, {"sentence1": "I've gone here a few times for an \"adult lunch\" with my coworkers. It's always packed but they always find space and the wait is never long. It's definitely a popular lunch spot in the area. Prices are a little steep for my pockets but I don't think it's unreasonable for the quality and the amount of food you get. \nI'd go eat there again.", "label": 3}, {"sentence1": "I give this 3 cause the drinks, there just aren't a lot of them I care about which sucks cause I love the actual bar. The patio is actually my fav especially when they have the lice music outside. The inside bar is fun but can get loud and is very small. Def worth checking out, it is a lot of fun and very entertaining", "label": 3}, {"sentence1": "*update\nAfter 6 days with no air 3 technicians and a whole lot of in between calls the unit was replaced and management was very apologetic. Due the maintenance manager called me and updated me periodically once she found a company to work and fix the system before the holiday weekend. She called to apologize and work to file a report on the incident. I'm thankful to have air conditioning and for the apologies.", "label": 3}, {"sentence1": "A good, inexpensive, greasy-as-can-be, burger. Huge portions on fries. Three stars is about as high as I'll go for a \"fast food\" chain. Still love this place when I'm feeling like a fat kid.", "label": 3}]