[{"sentence1": "I think I had higher expectations. I had a taste for pancakes this morning and I just didn't like the flavor of it. It has some spices/flavor didnt recognize. I had the NOLA omelet, I thought it was going to be mad flavorful but I was disappointed.  My favorite meal of the day is always breakfast, by seeing the reviews I was ready.  Also our checks were split and mixed up but my friend paid me the difference.  On the positive note, unless you try you never know how it is and doesn't mean someone else won't like it.", "label": 2}, {"sentence1": "Mediocre at best. Has a fancy vibe and nice layout but the food does not live up to the atmosphere. Meatballs were average as was the shrimp capellini fresca. I have had better quality Italian at Olive Garden. Overall the menu items I had were very bland and unsatisfying. Especially for the price points Juliet has, you would think the food would be much better. Overall it was an underwhelming experience.", "label": 2}, {"sentence1": "How can you screw up the most uniformly simple food ever. Breakfast sandwiches were overcooked and disgusting. Then wanted to charge me $1.07 for a water cup.\n\nCongrats...worst McDonald's experience ever.", "label": 2}, {"sentence1": "Great service, extremely fun atmosphere, but terrible food. The brisket was dry, the pork ribs were oily and the Mac and cheese was disgusting. I would take instant Mac and cheese over this stuff. Great place if you're coming to hear music, hang out at the bar with friends, but don't waste your money on food.", "label": 2}, {"sentence1": "The pharmacy here is going downhill. There is a fairly new woman who is always there in the afternoons, and she has the most difficult time understanding English. I have to spell my name 3 times and slowly for her every time. It is difficult to pick up any prescriptions.", "label": 2}, {"sentence1": "This Indian spot is pretty average with no help being given on pricing either.  I can't really say much since it was a fairly standard lunch buffet but the place was run down and there are just a lot of better options in town.", "label": 2}, {"sentence1": "This place is nothing special. Somethings were good and some were meh.  The general gau's chicken wasn't bad and the crab rangoon was tasty, but the szechwan spicy chicken was tasteless. The egg rolls were blah too. The hot and sour soup was good; a lot tastier than everything else I ordered. I probably won't order from here again..", "label": 2}, {"sentence1": "the pho was unremarkable. I can't think of any good reason why, other than it was just okay. It wasn't bad, just okay. The bahn xeo was big and they did not skimp on the fillings, especially the shrimp, but the pancake itself was undercooked and a bit on the gooey side....I don't think I'll be back here in the future.", "label": 2}, {"sentence1": "Happy hour prices are great and is why I've been here. The specials vary daily. \n\nIf you get there early enough it's not crowded. When I've been there the crowd has skewed to people in their 20s and 30s for Happy Hour but gets younger as the night goes on. \n\nThe sriarcha hummus has some kick to it and is good for sharing. The 50/50 burger was cooked perfectly and the bun held up nicely. \n\nI'm looking forward to trying more of the food on a future visit.", "label": 4}, {"sentence1": "Really enjoyed the brisket. Ordered collards and cream corn. Sadly the corn was only cream so it was thrown away. All in all I will return. Oh: the wings were goo", "label": 4}, {"sentence1": "Fun spot! Lots of cool games to try, and good beer. The DJ really committed to the theme which made for fun music. Cons: if you don't like being jostled by men excitedly running for their favorite game this is not the place for you, and the floor was so sticky my shoes kept pulling off my feet.", "label": 4}, {"sentence1": "Great food, very bad service. Vuelve a la vida appetizer is delicious. We ordered the seco de res and churrasco con tallarines. All food was awesome. However, poor service with waitresses is a very important point, they gave us sodas in the can, no cups or ice, never asked while we were eating.", "label": 4}, {"sentence1": "Found this place through a trusty Yelp search while in town on vacation.  This place doesn't disappoint (food and service wise), and the green smoothie was just what I needed.\n\nThey have a small seating area available for those wanting to stick around.  I was in a hurry to the airport, so unfortunately didn't have the opportunity to enjoy the lovely seating area.  \n\nWill be back next time I'm in the area.  :)", "label": 4}, {"sentence1": "Started going here shortly after I moved.  I've had a wild variety of haircuts in my life.  Everything from great, to one I refused to pay for and stormed out.  The cuts here have always been good, and what I am looking for.  No surprises.  Fairly quick service, reasonable price.  Looking for a quick, no appointment hair cut this place is worth stopping in.", "label": 4}, {"sentence1": "I had no idea this museum was around but was lucky to attend for free (usually $50 per head). It's privately owned with the rarest collection of cars, motorcycles, mopeds and bicycles. The museum also exhibits the most famous cars from movies and TV shows - from Back to the Future, Austin Powers, The Flinstones, Grease and much more. I got a kick out of checking out the Batmobiles and the largest James Bond collection. Great location for corporate events.", "label": 4}, {"sentence1": "This is my group of friend's Home Base. There was a time when we would go here like 3 times a week.\n\nFriday's is my favorite chain because there are healthy and cheap options.\n\nI don't know what it is but I love the bar here.", "label": 4}, {"sentence1": "Ordered okawari ramen which is the herbal soup ramen. Doesnt taste anything like herbal soup, just plain chicken soup. The reason i gave one star because the service sucks. The servers just ignore our table, gave us terrible seating when there's lot of empty table available, did not refill water. Would not be back for ramen ramen.", "label": 1}, {"sentence1": "If I could give this place a ZERO I would! The customer service they gave me was absolutely absurd. Their employees were rude and lied to my boyfriend over the phone. The Manager almost ran into me and never said excuse me. Then when my boyfriend called back everyone acted like they never talked to him. These people are ignorant and self righteous!!! I will never be back!", "label": 1}, {"sentence1": "If I could give zero stars, I would. Literally the rudest bouncer I've ever encountered in my life. I tried to take a water bottle out of the bar and the bouncer was so incredibly rude about me taking \"an open container\" -- UMM OF WATER? That you saw me fill up from your cooler in front of you?? He literally acted like I was a felon. The arrogance and attitude of this guy completely overshadowed the rest of our experience there. I will NEVER go back again.", "label": 1}, {"sentence1": "Horrible service and incompetent employees. These dummies failed to properly tighten the oil plug to my car. After a month of my car being serviced, the plug fell out while driving on the freeway and drained the oil all over the road causing 350 dollars worth of damages to my car. They need to train their employees better and have them lift weights so they have enough muscle to tighten a damn screw!", "label": 1}, {"sentence1": "The broccoli soup was cold.  The spinach salad was ok.  The sevice was incredibly low.  We are meeting friends at the zoo and chose this place because it's close by.  Our 70 year old waitress took forever to bring us a bill even after i asked for a to go container..... twice.", "label": 1}, {"sentence1": "Worst customer service ever. Had to make 7 trips just to get my 3 piece suit. All of which should have never happened. They literally screwed up at every step of the way and then nobody wanted to fix it. Don't waste your money here.", "label": 1}, {"sentence1": "1.5hr wait just for a bagel, and owner is extremely mean towards her employees and customers. Sorry but I don't condone that", "label": 1}, {"sentence1": "usually low to average italian food, but tonight the chocken carsonie was really bad, obviously the chicken had been sitting under the warmer since lunch, I ordered at 8pm, it was actually hard like a rock, NO quality control, just thow stuff on the plate and send it out the door. Stay with the stromboli. Its the only thing they make fresh.", "label": 1}, {"sentence1": "It's a ton of fun. I went with three friends this past Saturday and I can't say enough how much fun we had.\n\nAfter a short boat ride, you hike up to the first zipline, which is really short. From there, you go to another short zipline, then three much longer ziplines across the lake. Our guides Steven and Hannah were really awesome!\n\nMy advice to you: bring snacks for afterwards, stay hydrated, wear lots of sunscreen, and try to think of a better nickname for yourself then I did.", "label": 5}, {"sentence1": "We came by after an event at Edgewater High School & we're very happy.  Good thing we didn't check out Yelp reviews first ... Maybe they had a few kinks to work out, but they definitely did!!! We had a large party (4 adults/8 kids) and our server was great.  Food came in timely fashion and was delicious!! Highly recommend the deviled eggs, fish tacos & BBQ chicken flatbread.  Give The Hangar a chance - we'll be back!!!!", "label": 5}, {"sentence1": "Every single item on the menu was amazing. Ambiance was great. Music was perfect. Our waiter Bobby couldn't have been better. This place is about as good as it gets.", "label": 5}, {"sentence1": "Got stuck in an hour-long  line at Giacomo's with the kids. I persuaded my wife to go down the street a bit since all the other restaurants were so expensive. We stopped at La Summa, and we were glad we did. Homemade everything--meatballs, gnocchi, ravioli, fettuccini Alfredo, and the bread. The staff was great at sizing the kids' portions and the atmosphere was quaint with oldies playing. We were encouraged to sit and talk and enjoy ourselves. I highly recommend this place.", "label": 5}, {"sentence1": "Small place was busy, we got the last table (be sure you make a reservation).  Crab was tasty!  I liked the snow crab better than the king crab.  Gumbo is also unique but VERY good.", "label": 5}, {"sentence1": "Delicious Italian moderately priced, location is a bit hidden but worth looking for it, service is fast and food very traditional Italian. Will deff go back for more.", "label": 5}, {"sentence1": "I have had over twenty different items framed by Alice and team, and every time, they do the best job.  Not only that, but they were able to completely repair a stone carved piece of Asian artwork that belonged to my grandparents that I thought was beyond saving.  They have overhauled frame jobs that other companies did poorly; they have turned things around in tight time frames; they have called me with questions about the smallest details...\n\nI can't recommend them enough.  They have a great frame and matte selection, fair pricing and really excellent customer service.  I love them!", "label": 5}, {"sentence1": "Alex is amazingly talented and charming! He transformed my hair from dull, fringed to rich/dynamic and feeling incredible. The salon itself has a great ambiance and staff. Will definitely be back.", "label": 5}, {"sentence1": "I got scallions one time and it tasted like how urine smells. The do have very solid burgers though I am now weary of alll other items on the menu. The also had free samples of beer the last time i went on the beautiful rooftop pario above the resteraunt.", "label": 3}, {"sentence1": "This review is specifically for their spam masubi.. the spam is sandwiched between 2 thick rice slabs and the seaweed is too chewy. You can hardly taste the special teriyaki sauce  and spam as the rice slab masks the taste! Highly recommend reducing the amount of rice ! I've given them 3 stars because they have a spicy teriyaki sauce on the side which makes the masubi taste like something other than rice!", "label": 3}, {"sentence1": "I was ecstatic when they said that the bacon beer was available. Before I could order one, our waitress suggested that I have a taste, couldn't argue with that. Upon receiving it, I gave it a taste, and to my surprise and disappointment did not taste anything like bacon! It was way too bitter (I like bitter beer) and too much spice, with no hint of bacon. I was glad to not have a whole pint of it. \n\nThe burger was fine. Not great, not bad. LIke what others said on this board, their sweet potato fries is awesome.", "label": 3}, {"sentence1": "After hearing all the hype since this place beat Kane's I had to try it. I hate to say I was disappointed. I have to say first that the glazed donut was pretty good. But the rest of the donuts were mediocre at best and the coffee rolls were over fried and greasy.", "label": 3}, {"sentence1": "The drinks were good. The menu had me stumped because it didn't have typical wings and chicken tenders and a lot of the food selections are... eclectic.... or different...even the cocktail menu has some \"variety\" to it.", "label": 3}, {"sentence1": "One of the smallest rooms I've seen. There is no closet to properly hang your clothes in. They hung a bar up for your clothes on top of the refrigerator, safe and drawers. No adequate space for your belongings. Also, the maid service woke us in the morning to clean our room but we told them to come back in an hour and they never came back to clean our room. Great decor but very dissapointed with the service and the lack of space.", "label": 3}, {"sentence1": "I will have to try washing my chopsticks. This restaurant it like in a hotel ballroom? Parking is limited so keep your eyes open for any spots. \n\nThe food is tasty and a bit greasy. They do apples and mains. Some dishes are on the smaller side but since all tables are for groups of ten or so, dishes are to be shared. \n\nThe power went out during our visit but that's due to the strong winds. \n\nNot a bad place to eat with fam. Food came a bit slow but otherwise tasty.", "label": 3}, {"sentence1": "Guess if you're looking for unique gifts, this could be a place to buy these yarn-made stuffed animals or what have you, for $15 a pop, it better be a good friend.\n\nFrankly, the name scares me but guess it's catchy and quite popular, there are waiting lists for certain characters.\n\nFriendly service.\n\nlocated 2nd level at Aberdeen Centre.", "label": 3}]