[{"sentence1": "I was not impressed. DBA seemed very much run-of-the-mill. Being a fan of good BBQ, this place seemed kind-of mundane to me. Staff was nice and friendly, but the food was simply mediocre.", "label": 2}, {"sentence1": "Used to be a go to place for us regularly when the kids were little but we moved away. Decided to try it again on 2 occasions and was terribly disappointed. The staff is friendly but they just can't seem to get the orders right. Daughter has allergies and some simple modifications come out wrong. We ended up waiting on extra 30 minutes, everyone finishes their meal and the order them comes out finally right. There are so many Tex Mex choices, we will try some other places.", "label": 2}, {"sentence1": "Is Chuy's northwest getting too big for its britches?  If you go, expect to wait in line awhile--maybe outside--to enter this noisy, crowded, and for some reason popular spot. You'll get pedestrian, unimaginative TexMex served luke warm. Save room for the tres leches cake, which is good.  Prices are standard for this cuisine in Austin.  Service is usually good and fast.", "label": 2}, {"sentence1": "I got the Lemmy. It had Jack Daniels bbq sauce and onion strings.  I did not care for the burger at all. Way over cooked. It was almost as if it was par cooked before they grilled it. It was dry and rather unpleasant. The bbq sauce was very tasty. I probably wont be returning. I like juicier burgers then they serve up here, especially for the $7 price tag.", "label": 2}, {"sentence1": "I was very disappointed with the customer service we had here. Husbands wristband wasn't working correctly and they called a helper over with a iPad. After spending 15-20 minutes showing her we paid for the tickets with email receipt and even asked for the credit card we used to pay for them. She couldn't get her work id/password correct to sign in and was acting annoyed to help us. This was the first time I have been disappointed by service at a Disney Park.", "label": 2}, {"sentence1": "Staple for mediocre pan-Asian food. Don't expect anything other than mediocre. Fish might not make you ill, but the cuts are not done expertly and the fish can often taste fishy.\n\nIf you order a side of sticky rice, it'll actually just be medium grain rice that's gelled together in one solid clump. Costs $2 for probably 3/4 cup of this gross rice.", "label": 2}, {"sentence1": "Simple: you come for the view and not food or drink. I ordered a vodka cranberry and it tasted like a margarita.\n\nAlso, the food tasted generic, nothing too great. To me, this is a one time place.", "label": 2}, {"sentence1": "Honestly...not a hot ticket- free pool, and that's it.  It's like going to a hick bar, but there aren't any hicks.  It's been years since I've been there.  There's a reason for it. Yo.", "label": 2}, {"sentence1": "Why does it take so long to get a tea here? Thought the first time was a fluke but the second time around the guy could not be any LESS interested in what he's doing.", "label": 2}, {"sentence1": "the people at the front desk were so rude, this one woman was in a bad mood and was talking to us with a tone like we were bothering her. Very bad customer service when I was asking a simple yes or no question. :(", "label": 2}, {"sentence1": "I needed a quick fix one day in Southie: Fish'n Chips!\n\nBut to my dismay, my experience at the Beer Garden made my cravings worse.\n\nThe customer service was abysmal (it took the waitresses about 15 minutes to serve us water), and they never refilled the water after that. The waitresses seemed more interested in the Sox game than getting their tips.  I would give this place a 1 star if the fish'n chips weren't good, but they were actually decent.", "label": 2}, {"sentence1": "Came here on a Friday night, but they weren't that busy. Service was terrible. We waited 15+ minutes to even put our drink order in. We had our daughter with us and put in an order for her with our drinks. It did not come out until our food did. \n\nTexas Frozen Margaritas were not good. Maybe our expectations were too high due to moving here from Texas. \n\nWe won't be back. Don't have the patience to put up with horrible service and mediocre food.", "label": 2}, {"sentence1": "I'm not sure when it happened, that a fast food place can be not so fast, and expensive.  The food is usually pretty consistent, but to run out for a quick bite at lunch and spend $10 for a burger & fries is a little crazy.\n\nThis location gets pretty busy, and the drive through is painfully slow.  But, once you get your Sweet Potato Fries, Onion Rings, or great shake, it makes it almost worth the 30 minutes it took to get them.", "label": 2}, {"sentence1": "I went there for dinner & had the chicken, mashed potatoes, and green beans. I agree with the other reviewer that said that it wasn't that spectacular for \"home cooked\" food. I think I missed the boat- I probably should've ordered breakfast, which looked fairly good on everyone's table.", "label": 2}, {"sentence1": "Completely disappointed the pinwheels were taken off the menu! It was the best item on the menu and honestly the only reason why I would order from here! Bring back Pinwheels!", "label": 2}, {"sentence1": "This place was fun due to what CNN has done over the years.  Since this was a weekend there wasn't much going on so we did not get to experience what CNN has to offer.  It is fun to see what goes on and the history but suggest going on the week day and purchasing a bulk pass because this tour isn't worth the 15 ish bucks.", "label": 2}, {"sentence1": "This is a great spot downtown in an area with limited food options! Very cool lobby, impressive drinks, and lots of grabs and go options for lunch. There's also plenty of seating and free wifi if you're looking for a place to work or have a meeting.", "label": 4}, {"sentence1": "American and pub fare close to MGH and Beacon Hill. Spacious bar setting, with a good selection of whiskeys and beers. \n\nNot a huge fan of the dinner selections, which are fairly unremarkable, but the quality of the brunches are great. I especially recommend the hash (see pic), which has generous portions of meat. The over easy eggs were perfect too. \n\nPrices are very reasonable, both for food and for drinks.", "label": 4}, {"sentence1": "Classic diner food taken up a notch.  I have heard this place is always crowded, and now I know why.  The food is DEE-licious.  I was craving a classic cheeseburger and fries the night I went, but I would love to go back for one of the entree dinner specials which change each night (chicken pot pie!).  Service was great and very accommodating to my friend who had specific dietary restrictions.  They even prepared an entree gluten free for her, although it is not listed on the menu.  Thanks Cap City.", "label": 4}, {"sentence1": "Interesting and different! Great atmosphere, nice but not too fancy. Food was good and service was attentive. I like that the owners are circulating with the diners, instead of being in the kitchen. \n\nWife had the duck and it was the best that we've ever eaten. Tasty and cooked to perfection. \n\nI had the ribeye steak and was a bit disappointed it wasn't thicker for $27. \n\nI like to frequent restaurants where the owners are right there taking care of business. \n\nOverall it was a good experience and I would go back and enjoy another evening. Thanks.", "label": 4}, {"sentence1": "Super laid back and chill spot to grab a bite to eat and some happy hour drinks! Happy hour is from 5-7 and the food options they have are awesome! There is live music and a bunch of indoor and outdoor seating. It can get packed so make sure to get there earlier for happy hour. Prices are pretty decent and the staff was very welcoming and nice. Definitely recommend!", "label": 4}, {"sentence1": "This pizza is great! The crust is very thin so you must like thin crust pizza. I always get the eggplant because it is just so good. The eggplant is cooked but not fried. They have fast delivery and its a good deal for pizza. Would love to see what happens if the egg plant is fried, I bet it would be awesome! Great place to grab pickup/delivery. Convenient location.", "label": 4}, {"sentence1": "Good burger and the fish and chips were excellent.  Very nice selection of beers!", "label": 4}, {"sentence1": "I dragged my husband out (that's funny if you know him) to go bar hopping and find 3 secret bars. This was one, very cool. Next time out of towners  come visit we will definitely do this again. This one was the hardest to find.", "label": 4}, {"sentence1": "The sweet potato sushi is my favorite. Good prices for fast food sushi. Since I'm vegetarian I order from the menu so I don't have to wait around forever for options to circle around me.", "label": 4}, {"sentence1": "My husband and I had not been to Red Lobster in at least 4 years. We were both pleasantly surprised. We ordered the calamari app and it was huge.  Came with lots of fried broccoli and red peppers.  We shared a broiled seafood platter and the seafood was wonderful. \n\nService was great also.", "label": 4}, {"sentence1": "Wonderful pizza!  Me and my girlfriend decided to randomly stop by here last night while walking by.  Glad we did.  Great pizza!  Helpful staff!  \n\nDefinetely got to go back for a sit down dinner!", "label": 4}, {"sentence1": "I really wish I lived closer so I could come here more often! The flavors are really rich and flavorful, and the employees are very  friendly. The restaurant has a great atmosphere- it's a nice place to go and relax and enjoy a great dinner with family and friends. It is a rather small place, so try and make reservations if possible. We last went there with a group of 8 and they were excellent to us!\n\nI have been there for both lunch and dinner and would highly recommend it.", "label": 4}, {"sentence1": "Amazing thrift shop. They only take cash but there's an ATM there so that comes in handy. There's good brands there such as polo, true religion, coach, etc. There's sales every single day, it's determined by price tag colors. The people that work there are friendly. There's NO DRESSING ROOMS, so you have to use the bathrooms or you can try things on over your clothes.", "label": 4}, {"sentence1": "I've tried quite a few Chinese places around the Boston area and in Revere, Happy Garden is by\nFar the best! From the outside.. and even the inside, it doesn't look very appealing or inviting but it's a Chinese restaurant, they usually don't! The food however is great! Their lo main is especially good! I've tried several dishes from sweet and sour chicken, general tso's, beef and broccoli, fried rice, all great! Will be back for sure when I get my next craving for good Chinese!", "label": 4}, {"sentence1": "Good for McMenamin's!  Small place a little run down on the inside but they have a great patio area with fire pit and tables.  My favorite place to go in the summer for Happy Hour.\nGreat Cajun tots and HH prices.  They even have good service and I wouldn't say that about most McMenamins.\nGood little local place.", "label": 4}, {"sentence1": "Came here on a Saturday morning, 10:30am.  Not busy yet but the dim sum is pretty good and customer service is great. :)\n\nKids love it too.  It is a little pricy but fed the craving until we go back to California.", "label": 4}, {"sentence1": "St. Mary would be appalled by the hypocrisy at Marist. If you're looking for a Catholic school that promotes honesty, truth and other basic Christian values, look elsewhere.", "label": 1}, {"sentence1": "This review is not based on the quality of the food at this establishment, nor the quality of customer service. It's based on the issues Chipotle continues to have with their online ordering platform, and this location. \n\nThree times I've tried to make an online order and there has been a massive technical glitch. I know Chipotle has gone through a rough few years, but they shouldn't offer an online ordering service when it's going to constantly crash/not work right. \n\nHope they can get it right sooner or later.", "label": 1}, {"sentence1": "Worst Crown Plaza I have ever stayed in the world. Old fashioned decoration and noisy AC system.\nThe double tree hotel next to it should be so much better. I am very regretful picking up Crown Plaza hotel for my trip to Austin", "label": 1}, {"sentence1": "I brought in a pair of boots for them to fix, and the lady there said she wouldn't even attempt to do anything because it would be \"a waste if her time.\" plus, the only parking option is the garage...the sign said it would be free if it was less than an hour. I parked for less than 5 mins and I was charged $5. Going there was a waste of my time and money. There are many other options in Decatur and I would recommend you try those first.", "label": 1}, {"sentence1": "Fatcow has become one of the worst hosting companies to host your website with. Also the support is the slowest at responding to issues. The affiliate program is a joke and the do not pay. I have hosted over 20 sites with them and they have missed 5 payouts in the last 6 months.", "label": 1}, {"sentence1": "Paper plates to to go cups!! Catfish is nasty south side JJ's do it better!!! Food trash service hmmm it's ok!!", "label": 1}, {"sentence1": "Service  was very bad, no one greeted us at the drive thru, than i had to repeat my order 3 times tk the lady, Finally we i go to pay i ask her if everything  is in the bag she says yes. I get home my burger wasn't  made the way i asked her to and it looked  like they slopped it together fries were old. I will never go to this jack in the  box again.  Beware people of the jack in the box.", "label": 1}, {"sentence1": "Went to go to this location tonight (Saturday) at 7pm and all the lights were off and no one there. This place must be closed and out of business. Tried to call and no answer. Shame on poor business practices.", "label": 1}, {"sentence1": "We went there today, as it is across from the Portland Art Museum, which we were on our way to, to see the Contemporary China show. I ordered won ton soup, and the broth was what you might expect from \"Safeway's best\" top ramen.\" The won tons were tough and tasteless...kind of like grey questionable cafeteria meat. If they had a \"zero\" star selection on Yelp, this place would warrant it. It is one more reminder to try never to be caught without pre-planning of where the good options are.", "label": 1}, {"sentence1": "Now they are charging me full rent for the month of April, I told you guys this place is one of the worst places to live. Horrible business practices, stay away from renting here.", "label": 1}, {"sentence1": "DONT waste your money on this club. First of all, its 18+ so its mostly college kids. The crowd that is attracted by this club is towards younger and immature end. Secondly, they would charge insanely high cover charge and its cash only. There are two floors and they will fail to tell you when you enter but than try to charge you separately for both. The place is not even close to being good enough for the amount they charge.", "label": 1}, {"sentence1": "I will not be back to this store again. Customer service is awful and they never have what I need in stock. I understand the pandemic we are in but to be rude and shut the door on me because I don't have a mask is unacceptable. Meanwhile 2 people in the store were shopping with NO MASKS!!!! Must be friends of the rude worker", "label": 1}, {"sentence1": "The service department seems so understaffed and stressed out every time my wife and I require service.i would say the service level is not great and though I have bought my last 5 cars there I don't think I would buy there next time.   Love my Honda but maybe time to find a new dealer.", "label": 1}, {"sentence1": "Owner is a greedy and cranky man. \n\nUsed to go there before and the food was good. Now, in typical fashion, they think their customers are idiots. \n\nThey stuff the food full of cheap onions and peppers and so little meat you have to go searching for it. \n\nWhen you complain, this owner shouts at you, calls you names, makes excuses, and almost forces you out. Actually made me physically uncomfortable.\n\nDon't waste your time on this place. Find something better. Have some respect for yourself.", "label": 1}, {"sentence1": "Finally called in and was told my contract is over so I can get rid of this service! Stick with adt or someone who has been around. At&t's technician do not know what they're doing, you have to spend a 4 hour time period waiting for them to show up, they finally show at the end and take another few hours, problem is never solved, system is cheap, at least the lady I called to cancel the service was nice and knew what she was doing!", "label": 1}, {"sentence1": "My girlfriend went looking for dresses and was basically ignored, treated poorly I would definitely not recommend them", "label": 1}, {"sentence1": "My boss and I went in to eat, and between the two of us we tried the entire menu including daily specials... and everything, I mean everything, was absolutely incredible!", "label": 5}, {"sentence1": "This new place has cheap, good food with interesting choices (not boring but not wild either). The drinks are well thought out and delicious, and the atmosphere is cool. Definitely a perfect hang out spot, and the patio will be amazing in the summer. Awesome addition to Decatur .", "label": 5}, {"sentence1": "Hands down the best! Car looks and runs great.  The owner rob goes above and beyond for customer service.  Highly recommend this shop for any mechanical or auto body repairs.", "label": 5}, {"sentence1": "Great food and very authentic. They serve dim sum even on weekdays, just from a checklist sheet. They also have a photo menu of the dishes or easy ordering in case you don't know the names of your favorite dishes. Additionally, you can order from their regular menu.", "label": 5}, {"sentence1": "First time here on a whim. Ordered the tiramisu...wow, it was insanely good. A beautiful creation of milk ice, chocolate powder, couple of cookie sticks, capped with a delicious tiramisu cake. Found a new favourite dessert place. Finished typing this review only to re-edit when I spooned into a scoop of coffee ice cream!!! Yum!", "label": 5}, {"sentence1": "The Kona Coffee is great to get you going in the morning.  The Samoan is another great pick for breakfast.  Well worth the wait if they have a wait.", "label": 5}, {"sentence1": "Great non pretentious coffee shop.  Excellent coffee.  Good place to work and play games.  Manager Alex is a star.", "label": 5}, {"sentence1": "I'm in love with this place the flavors and textures are great and they never let me down ... only down side is that you can't reheat these up and enjoy the same experience . You have to eat it fresh and they always welcome you with a joyful scream . I'll keep spending my money here faithfully and every location because they have great customer service and outstanding food and everyone I would recommend that you go here", "label": 5}, {"sentence1": "I ordered the Cauliflower Rice with Chicken and was surprised by how delicious it was! The cauliflower rice had a great texture and I really enjoyed the peanut sauce that came with it. I've been to this location twice and it's been a pleasant experience both times. Despite some of the bad reviews I've seen I would recommend it.", "label": 5}, {"sentence1": "Omg the Reggie Deluxe is worth whatever arteries I'm clogging. Rich gravy, perfect chicken. And the shrimp & grits are fantastic!", "label": 5}, {"sentence1": "Amazing dinner tonight. Food, drinks, and wine were all excellent. Grilled cheese was amazing. Our server, Laura, and all support staff were incredible and professional. Service was so seamless and Laura was such a delight. Can't wait to come back!", "label": 5}, {"sentence1": "If you want to learn all you need to know about Nespresso, please ask for Kevin.  The passion and knowledge he has is impressive!  I highly recommend him if you are like me, a very noob to the Nespresso world.", "label": 5}, {"sentence1": "After having some super entitled rude service at dinner and a super long line at the neighboring ice cream place, we stumbled upon this gem. The owner waited on us and was  down to earth and kind. I got a pint of the fruity POG. My friend got a pint of pistachio. The gelato is amazing! Beyond that, it's just refreshing to have some unpretentious, genuine service. Highly recommend!", "label": 5}, {"sentence1": "Love their biscuit combinations! The biscuits are so flaky and delicious and the flavor combinations are the best biscuit sandwiches I've had yet! When they're at the Portland State Market as well the wait can be less than their restaurant location - just get there early (right around 8 am!).", "label": 5}, {"sentence1": "Kenny and staff couldn't be nicer.  Prices are fantastic.  Staff is honest, does what needs to be done, doesn't over charge, doesn't over sell.  I wouldn't trust any place else and I wouldn't go any place else.  I know I will be taken care of at Kenny Hill's.", "label": 5}, {"sentence1": "Eat sh#! and die Jamba Juice! Juice land is the holy land of juice and smoothies! Unlike other chains who sell lies JL sells high quality smoothies and juices.", "label": 5}, {"sentence1": "Loved appatizers. Food is tasty and fresh. Waiter was very helpful and knowledgeable.", "label": 3}, {"sentence1": "Definitely not the best place in the North End. But (or therefore) you get seated quickly. This place made me laugh quite a bit, first at the oh-so-awkward-but-still-endearing waiter, then at the ceiling painted like the Sistine Chapel. \n\nThe bread was underwhelming, a taste of what the rest of the meal would be like. Bland shrimp scampi, bland bland bland. In fact I probably won't remember it in a week. \n\nBut hey, one great thing is that it's close to Mike's Pastry!", "label": 3}, {"sentence1": "i pretty much dig this place....$1.00 taco tuesdays are killer. Only complaint is they try to sweep everybody out and probably close too early. 11:00pm during the week would be great.", "label": 3}, {"sentence1": "This is the most modern location of Cha Cha Cha yet, including a Hot Adult Contemporary soundtrack instead of Spanish language music and features a nice patio area. \n\nFood at Cha Cha Cha is affordable and okay, depending on choice. \n\nI still find Mi Mero Mole has a better offering in this price range and better service.", "label": 3}, {"sentence1": "Good Ambience. Good Tex-Mex food but a bit on the expensive side. Mexican Martinis are a must try!", "label": 3}, {"sentence1": "Service is terrible!! Ice cream is mediocre, and it takes way to long for them to serve you.  I know it us run by nee people but nothing great about it. Also if you decide to go inside to get your ice cream the place is always dirty!", "label": 3}, {"sentence1": "My burger was good and my coke float was great. I was disappointed with the onion rings they were similar to shoe string fries. My husband liked the full bar but I wouldn't make a special trip back.", "label": 3}, {"sentence1": "Every thing needs gravy, Or sauce. It's all just too dry. Or maybe a fresh egg with yolk to ooze on my dry but yummy biscuit. Could easily be better, but still good.", "label": 3}, {"sentence1": "I don't at all understand this place... every rule they told us they had we then broke -- the owner/manager came in a whole bunch of times but never actually did anything but be pesky. The party rooms are by far the best bet -- it actually accommodated a party... the other rooms looked sort of beat. They looked like some hobo Japan that no one would want to hang out in, while the party room had ridiculous neon glow-in-the-dark murals. Get your money's worth and bring a crowd.", "label": 3}, {"sentence1": "This place was a staple pho restaurant for us for many years, but after discovering some new places, it doesn't compete. The food is pretty good, and the imperial rolls are fantastic, but compared to other places, their flavors are underdeveloped. My favorite dish, Bun Bo Hue, is okay but the noodles and broth are barely flavored compared to the same dish at Boulder Pho. It's a nice enough place, and fairly cheap, but it's not great. I have sensed a change recently in their flavors, and it's not as good.", "label": 3}, {"sentence1": "I go here for the vegetarian dishes. The food is great and the atmosphere is nice. However, the service is pretty terrible sometimes. They sometimes ignore you for long periods of time.", "label": 3}, {"sentence1": "Upscale pub food! Delicious food and cocktails and the price was right! Had a nice dinner here with my husband while we watched the Celtics play! A few TVs with different events on so you could actually watch multiple sporting events.", "label": 3}, {"sentence1": "The pizza isn't bad... I got 2 18 inch cheese pizzas, they are 15$ each. It was over cooked so the crust was very crispy & dry (cardboard like)...The sauce is okay and the cheese is too. I must admit i don't usually heat pizza in the microwave but this pizza tasted better after i heated it up a few hours later. It made it softer, juicy & foldable. This pizza wasn't memorable. They really need to work on their crust! I'm still looking for a great NY style pizza place here in Marietta/Smyrna!!", "label": 3}, {"sentence1": "What the hey...this place is nothing but an outdoor mall. Underarmor, Coach, Sephora, and the LEGO store scattered amongst mediocre restaurants. The Rain Forest cafe is actually cool with an erupting volcano and fire show. Also, there are very (I mean very) large LEGO displays. Unfortunately, the scene does not scream Disney. No Disney characters (dwarfs, princesses, or beasts) and no Disney Magic. Nevertheless, it is worth a quick stroll, but set your mental bar severely low so you are not disappointed. Also, the only coffee you can get is Starbucks and it is awful.", "label": 3}, {"sentence1": "The small portion entree is enough for one person and the price is right! I think my dinner was $5 and I barely finished it. My wife got the Beef lo Mein and said it was above average (7 out of 10). I had Pork and Broccoli that ok. Pork was tough to chew, but the rice and broccoli was delicious. (6 out of 10)\nOverall I would say its a good value for what u get.", "label": 3}, {"sentence1": "the service here was good. the beers were basic. \n\nuhhhhhg i never wanted to be this craft beer snob but its happened! i'm sorry rogue.", "label": 3}]