[{"sentence1": "I'm not sure what the hype was about this place. Visited family in Vancouver May 2018 stopped here - it's run like a fast food joint. You can pick your toppings. But the pizza dough was not cooked all the way, the overall taste pretty boring", "label": 2}, {"sentence1": "I want to like Don Pepe so bad. The steak and bacon and pork mix they do is the bomb. The pictures of caballeros on the wall and history is SO cool, but the service is so horrendous. Nice people, but woefully unorganized. Super Torta up the hill. Sorry amigos.", "label": 2}, {"sentence1": "Not to sure about this place. First was ok. 2nd the dude almost gave me a Mohawk... won't be going back here.   Nice people but need to work in barber skills.", "label": 2}, {"sentence1": "The background music that plays during weather and traffic reports is so very annoying.  (The traffic person talks way too fast.)  The drums/music plays at the beginning and ending segments of Herman's show.  The so called music sounds like it's on some teenage program.", "label": 2}, {"sentence1": "Slowest car wash ever.  It's about 7 minutes per car.  I know, because I had so much time to think about it.  Say, you get there, and there's one car in the wash, another waiting to get in, and then your car.  You're not getting out of there in less than 20 minutes.  \n\nAnd, the quality of the wash?  Meh.", "label": 2}, {"sentence1": "Been here twice now for my 3 year olds blood draws. Both times they were over 30 minutes late and both times we had scheduled online appointments. They never sent the results to my doctor the first visit and I had to call multiple times even though that information Was provided at the time of the visit. The actual phlebotomist did a great job with the draw both times which is super important when it's a child. The wait is not good for kids. It gives them time to freak out!", "label": 2}, {"sentence1": "The first time I went to this place was during SXSW to catch some bands.  The staff at Beauty Bar was not too friendly to outsiders/ non-regulars then and the experience was the same when I went on a regular night.  Most places downtown have a $10 minimum for credit cards.  I have no clue as to why its $20 there because unless something really special was going on (like the Photobooth Bar Crawl) I wouldn't be in there long enough to fulfill a minimum bar tab.  Just not my scene at all.", "label": 2}, {"sentence1": "So their sushi is amazing, if you are only going for sushi meaning you don't care about service or ambiance and you want great sushi, this is your place.  With that said their service is terrible, I've been there twice and man each time the servers were just flat out rude. Others at my table noticed that too.  If their service matched their sushi they would have 5-stars but their service really changes the experience.  Great sushi, I can't say that enough.", "label": 2}, {"sentence1": "Peaceful used to be our go to place for Chinese food. Since expanding to so many locations the quality has really deteriorated. The food was fast but the service was amusingly odd/lacking. The food has also seems a lot greasier and less flavourful than it used to be. I find I don't feel very good after a meal at peaceful anymore- too greasy! We're  on the hunt for our new go to place and will try to remember to stop going here!", "label": 2}, {"sentence1": "Poor customer service. For a yoga place is was very unwelcoming. Class was a good workout but there are too many yoga studios in the area to want to go back to this one. The bad attitude of the yoga instructor ruined the whole class.", "label": 2}, {"sentence1": "The customer service does suck, unfortunately. The foods/drinks are overpriced. But I did enjoy the games. The bowling alley is not a legit alley, but it is fun. We had technical difficulties with the karaoke room. At first, because we had to wait to be assisted with mics, then with getting the music started.. Within 20minutes of singing, a mic died because staff didn't have them fully charged. Ha, it was tragic. But the plus was we didn't pay for karaoke or the other games.", "label": 2}, {"sentence1": "Liver and onions were great but my husband's meatloaf was so hard you could barely cut into it. The restaurant was not full yet we waited half an hour for our food. We were given a coupon for a free pizza (for the bad meatloaf). but not sure if we'll return!", "label": 2}, {"sentence1": "Funny service--\nLong wait! 10 min in line and another 30 for a sandwich. It would've been ok if the people behind us weren't served food before us. \n\nFood--\nExcellent fried tomato n chicken.  Baking soda tasting biscuit. Generic blue cheese dressing. Wish they served it on the side.  Fried tomato too small to impart any flavor.  The wedge sandwich was overwhelmed by the cheap tasting salad dressing.", "label": 2}, {"sentence1": "As a child in New Jersey, I visited Dunkin my fair share. But I don't really understand why east coasters are so passionate: while the simple coffee is pretty good at a good value, everything else on the menu is an also-ran, and service at least at this location is right on par with a fast food crew yet trying to make more complex orders. (The building sure is nice though!)\n\nDonuts compare unfavorably to Krispy Kreme and LaMar's, while the cappuccino beverages are comparable to those at McDonald's .", "label": 2}, {"sentence1": "I just left this location and was very disappointed. Not only did they get my order wrong twice. There was also hair in my food.Disgusting !!", "label": 2}, {"sentence1": "Pizza was rubbery. Looked like something you would buy in freezer section at supermarket. Overloaded with basil.", "label": 2}, {"sentence1": "Their Pad Thai is absolutely delicious!!!  Quick service.  Reasonable prices.  Not much seating during the busy lunch hour but most people just get their meal for take out.  The only down side is that it's cash only.  The food is fresh, hot, and very tasty!  I go there on the regular!", "label": 4}, {"sentence1": "Stopped in for breakfast.  Very very good---got fluffy eggs on a nice piece of toast with prosciutto on top.  Everything was fresh and presently nicely.  Would definitely go back for breakfast.", "label": 4}, {"sentence1": "I thoroughly enjoy the food.  For Valentine's Day they added rice pudding to the menu,  the rice pudding was excellent.   The shakshuka was good,  but the side of sausage was a little on the small side.   The eggs were soft poached,  the whites slightly runny,  so personally I would request eggs medium next time\n\nThe tales are cleaned promptly,  noise level is fine,  the staff friendly and accommodating.   A very pleasant meal.", "label": 4}, {"sentence1": "For $5 this place is great, even if the reptile area was closed for a class on the night I got there. I got to see all the cool things a person can hope to see.. fiji mermaid, bigfoot footsteps, a hairy fish, shrunken head.. awesome! Totally put a huge smile on my face. The person working at the register was really nice, too (like everyone I met in Austin). \n\nIt is little, but packed with cool stuff, and for $5, you shouldn't expect to be in something giantic, anyways.", "label": 4}, {"sentence1": "I went for a couples massage with my fiancée,  we were pretty satisfied,  would have love a bit more pressure on certain areas,  but overall it was a great experience,  the staff was very friendly and the place was clean and followed all covid-19 regulations.", "label": 4}, {"sentence1": "I got the vegetable biriyani and chicken vindaloo for takeout, and both were great. The vindaloo tasted a tad more tomato-y than I was expecting, but I still really liked it. Prices are pretty good considering the portions you get - those two dishes turned into four meals for me. I'd like to go back and try some of their other dishes. I also wouldn't mind dining in - I picked up my food on a Saturday night, and the place was almost empty.", "label": 4}, {"sentence1": "Nice place. Tried on a friends recommendation. I tried the BBQ sandwich and my friend got the BLT. Both were delicious. No complaints or the flavor or quality. \n\nIt is a little pricey for the quantity of food you get though. I paid almost $14 for a medium sized sandwich and a few chips. For the price they could be a little more generous with the sides/portions. \n\nTry the lemonades. The flavors are great and unique. \n\nLastly, customer service was ok, not great. But it was only one visit. I will go again and try other things.", "label": 4}, {"sentence1": "So I've been going to Tsubaki for a hair trim for over a year now.  Everytime I asked for Yuka. She is great and her english has definitely improved.  Today, I went in for an actual cut.  I showed her a few pictures and she did a great job.   I would totally recommend Yuka if you want to try out Tsubaki.  Just make sure you have a pictures in mind.", "label": 4}, {"sentence1": "In Vancouver for the night and dropped in to watch the Canucks game. The place was packed and the atmosphere was great. The bartender took our order as soon as we sat down. Had a few drinks and an order of fries, the fries were good! Appreciated the quick service, especially on such a busy night.", "label": 4}, {"sentence1": "The concierge at our hotel recommended this place for lunch and it was great. My friend and I each got the pad thai, mine minus the shrimp and it was delicious. We both also ordered a spring roll and it was crisp and piping hot. Great service, great food, glad we chose this place.", "label": 4}, {"sentence1": "Love this place!  Pizza is always good and service ti great!", "label": 4}, {"sentence1": "The wine selection is nice and the tropical screens on the wall help make you feel you feel more relaxed and mellow. I  was hoping for a port option which they didn't have but the blueberry desert was amazing! Nothing like I've ever had before. The staff was very friendly and made the place more fun and lively. Pricing is reasonable, service was good with a medium full bar, and selection is nice. Great spot in a great spot.", "label": 4}, {"sentence1": "We have been a couple times for both the pizza and pasta. The tagliatelle was good, as well as the margherita and diavola pizzas. Prices are fair and the service was excellent. We would recommend and will be back.", "label": 4}, {"sentence1": "Nice selection but not as extensive as REI. I found the staff to be aloof too, except for two who offered help and were knowledgeable.", "label": 4}, {"sentence1": "Good food. Seemed to be pretty fresh.\nWaitress was great and very attentive. \nWould recommend for a low key dinning.", "label": 4}, {"sentence1": "28Aug19 @ 11:45am\nGrocery store with lots of take away food items.\nThere are a couple of small tables in the aisle by the  butcher counter.\nWe had the chicken gyro at the food cart and the ham sandwich inside st the deli counter.\nThis place has lots and lots of good looking food.\nHuge selection of sausage.\nHuge selection of bulk grains and such.\nThe sandwiches were average; okay but not great and the pepper jelly soaked through the Dave's killer bread slices on the ham sandwich.\nThey do not scrimp on the fillings in the sandwiches.", "label": 4}, {"sentence1": "Worst customer service ever! Manager and employees only care about selling parts and not the customer.  Go to advanced auto down the street for A+ service, and better pricing!", "label": 1}, {"sentence1": "Stay away!!! The food is gross and service is terrible. I can't believe we waited 45 min and paid for such a terrible meal. We have been to manny's many times, at least 30-40. The best is Haines city. We were excited to have one closer. That excitement died when we got our meals. 4 different plates (meals), each worst that the other. And the service horrible. They weren't even busy, it was a Monday afternoon. Save yourself the disappointment. To many options for a good dinner, Never going back.", "label": 1}, {"sentence1": "Horrible customer service by \"Danny\" at the Bridgeport Rmd store on Jan11th, 2021 at 7pm ish.  He does not want to help me with an opened order that I had placed with another sales staff.  Normally all the staff at sleep country are great with client service.   Go to another store such Cambie/Marine instead.   Hope the Regional Mgmt (Tina Christidis) will take appropriate action with Danny as it will hurt your brand.", "label": 1}, {"sentence1": "After waiting 20 min I was asked what type of henna I wanted then immediately told the artist wasn't there.  I called earlier and asked about the service, they told me it was available until close. Now that I've arrived conveniently I was told it could be done", "label": 1}, {"sentence1": "I'm sorry, Mr. Indian waiter, but you disappoint me.\n\nI didn't even get your name because you didn't introduce yourself, but the fact that you were unaware what a \"Gin Rickey\" is, and informed me that you could not procure one for me from the bar because you didn't \"have the stuff to make it\" made me cringe.\n\nI love Abe and Louie's, but you, not so much.", "label": 1}, {"sentence1": "Skip it --- unless you like being sold reward program from the moment you walk in the door until the moment you leave, don't mine wait staff who don't listen, etc\n\nLots of other choices for restaurants in this area -- I'll skip this one in the future", "label": 1}, {"sentence1": "Very unfriendly staff, especially if you bring your kids to the store.  Dirty looks and all.  Clothes are nice, but not worth the sour expressions from the staff.", "label": 1}, {"sentence1": "The worst. Tried to get a beer here before a movie tonight. The bar had four people sitting at it, all with drinks already, yet the three people working there totally ignored us for ten minutes, then finally (very rudely) told us they wouldn't be able to get to us for another ten minutes. We said we were just looking to get a beer and they said it didn't matter, we would have to wait. So we left. If you're going to be terrible at your job, at least be nice to people.", "label": 1}, {"sentence1": "If I could get it 0 stars I would. I got the normal teriyaki chicken lunch special with the egg roll. The TO go container had dust all over it and the chicken was pink. We asked for water, the owner brought out 2 cups and the cups were half full with dust all over them. We had to go to subway to get drinks. Absolutely disgusting, don't waste your money. \nPlace looks dirty and tastes disgusting.", "label": 1}, {"sentence1": "Got food poisoning from undercooked fish here last night and spent the whole night feeling like death. They were understaffed and rushing to get food out, the business  clearly needs to consider hiring more people and training their chefs in food safety. I do not intend to bring my business here again.", "label": 1}, {"sentence1": "If you want good service and good Italian food, go elsewhere!!!!!", "label": 1}, {"sentence1": "Worst service ever, reps lie about features. Will never go back.\n\nDon't buy the Fry's warranty, it's worthless.", "label": 1}, {"sentence1": "Ordered takeout from Pannullo's because the pictures looked authentic. The food is not. They laid two over-cooked italian sausage links on a bed of dry penne pasta with a glob of red sauce that can only be described as thick stale dark red Ragu. Very disappointed.", "label": 1}, {"sentence1": "This is a meat-head gym!  This gym sucks & I have been a trainer and fitness instructor and worked in many gyms.  Unless you are a meat head - don't even bother.\nAlso - beware - after your year membership they will continue auto deducting from your account even AFTER you have requested membership cancelled. Make sure that the membership is cancelled and get copies of paperwork and WATCH your bank account!!", "label": 1}, {"sentence1": "I have long raved about the two Sushi Hana locations in Tigard, OR. But this place pales in comparison to those two. \nNothing seems properly refrigerated, therefore your sushi is lukewarm. Some of my favorite items on the menu at the Oregon locations are not offered or made entirely different (not better either). Always forgettable service. Can't say i'll ever be visiting this disappointment ever again but I do highly, highly recommend the two locations in Tigard.", "label": 1}, {"sentence1": "Was going to give them another shot as I'm feeding a few dozen teenagers today. After seeing their rude and accusatory response to my experience with them, though, I'll spend a couple hundred bucks on pizza from somewhere else.\nGood job shooting yourself in the foot.", "label": 1}, {"sentence1": "Thanks, Yelp, for finding a great window tinting business! Customer service was 100% fantastic and at no point did I have any questions about what I needed done to my car. I called and made an appointment a few days prior, and on the day of, showed up, dropped my car off and, at the end, even got a complimentary t-shirt (thanks to the Yelp check-in). \n\nI can't say enough great stuff about Orlando Window Tint Specialists. They definitely deserve all 5 stars!", "label": 5}, {"sentence1": "Their ice cream is seriously good. The flavors are amazing and you can choose what kind of milk they use to create it. You also get to choose mix-ins (sprinkles, Reese's, almonds, fruit, etc) similar to coldstone, but for much cheaper. They make your ice cream in front of you. \nThe small size is plenty and I'm satisfied afterward. And their Taiyaki? Wow. Crispy on the outside, soft and sweet on the inside, with the filling of your choice. \nThis place is definitely worth a trip out to try. Delicious.", "label": 5}, {"sentence1": "This location gives stripes reward members free chips and salsa!  Plenty of other location don't (UCF is the worst).  Have come here probably 20+ over the past couple years; service, food, and price point are always very good.  On the rare occasion something didn't come out as I had hoped, the server and manager bent over backwards to make it right for me.  Even though this is near the mall, this is not a crappy tourist spot.  Would highly recommend over the typical 'mall food'.", "label": 5}, {"sentence1": "I just had Royal exteriors replace 17 windows and a sliding door with triple panes, for 1/3 the cost of double pane quotes from the big name companies.  Dave Thomas is knowledgeable, professional and courteous, and doesn't play games about price or product. His crews were great and cleaned up their messes afterward. I can already feel the insulation difference in my house, besides they are just beautiful to look at.  And, because they're triple panes I get over $1,000 dollars back in energy rebates!  I highly recommend them for any size project.", "label": 5}, {"sentence1": "So happy this place is FINALLY open!\n\nI totally enjoy the atmosphere and although there is not an official dress code enforced yet, you do want to dress to impress the impressionable.  lol\n\nThe food is good and the prices are reasonable.  Drinks are reasonable as well.   The waitresses....well....depending on where you are seated, you might feel neglected if the place is crowded. (Sorry Mike but this is true!)\n\nThe restrooms have attendants that cater to your needs as well.", "label": 5}, {"sentence1": "This place is really great. Serving both Thai food and Japanese food, they excel at both cuisines. One of the few places in Portland that you can get great sushi and great pad thai in the same place. The Japanese small plates (especially the ebi yaki and the okonomiyaki tot) stood out to me. They also have a really good tea selection and their green tea alcohol drink is amazing.", "label": 5}, {"sentence1": "Great family owned place.  They are very friendly when I bring my kids there.  And naturally the gyro's are great!", "label": 5}, {"sentence1": "I like the sushi pizza and the sushi sashimi combo.  Most reasonably priced good fresh fish I've found.  Convenient location.", "label": 5}, {"sentence1": "Absolutely without a doubt my very favorite place for Pizza. The slices are huge, delicious, mouth watering with a crisp crust & served hot. They have plenty of room to eat inside or stop or call & pick it up to take home. They serve some additional items such as salads and staff is friendly & always smiling. You won't believe their amazing prices.", "label": 5}, {"sentence1": "Went here recently, it was amazing. Great ambiance. Would recommend to anyone.", "label": 5}, {"sentence1": "Jenni did a great job. I am not too picky with my haircuts but I know what I like and I know when it comes out well and when it does not. She spent the time to get every single strand from my previous haircut disaster and it was much appreciated. I will return and would recommend this to anyone for a quick and clean experience.", "label": 5}, {"sentence1": "This is great casual vegan food. Everything is yummy. If I don't eat there once a week I have serious withdrawals. \nI've pretty much eaten through the menu, and have not a complaint. Everything is freshly made. You can taste the care put into the food.  \nAs a new business that opened very softly, I think they were shocked by the number of customers who have come in. They are in the process of adding more staff to handle the outpouring of happy veggie people coming in. Patience if you have to wait.", "label": 5}, {"sentence1": "Always a fantastic option for breakfast! It gets busy on the weekend so I always try to get there pretty quick after they open. Food is always prepared well and service has always been good. There has been an ocassion or two where the coffee or water is out, but it would be tough to keep up with the crowds; sometimes you just have to be a bit patient! :)", "label": 5}, {"sentence1": "Delicious pizza. We loved the salad too. And the fun artwork on the walls and tables. Cool place!", "label": 5}, {"sentence1": "I cannot think of how an airport parking could be of any better!\n\nImpressive for cordiality, service, price, reliability, and overall convenience.\n\nFrom now on this is my parking spot in ATL", "label": 5}, {"sentence1": "An allergen-free shelf in the bakery display, dairy and dairy alternative drinks, relaxed vibe, and really friendly staff. Great place to chat with a friend or get some work done. Not to mention, the staff are truly committed to service. I went in for a Turmeric Tamer (YUM) as they were closing. I was disappointed, but a server put down her smoothie and insisted on running in and making it. Her kindness made my Sunday. Great spot!", "label": 5}, {"sentence1": "It is an okay place.   Has good food. Service is so slow, and food takes forever to come out.", "label": 3}, {"sentence1": "More like 3.5 stars. \n\nThe burgers were great - the option of trading no bun for a side of fries (sweet potato!) was a pleasant surprise. And the side of cranberry chutney with the turkey burger was great! \n\nHowever, it was on the pricier side for a burger because if you want cheese, jalapenos, a different sauce than ketchup, you have to pay extra for it. \n\nI would go back if I had a burger craving, but not too often.", "label": 3}, {"sentence1": "Tiny expensive ice cream. But the ice cream is good.", "label": 3}, {"sentence1": "Fun store with lots of corky stuff, however significantly over priced on most items.   \n\n\n\nHas toys, books, whigs, costumes, small gifts, unorthodox cards and house wares / decor.", "label": 3}, {"sentence1": "When I go out to breakfast, it's almost always to this Bickfords.  The Baby/Big Apple is to die-for (bring your appetite)!  They have a good sized menu, and the food's consistently decent.  It's not a high-class place, it's quick eats.  If you have a large group, they can accommodate.  On the weekends they have a brunch buffet, which is pretty good.  I tend not to get it as it's $12, and I don't tend to eat that much for breakfast, but if you have an appetite, go for it!", "label": 3}, {"sentence1": "I loved the matcha snow! It had the perfect amount of matcha flavor and wasn't too overpowering. \n\nThe only thing that was a bit off putting when I came here was that there was a weird smell all throughout the place... it seemed like the air inside was stale somehow and there was no ventilation", "label": 3}, {"sentence1": "The food was okay we asked for bread and we were told it's in the oven. When we finally got it, it was delicious, but barely enough for the three of us. The service was quite slow. I'll assume that they were shot handed since it wasn't busy.", "label": 3}, {"sentence1": "Great food as always but our waitress was a hot mess! She disappeared for about 20 minutes. It's sickening when you're looking for your server. When our waitress finally emerged, I quickly asked for our check. I just wanted to get out of there.", "label": 3}, {"sentence1": "I haven't been to OMSI since their Star Wars exhibit years back...3 or 4 years ago.  But that was cool.  Overall, OMSI is great for little kids...and that's about it. It is nice that they have a theater on site, but considering the high price of a regular admission -- its hard to shell out even more for a IMAX movie.  The gift shop is actually not bad...with a good selection of cool stuff.  The laser music shows are horrible though -- so don't get roped into one of those things...ugh.  Anyway, great for kids -- but a little spendy.", "label": 3}, {"sentence1": "After hearing all the hype since this place beat Kane's I had to try it. I hate to say I was disappointed. I have to say first that the glazed donut was pretty good. But the rest of the donuts were mediocre at best and the coffee rolls were over fried and greasy.", "label": 3}, {"sentence1": "Really cool bar.  They have a lot of games set up to play such as NBA Jam, skeeball, and Jenga.  The times that I've been there has been a DJ there playing mostly Top 40 stuff.  There's outdoor seating, which is nice.  It's on the smaller side so as the night goes on this place tends to get pretty packed.  Prices are average.  It's a cool place to start your night but I don't stick around here for too long.", "label": 3}, {"sentence1": "My experience was 50/50. Food was good.  The location was very odd and the customer service could be better. They never refilled our drinks and never came by the table after getting us our food. Don't think I'll be back because there food is nothing special, I should have just saved my $25 and made my own eggs bummer.", "label": 3}, {"sentence1": "8 minutes of agony. Slow. Unorganized. Blah. \n\nIt looks worse than it is in terms of time. \n\nATL is notorious for slow slow slow.", "label": 3}, {"sentence1": "I ordered the beef lamb plate but sadly what I got was salad.  The sample falafel I got was excellent but does not make up for the fact that I did not get my order but paid the price I did for my order.  \n\nBuyer beware, check your boxes right afterward because they are very busy during lunch rush and you may end up with something you didn't want to eat at all.", "label": 3}, {"sentence1": "Handy just off the highway.  I got a donut (good,) a bagel (decent,) and a breakfast sandwich (sausage with English muffin, because they were out of biscuits, also good.)  Also an iced capp, because caffeine.\n\nFast service.  Reasonable prices (especially when you consider their bagels are just as good as Panera's, for 2/3 the price.)  Easy access.  Easy to eat in the car, or save for later.", "label": 3}, {"sentence1": "Three reasons I enjoy the Fountainhead:\nIt's a decent sized pub on Davie.\nIt has a great patio.\nThe beer is reasonable. \n\nThe Fountainhead is a standby for me when I want to grab a beer and don't feel like going to the Pumpjack, they have a decent number of teles to watch the game and a mediocre selection of beer. \n\nNot a huge fan of their food or service but I tend to go at busy, busy times.", "label": 3}]