[{"sentence1": "We may have ordered the all the wrong dishes, but ordering from the lunch specials, the soup was barely warm, the breading on two dishes was thick and soggy, and the cabbage in the twice-cooked pork was hard and chewy.  It is very rare for us to leave leftovers, but all three of us did this time.  Maybe the dim sum to order is their strength.", "label": 2}, {"sentence1": "Not great. Food was GREASY. Now, I know, I know... Chinese buffet = greasy. Duh. But this was just kinda ridiculous. Crab Rangoon is supposed to be crispy, right? It was not. And it was freshly brought out! Staff was a bit rude and we pretty much had to flag someone down to re-fill our drinks. \n\nThe sushi was decent and tasted fresh. \nStill...Methinks I won't be returning.", "label": 2}, {"sentence1": "We bought a 2013 BMW with 19,000 miles on the car here in November of 2016.  The salesperson was wonderful his name was Joe.  However since we have had the car we have had to have the whole steering column replaced at the end of December and now we just had to spend $1000.00 to have new tires put on and an alignment.  I don't understand how a car with 19,000 miles on it could need so much work.  I will never buy a car from here again and if you are smart you won't either.", "label": 2}, {"sentence1": "Husband went here for lunch with a friend.\n\nFood:\nPretty average at best. He order the piri piri chicken w/ collards and mash potatoes and bread. Overall the entree and sides were just ok (2/5). He also had cornbread and a biscuit (3/5), which was the highlight.\n\nAmbiance: \nOld school diner vibe. \n\nService:\nHis waiter was friendly and checked on him frequently.", "label": 2}, {"sentence1": "After being in Austin for almost 8 weeks I really needed a pedi. Came here today and the lady that did my nails didn't clean up the nail polish on my skin, and didn't do a top coat!! I paid 48 with tip not exactly worth the cost since I had to go home and clean up around the nails and add top coat:-( I do better by myself and next time I want to be pampered I will go somewhere else.", "label": 2}, {"sentence1": "Quick with take out but so horribly overpriced... my trident bowl was below average and almost $16 (no additions / substitutions) and the tuna melt was also unimpressive...even if it's in a prime location... still wayyy too overpriced for what it is...", "label": 2}, {"sentence1": "The yogurt is fine although I enjoyed going to yogurt land better because of their Sanrio spoons and slightly more variety.  \n\nI had the mistake of ordering boba there one day. God was it awful. I had taro boba and seriously it was the worst $4 I spent. It tasted like powder. Save your money and don't order drinks there and go to tea lounge across the street instead!", "label": 2}, {"sentence1": "It was not good at all. The price was great and the chicken was fresh but the other pieces to my nachos made it not so food. After a few bites, I threw it away. Maybe it's just the nachos and the rest of the menu is good.", "label": 2}, {"sentence1": "I think this is a great place for tasty, reasonable Mexican food!  We have eaten here a few times and never been dissatisfied. The service is prompt and friendly. The food is tasty and generous portions for a reasonable price. I would definitely recommend it!", "label": 4}, {"sentence1": "Surprised to see such poor reviews.  By and large I have had great encounters here.  Mind you, I've only ordered pizza.  I do think it's worth giving it a shot as they have been consistently good for me - too bad about so many negative reviews.  Recommended.", "label": 4}, {"sentence1": "Cheeseboy is my new obsession. Who doesn't love grilled cheese? And you can add healthy options like whole grain bread, spinach and red pepper? Yes, please. It takes a while because they make everything fresh and grill the sandwich to perfection (I almost missed my bus because of this sandwich!) but the prices are reasonable and it;s probably the best option at South Station.", "label": 4}, {"sentence1": "This is like any standard Texas Roadhouse you may have experienced. Country music, peanuts, dancing servers and good steak. \nI've been to many fancier and more expensive places, but Roadhouse seems to prepare their steaks as well as any of them, good good steak.\nAnd I love their salads and their rolls with the cinnamon butter...I could make a meal on them alone!", "label": 4}, {"sentence1": "I had the salad and my friend had the sandwich. The chicken was perfectly cooked and crispy, I highly recommend it. The salad was a bit spicy but really good especially with the soft boiled egg.", "label": 4}, {"sentence1": "Great outdoor patio! The food is good - service was great! We all ordered the same thing so it's hard to rate the food but the club salad with salmon was awesome and honestly they had the best guacamole and salsa with chips I've ever had!\nLoved this place!", "label": 4}, {"sentence1": "Pretty good for the prices, was helped well  looking for my size. Cashiers were quick.", "label": 4}, {"sentence1": "I think this is my favorite Asian market in Portland.  Its no frills Asian provisions with a great selection and decent prepared foods.", "label": 4}, {"sentence1": "DONT ORDER FROM THIS PLACE !!!! It's a joke , late, pizza , rude service, you get to your room and want food and you see this flyer in your room. DONT ORDER FROM THIS PLACE !!! Save yourself the time and headache and get pizza from somewhere else !!! Google another pizza place , Uber eats another one !!! Please !!!!! Good luck !!", "label": 1}, {"sentence1": "In June, my eyelids were burned so bad that they scabbed due to waxing at this location. The area where these burns occurred are still darker than other areas around my eyes. Nothing I can do but live with the damage done by a waxer at this location.", "label": 1}, {"sentence1": "I got suckered in with the usual 20% coupon and enjoyed ok food other than the old fruit with sub par service.  Please see the pics attached.", "label": 1}, {"sentence1": "Slow AF. Not recommended if you have less than an hour before your flight. Even the To-Go service is slow. However there are not a lot of options on the gate.", "label": 1}, {"sentence1": "Frankly using AT&T is never a pleasant experience.   Their phone customer service is awful. Their stores are. But better because you can sit and talk with the employee but overall service is terrible.  I will never leave Verizon again.  I made an online RESERVATION appointment for 4:30.  It's now 5:00 and no one has helped me.   Apparently walk ins take precedent over a reservation.  So what's the point?  I hope to ask someone.  Eventually.", "label": 1}, {"sentence1": "Horrible service and the rolls were awful. After waiting for what seemed to be forever our food finally came. When telling the waiter the the food was really bad the only thing he asked was if I wanted a Togo box! This is not a place I would recommend to anyone.... Beware", "label": 1}, {"sentence1": "I have been waiting for almost 30 minutes to get a ride from their shuttle that is only suppose to go up to 2 miles away. Not a good start to my stay here. HELLO!!", "label": 1}, {"sentence1": "Well I just called your Richmond and Burnaby BC stores. After 15 rings the Burnaby store finally picked up the phone. The lady was rude and had no idea what I was saying. All I asked if the fall dresses were in yet. Need one for Nov 27. I said but you have them online and she didn't even try to explain and just hung up. Well lady you lost my $$$$", "label": 1}, {"sentence1": "The hen is an absolute favorite! We order it every time we visit Vancouver. Their koobideh and chicken kabobs are also great. Portion sizes are average. Service is good too. It is a family favorite! Location is good too. It's close proximity to the entrance of Stanley Park is good for picking up food for a picnic.", "label": 5}, {"sentence1": "Great service and food. . . it's very consistent and always enjoyable.", "label": 5}, {"sentence1": "I've literally had everything on the menu and my personal favorites are the fried chicken and the waterfall pork", "label": 5}, {"sentence1": "Ladies and gentlemen this place is an experience.  The seafood is delicious.  The service was terrific. The spices rated as hot, are pretty hot. This is NOT a first date night. They give you bibs, gloves, wipes and bags for a reason. This is a MUST comeback place.\n\nPS... I saved the sauce and put it on some pasta the next day......", "label": 5}, {"sentence1": "Go see Arsena! She is amazing! She is very detail oriented and makes you feel very comfortable ! I just moved here from California and I used to go to a EWC down there and liked my girl a lot so I was a little nervous to come to a new person, but I absolutely love arsena, she my favorite!", "label": 5}, {"sentence1": "I have used the services of Adkor (Celeste Messer & Ashley) many times over the years.  I am always extremely pleased and satisfied with their services.   I purchased 4 homes using Celeste as my realtor.  I have also rented out 2 of the homes for 5 years now, when I need a new tenant I immediately  email  Ashley (she does the rental side) I have had the best tenants!", "label": 5}, {"sentence1": "The Misses and I dined @OPIA on Sat, 27 May. Great location...joined to the JW Marriott -- right around the corner from 6th St downtown. The menu pricing was quite reasonable; outdoor seating as well as indoor (we sat outside). Our waiter recommended several craft brews along with the genoa salami salad. I ordered the salmon...exquisite! Dessert topped off with Americano coffee, gelato sherbet, lemon tart, and a tiramisu. Very nice...BTW, it was our 38th Wedding Anniversary (Misses enjoyed the dining experience which doesn't happen very often). Thanks OPIA.", "label": 5}, {"sentence1": "for the shopper who wants interesting generally high end items, particularly for the rustic second home, this place is excellent.  Not inexpensive, but it is very well curated so in many ways worth the price.  Not great if you are looking for a great deal.  Best for tough to find gifts. Staff is helpful and friendly.", "label": 5}, {"sentence1": "Food was ok. Service was terrible. No one served water or asked if we would like any beverages. Table was full of empty plates. I requested take out containers which was never brought to the table. We finally got them when we were paying the bill.", "label": 3}, {"sentence1": "The burrito was about $12, but it had lots of big shrimp in it, so that was ok because I ate it in 2 sittings. I ate the first half there but then left because I couldn't take how many screaming kids were in there. I know that's not their fault, but maybe that's just Boulder for you? Get your slightly overpriced but decent Mexican to go.", "label": 3}, {"sentence1": "The Good: Boulder Cafe has one thing that deserves 5 stars in my opinion - a fabulous happy hour. Every day. 1/2 off appetizers and drinks. \n\nThe Bad: The service is typically 2 star worthy. The food quality is consistently not consistent. Can be the best think you've ever had one visit, and hardly edible the next.", "label": 3}, {"sentence1": "Crab rangoon's, chicken and broccoli, and egg rolls are good. The delivery is quick. I tried the general gau's chicken and would not get it again. Some of the chicken was burnt.", "label": 3}, {"sentence1": "All I had was the pickled cabbage It was good... the gal that was serving wasn't the nicest, which is why I'm giving the 3 stars. But I would go back to try the other stuff.", "label": 3}, {"sentence1": "The food is great. All the pizza is cooked to perfection. Coal fired so they are a little dark and crusty, but not bitter. It pairs perfectly with their sweet and simple marinara sauce.\nThe waitresses are super nice and I've always been pleased with them.\nThere wings are awesome. They are coal oven roasted and charred, yet moist. They are priced reasonably for wings I guess. \nThe main issue is that the pizza is too expensive! And same with the beer! Wasn't expecting to spend 40$ at a pizza joint!", "label": 3}, {"sentence1": "the food was gr8, but it was disappointing to learn that they serve coke instead of pepsi.", "label": 3}, {"sentence1": "I want to build a gigolo bear, but I don't think they'll build one for me.  :(\n\nAh well, I'll try to convince them to build for me a dead hooker bear to give to my ex for Christmas.  Mwahahaha... jk.\n\nTruthfully, I don't think the bears and other stuffed animals from B-A-B are that cute.  I find the concept of sticking a tube inside a floppy bear \"shell\" and filling 'em up kinda creepy, especially with a kid watching.  I'd rather have my bear pre-stuffed, and then just select different embellishments to put them on.", "label": 3}]