[{"sentence1": "OK food, but the manager is rather obnoxious. He is occasionally rude or snarky to his clients, and lately he has been including tip on all bills, including groups of two (and a rather generous 20% tip at that!) When asked, he claims it is to help \"European and Asian tourists.\"\n\nFor years, Harvard Square has had few good alternatives to this place - but now I think I'll stick to the Chinese food truck on Oxford Street or the Kong...", "label": 2}, {"sentence1": "Changed style recently. Now it is fast food style. The food is no good, not as good as before. The cook is different now I am sure. It is not cheap,  food portion is smaller and no more waitress. The atmosphere is much worse than previous. The owner tries to keep the cost as low as possible.", "label": 2}, {"sentence1": "Great place to sit outside and people watch.  Food is not good.  Everything we had came out cold and fries were obviously cooked in old oil.  Ick.  But perfect location for a nice afternoon bite.", "label": 2}, {"sentence1": "The food was pretty good, but the staff are rude.  They're carbon copy hipsters, annoyed that you exist and are bothering them by ordering food.  No thanks. Bathrooms are filthy, bus tubs were overflowing with dirty dishes.", "label": 2}, {"sentence1": "We've been here several times and always find both the food and service to be good. Sure, the decor is a little random (there are strobe lights and disco balls sporadically placed around the interior) but you can always count on the food. We stumbled upon it while trying to avoid what seems like an endless row of pub food on Boylston and now its a regular stop when we're looking for some good thai.", "label": 4}, {"sentence1": "Great pizza, although make sure you get there prepared to wait because it's extremely popular. We had to wait a full hour to get seated and another for our pizza to arrive.", "label": 4}, {"sentence1": "Stopped there randomly on a fun day trip in Portland. BEST WAFFLE EVER! I don't even really like waffles, but the flavor of their waffles are so unique. The rest of their breakfast food is well done too. They cooked the eggs and bacon perfectly. The staff were nice as well. \nNext trip to Portland I want to come back and try more food, and eat more waffles.", "label": 4}, {"sentence1": "Not too expensive.\nVery tasty selection of sandwiches at an afordable price. I was very suprised that you could eat lunch for less that $10 on Disney property but you can here. And the food is worth much more. I would say this is the best spot for lunch around the Downtown Disney area.", "label": 4}, {"sentence1": "Forever.  I'm the only person here and I've waited for 25 minutes. I have no idea what they're even doing back there.", "label": 1}, {"sentence1": "The buffalo exchange in houston is better, I think if this one weren't so crowded and filled with snotty fashion challanged douche bags It would be way cooler. Just because you can tie a belt around a jc penny house dress doesn't mean you are stylish. These people act like they pick out models for alexander mcqueen.\nI prefer the goodwill on S lamar.", "label": 1}, {"sentence1": "Customer service is horrendous. I arrived at 7:45 and the doors were already locked although the restaurant closes at 8 pm. The two women on staff opted to ignore me although I knocked on the glass repeatedly. Avoid this place, go to piece of cake instead.", "label": 1}, {"sentence1": "Beware! Brand new refrigerator made loud noises intermittently but since it didn't happen immediately for the technician he refused to perform diagnostics, berated and mocked my wife and said she wasted his time. Further, he said she needed to have a video of the sound to show him, and that she needed to read the manual about when a technician should be called and he left without leaving paperwork or his name.  He was extremely rude, as many of these Yelp! reviews comments indicate.", "label": 1}, {"sentence1": "I was introduced to this restaurant through my oldest brother. At the time all he wanted to eat was Vietnamese food. I didn't know what the big deal about it was until I went with him to this restaurant one day. From then on, I have really liked Vietnamese dishes I've tried. Plus I've always wanted to come back to this restaurant just for their pho.", "label": 5}, {"sentence1": "Go-to for late night drinks :) the atmosphere is relaxed, the drinks are strong, they're open late, and they even offer some late night munchies. This was one of the first places I tried after getting to PDX after my friend recommended it to me because he liked it so much. And he wasn't wrong! The food always tastes really good and the staff is kind :) I feel super comfy coming here and would recommend it to my friends.", "label": 5}, {"sentence1": "I love this place.  Need a watch battery replaced?  Jewelry repaired or updated?  Want to buy a special piece, this is the place.  They have simple inexpensive pieces.  They have custom pieces.  You can go to the mall jewelers and hope you are getting your money's worth or you can go to Smith and Bevill and know you are getting what they say.  Friendly, helpful staff will spend time with you, and won't make you feel guilty for not making a purchase.  But you'll be back!!!", "label": 5}, {"sentence1": "Had several haircuts with Ming. She knows her stuff very well, and also quite funny! Definitely recommend this place.", "label": 5}, {"sentence1": "Not bad good  tables are not very clean the employs are young and not very experienced but there nice like I said the food is good", "label": 3}, {"sentence1": "This place is cheaper than most other places, but the service is a little off. I think I went on a bad day- they were implementing a new system and clearly training new employees.", "label": 3}, {"sentence1": "Bought the 3-meat dinner(Ribs, Turkey, Brisket)...meat was excellent, but they give you way more sides(and bread) than needed(slaw, beans, & potatoes). For $13.00(extra charge for carryout) I thought that I should have gotten more than 1 Rib......I may return, but only for a meat order.", "label": 3}, {"sentence1": "Great ambiance fun place with character. Diverse menu in different stages. Nice selection of beverages. Fried risotto perfect appetizer. Lobster ravioli and veal parm thin and crisp but nothing special but done well. Pasta side dish meh. Fantastic service to offset a better than average dinner. All said, I will return to try their pizza and other apps. Pricing reasonable - so go try it! Would give 3.5-4.", "label": 3}]