[{"sentence1": "First time at the Encore casino and looking forward to good Italian food at Fratelli.  I was disappointed.  The bread was stale and dry.  The salad misto was just lettuce wrapped in two cucumber slices without dressing.  It had no flavor and was difficult to eat.  The eggplant appetizer was mushy and tepid?  It was about 5:30 pm before the rush and i would have expected better service and food.  The bill was pretty high for what we got.", "label": 2}, {"sentence1": "Nothing really memorable, the food is just decent. I wouldn't recommend this and probably won't return.", "label": 2}, {"sentence1": "My o2 sensor I was told was broken do I took it to honest 1 who were able to see me quickly. They weren't clear until after the work was done that they were going to charge me $900 to fix my o2 sensor. After it was fixed a month later my car kept overheating and I thought it was my water pump going out. I took it to Garza auto and they charged me $211 to let me know that my fan was never plugged back in and I could have blown my engine up because of their mistake!", "label": 2}, {"sentence1": "$20 to mail a pair of shoes via FedEx ground. The UPS Store right around the corner was friendlier and more helpful, making the best cost effective recommendation.", "label": 2}, {"sentence1": "And we're out.\n\nSince my initial review, I have experienced much inconsistency with this place. \nIt's good, it's ok, meh, ok better, not so much.\nI'm talking the food and the service...hit or miss. \nGranted, there's barely any competition around here. Dbar and Harp and Bard are much better choices. Hell, McKenna's across the street (which is also owned by SB&K) is wonderful, but there's a long wait on the weekends seeing as the place is small and very popular.\nI've given this place too many tries and the last two times it was just awful. No more.", "label": 2}, {"sentence1": "This place only gets 2 stars for many reasons. \n1. Service was slow and distracted\n2. Food had no flavor and looked like it had been sitting\n3. The menu needs to improve and offer more vegan foods. \nThe list goes on\n\nThe only reason I gave it two stars was that I did get a good parking space. \nDan", "label": 2}, {"sentence1": "Not to be a  contrarian, I had the highest expectations for the drunken noodles and it was horrific. Yes, the portions are huge! But overall, it was meh. Given its 4 on average reviews, I have to give it a 2.", "label": 2}, {"sentence1": "When we left for our trip, it was super easy and they were efficient. When we got back, we waited for 32 minutes after calling them 4 times to pick us up. The only reason they get 2 stars is because they're inexpensive, but I guess you get what you pay for. Never again!", "label": 2}, {"sentence1": "Why is it that the phone number associated with Austin is not working and it goes into the main line for the entire company?? Please fix this and get a direct line to the Austin location!!!!!!", "label": 2}, {"sentence1": "Meh... Totally unimpressed... Found it a bit to pretentious a little to hippster over all a little snotty", "label": 2}, {"sentence1": "Not impressed. The lobster roll was not all that. The whole 1.5 lobster was good though. We ordered the$40 fried seafood special. The fried fish was good. That's about it. The rest was small and no flavor. I wouldn't come back again.", "label": 2}, {"sentence1": "Back in 2008 I was renting a room from a girl that worked there by the name of Andi. A short time later she met a guy that was driving a black Benz and that's when she became violent with me after getting home from work. I hope you guys fired her because she was trash!!!!", "label": 2}, {"sentence1": "We were excited to come here and try the menudo based on some of the reviews. You let us down this time fellow yelpers. The menudo was sub-par. Service was worse. Don't think we will be coming back. (Husband's thoughts and review)", "label": 2}, {"sentence1": "Very slow service. My ribeye steak was not seasoned and mostly gristle. We had to go find our server to get the bill.\nAlso: my salad has brown pieces of lettuce. I would not come back.", "label": 2}, {"sentence1": "Used to love this place but they changed their Mac... And that was the whole reason for going last night. Now it's just noodles with a little bit of cheese. Sad!", "label": 2}, {"sentence1": "This restaurant taste like Applebee's little brother that had to take 4th grade twice, and he always had chapped lips. Great server tho.", "label": 2}, {"sentence1": "This place is awesome, one of my favorites in boston. The atmosphere is great, always filed with gorgeous people. \n\nI like pretty much everyhting on the menu except for the oysters (idk about you, but I like my oysters with lemon & cocktail sauce, not with like, salad dressing). \n\nThey also have some of the best drinks i'v ever had in boston. Their so tasty that you don't realize how much alcohol is in them until you finnish one and don't need another one.\n\n P.S I strongly recommend the lamb chops.", "label": 4}, {"sentence1": "Cute little place, with traditional Italian food. The owner Barbara is adorable and will check on you to make sure everything tastes great.  It's a no frills kind of place but sometimes I'm in the mood for that. You'll get a delicious meal with enough to take home, reasonably priced wine and service with a smile.", "label": 4}, {"sentence1": "I love this place, it's a welcome change from the downtown shopping vibe. Every time i go in, I find something cute and inexpensive. Plus the staff are SO friendly, I feel totally welcome whenever I go in. A great place for basics like tights and tank tops, and funky one-of-kind items.", "label": 4}, {"sentence1": "My dog went to daycare for a week while we were away. He loved it and was exhausted from all the fun! Caring staff, clean facility, convenient location. Thanks for taking good care of my family member!", "label": 4}, {"sentence1": "I don't really have much to say about them. a majority (if not all) of the menu items are authentic and delicious", "label": 4}, {"sentence1": "It is like an explosion in your mouth!\n\nMy wife and I had a wide variety of tacos,\n\nBeef\nPork\nShrimp\nCalimari\n\nWe also tried the Hot dog/fire dog (being the hot dog obsessive that I am) and the sesame fries. \nOf course we didn't eat it all, but the food was AWESOME. \n\nOh and the service!  NICE PEOPLE, what a novelty!  \nI like them, a lot!  We'll be back soon!", "label": 4}, {"sentence1": "the food is hit or miss (i do say they have some fantastic sandwiches and turkey burgers), but it's the atmosphere that make's Doyle's great. the history. and the excellent beer selection.", "label": 4}, {"sentence1": "Nice place, very friendly. Really busy Saturday mornings. Call in advance and book an appointment", "label": 4}, {"sentence1": "GREAT Italian sub. As loaded as the subs at Al's State Street, and like Al's they use capicola. Great shared Rewards program with Papa Gino's, too.", "label": 4}, {"sentence1": "Even though most of Walton's neighbors are West 6th bars, this is a good little lunch spot.  They made an excellent tuna salad sandwich which was a little pricey.  The decor and vibe of the place felt a little too much like my (beloved) Mom and her friends decorated it with flowers and antiques.  And the mostly female crowd did not seem too bothered by this.", "label": 4}, {"sentence1": "Team Katy at Texas Green Clean did a great job! They were very thorough, and friendly. I also love the online booking! We will definitely be using Texas Green Clean again!", "label": 4}, {"sentence1": "$32 for a delicious 6 inch pink cake (rasberry frosting with chocolate cake). Super pretty looking and delicious to boot. My one gripe would be the amount of frosting, but that's just me. The less frosting, the better in my book (especially buttercream). The shop is a Pinterest bakery dream. Easy online ordering and great communication. I think we've found our go to bakery for bday cakes. Can't wait to try more!", "label": 4}, {"sentence1": "We kind of stumbled upon this place as we were desperate to get 3 kids fed something not McDonald's and was pleasantly surprised by the tastiness of the food! The interior looks like it needs a little TLC but the service was good and the food was hot and full of flavor.", "label": 4}, {"sentence1": "店内は明るく清潔感があります。開店してすぐに入りましたが、お客さんはもうすでに入っていました。\n牛骨スープとプルコギのセットを注文しました。\nスープは沸騰した状態で運ばれてきました。\n味がないので塩胡椒を卓上で追加する必要があります。\nプルコギはマイルドでお肉もしっかり入っていました。\nチャプチェもマイルドで子供達がどんどん食べていました。\nビビンバは運ばれてきた状態では味がありませんでした。甘辛いコチュジャンが好きなのですが、辛いだけであまり深みを感じませんでした。ビビンバ頼まなくてもよかったな。と感じています。", "label": 4}, {"sentence1": "First night in Disney and we stopped at Disney Springs. Spent the night walking around and we ended it with a sandwich from Earl. I had heard a lot about this place and it turned out to be very good. We got the Earls Club, simply had to because of the name. Turkey, bacon, and Swiss- delicious! \nDefinitely give this place a try.", "label": 4}, {"sentence1": "I definitely had fun when I visited Baby A's.  The ritas were pretty strong and the mole enchiladas were pretty good.  It was fun watching people karoake too.", "label": 4}, {"sentence1": "Just stopped by the drive thru about 30 mins ago due to working midnight so I can get a snack. Whoever answered the intercom was very rude. Basically said they have no food and just accepting  cash. In other words they didn't want to freaking work. On top of that right before pulling in that drive thru I seen like 4 workers just hanging out outside . Wow if u don't like your job or shift just quit . Whoever is managing that McDonald's really needs to tighten up or get people that want to work. Very unacceptable....", "label": 1}, {"sentence1": "Don't forget anything during your stay.  Even if you call about it the same day you check out, the item will be gone.  For a \"nice\" hotel, I'm extremely disappointed in the service.  They say they will look and get back with you but we have called daily since we have checked out and get the same response.  Someone obviously either took the item or threw it away.  We definitely won't be returning or recommending this hotel to anyone.", "label": 1}, {"sentence1": "If I could give zero I would. Dogshit ingredients and service. Worse or the same as a grade school cafeteria sandwich. I'm going with worse. At least lunch ladies have character. Nappy ass mayo and salad fixings. They really do use the assembly line well of manufacturing shit so quickly and effortlessly. The McD's of \nshit-whiches.", "label": 1}, {"sentence1": "Don't buy a used car here. They delivered me a certified car with one broken key, cosmetic issues they promised to fix, no floor mats, the wrong owners manual...so I called the sales manager who literally sounded like he could not possibly care less (at least pretend dude lol) and offered to do nothing to honor what the salesperson promised.\n\nUseless.", "label": 1}, {"sentence1": "Mediocre food, long wait to get it and a very rude hostess. \nI am done with this place. There are plenty of better options in JP.", "label": 1}, {"sentence1": "Very mismanaged restaurant\nUnderstaffed.\nDon't know how to serve their customers. I have had to walk out and go elsewhere , rather than wait on their very slow service.", "label": 1}, {"sentence1": "I showed up at the Taco Shack on Spicewood Springs this past Sunday at 7:10am to find locked doors when their website claims they open at 7am on Sunday's. After standing there and knocking on the door for five minutes, only to be ignored by the staff, someone finally turned around and held up ten fingers. WTF?!  I went to Tacodeli!", "label": 1}, {"sentence1": "Worst experience. The room was so dark you couldn't see. It was dirty and gross. The guide was beyond useless. When we used our clues he would tell us things we'd already done. Not to mention the room was extremely small. I've been to the lock room before and loved it. I guess my expectations were above the extremely low standards at the escape game in Austin.", "label": 1}, {"sentence1": "Terrible facility to work for! Highest patient nurse ratios for acute care setting, unsafe for patients. One to two CNA's, if you're lucky, for entire unit. Fellow nurses and RT's are great, nurse manager constantly in search of staff. Will still accept admissions knowing they were short 2 nurses. No support from upper management or back up even if they are on call. No PPE, but accept Covid patients. When asked, was presented with a used N95 fished out of someone's locker. When refused to accept assignment/conditions, was threatened they would file complaint against my license. Absolutely appalling. Beware.", "label": 1}, {"sentence1": "No white claw variety packs. No option for mango white claws. This sucks. I am writing more for this review now because yelp won't let me post a short review. It literally wont let me post below 125 characters. Boo. Also, the paper bags suck I had my 4 tall boy white claws in a bag and it ripped on the way out. Oh no", "label": 1}, {"sentence1": "Just plain. No taste.\nI don't want give even one star.\nNever come back !!!", "label": 1}, {"sentence1": "With an appointment you'll wait minimum 30 mins on a slow day.\n Then they don't respect who you request. \n(They give you to anyone hoping you won't say anything!) after waiting  30-40 mins I honestly  didn't even say anything! But it's not the first time.... won't be back. Only request Tammy.", "label": 1}, {"sentence1": "I have never in my life been told to leave a restaurant. I'm absolutely appalled. After we finished our breakfast we sat and talked while finishing our coffee. A very rude older man approached our table, literally told us to leave because there is an hour And a half limit, and walked away. My jaw was to the ground. Mind you, from the time we sat down to the time he did that, it hadn't even been an hour. The food was unimpressive borderline gross and the employees were rude. We will never return. Don't waste your time here.", "label": 1}, {"sentence1": "We bought Chopped Pork BBQ from Maddy's to take home. Warmed it up the next evening and a few bites in my wife bites down on a shard of glass! We found several small pieces of glass in the pork. One of my wife's teeth requires a filling.\n\nThe reason for the poor review is the utter lack of response from the owner. We've left several messages over the past few weeks and no response whatsoever. That is a poor way to run a business.", "label": 1}, {"sentence1": "Rude. I mean, VERY rude. Really upset my mom how the lady there snapped at her  multiple times when my mom asked simple questions in a very calm, appropriate manor.\n\nThe Wonton soup is ALL oil and has no flavor. The house fried rice was dry and had maybe two pieces of shrimp in the entire thing. The beef we got was chewy and rubbery and tasteless.\n\nAND they don't deliver. Who doesn't deliver? Maybe it's because their food and services is TERRIBLE. Don't waste your time. Go across the way to First Choice Chinese Food. Ugh.", "label": 1}, {"sentence1": "Toasted sandwiches, last I checked, were supposed to be moderately hot... Not ice cold, yet my sandwich was served up ice cold. When I asked to have it put through the oven again the girl working refused, saying its correct\n\nWe're off to a great start, with sub-par food maybe the atmosphere will be better...\n\nNope. Apparently the great fruit fly invasion of 2014 has started, and it's first attack is happening today, at this Quiznos.\n\nAvoid. Like. The. Plague.", "label": 1}, {"sentence1": "I am really happy to report that Lazziz more than exceeded our expectations. My wife and I spent ~3 years in England and have missed good curry and we finally found one near our home in Newton. Best of all they are going to start delivery after January 1 st. \n\nWe had Lamb Madras and Chicken Tikka which were both flavorful. The Nan and Samosas were also great. We have a new favorite Indian restaurant which is a great New Years surprise. \n\nEnjoy!", "label": 5}, {"sentence1": "Had to take my dog here for what turned out to be an allergic reaction. They didn't try to do a bunch of unnecessary testing to rack up my bill. They were attentive, friendly, and efficient. It was $183 for the entire visit including 2 injections and medicine. I'd recommend the lake Underhill location to anyone!", "label": 5}, {"sentence1": "Dining at The Melting Pot is always a tremendous experience. \n\nEverything is top shelf! From the service to the ingredients to the cocktails. I highly recommend the Deep South tea.", "label": 5}, {"sentence1": "Muffins are legit! Huge are really, really good. No seriously, they are insane. Most of them are basically small cakes or huge cupcakes.", "label": 5}, {"sentence1": "We had a fantastic experience at Le Pigeon. There was a lot of hype leading up to coming here, and it was all well worth it. The service was great, our waiter was extremely knowledgeable on the wines served, and knew great pairings for our dishes. The ambience is uniquely Portland - very cozy and not over the top at all.", "label": 5}, {"sentence1": "Always a great go to for Italian love their meatballs and stuff mushrooms! Also in the same strip center a great place called SC bar and kitchen with wonderful salmon and a great bar manager name Karen!", "label": 5}, {"sentence1": "This location is a very cozy small intimate feel. Reminds me of my small hometown in west Texas! Better yet they show anime movies, and all the amazing diverse films that never make it the major locations. Today I'm watching the Florida project! I come here to escape", "label": 5}, {"sentence1": "Comprite did an amazing job on my laptop my mouse pad and keyboard decided not to function, I brought in my laptop they have the best customer service Ben;) Alex did an amazing job by backing up all of my information got it running the very next day! Great price  honest people.. Thank you", "label": 5}, {"sentence1": "Jaime has only been with us in Portland for a year now but we're so lucky to have her. I've switched lash places 4 times now and she is the best I've been to. She gives me exactly what I'm looking for every time, plus she's the best conversationalist when you'd like someone to chat with but also respects when you'd rather just nap and wake up beautiful. The lashes that she uses are so light but make a huge impact.  Again, I'm so glad I found her!", "label": 5}, {"sentence1": "So delicious after a long day! Had the tofu and veggie soup followed by the beef pad see ew.  Spot on and fresh.  Staff is pleasant.  Looks a bit shady from the outside but just trust me and go down the twisty stairs, tasty treats await.", "label": 5}, {"sentence1": "Wow!! My couch returned home today from Starky Phan's II and it is beautiful!!\nThe workmanship and service EXCELLENT!!\nI so appreciate the friendly personable nature of Huy and his family. Delightful!\nI recommend them highly.", "label": 5}, {"sentence1": "Such a cute place with great food and staff! We needed another brunch place in this area (Homegrown is way too crowded now) and this fits the bill. The biscuits and gravy are delish!\n\n**second time** Food just as good but service was spotty. Very friendly but disorganized. They seem to have a lot staff.", "label": 5}, {"sentence1": "Thanks to Greg our driver and guide for an awesome tour of Boston.  Greg was very personable and knowledgeable which made the tour one to remember.\nI highly recommend this company for anyone looking to see Boston and learn about the past, present, and future of this city.  If your lucky, Greg will be your guide although I am sure they are all fantastic.\nThanks for a bombastic time!", "label": 5}, {"sentence1": "Love this store!!! Classy..Armani has mastered the suit and the casual emporio collection is so cool!!", "label": 5}, {"sentence1": "I've been to shops all over Colorado and California and never have I seen such a beautiful and unique assortment of pieces. It's clear the owners take great care in choosing their merchandise. They're also super nice. My new favorite head shop!", "label": 5}, {"sentence1": "Came in for a state inspection without an appt. They got me in within 10 mins. Friendly on the phone, friendly in person (I asked a lot questions), comfortable lobby & finished sooner than they had estimated for me. Looks like I found my new auto shop! One thing to note, yelp has their address pinned in the wrong location. It is actually west of Windermere on Pecan.", "label": 5}, {"sentence1": "Nice selection of puzzles and craft kits and a very helpful salesperson.\n\nThe only downside is the pricing - the exact same Lego Ninjagu clock was $44 here, and only $25 at Toys R Us.", "label": 3}, {"sentence1": "Stopped in their new College Park location twice for breakfast. Vibe is quick and clean, service was was very friendly but often absent from the floor. Food was meh to okay.  \n\nWe'll give them some time to work out the kinks and try it again.", "label": 3}, {"sentence1": "Service was great, however was disappointed on the Detroit Deep Dish. Was a lot more bread than toppings. Would prefer a deep dish from Jets pizza.", "label": 3}, {"sentence1": "Lisa D pretty much wrote my review. Really isn't busy at all and has tons of stuff from food, houseware, furniture, garden stuff. It's the the dollar store of target. If that even makes sense. However, since this is a discount store, for some reason the customer service follows along with discounted customer service. The employees are not so helpful and just lack basic politeness. Sad, really.\n\nI do go once a month tho just to grab some basics and cute decor for the house!", "label": 3}, {"sentence1": "Traffic nightmare, parking scant. The staff is overwhelmed by rude people who talk on their cellphones while going through the order line. These customers are on that ******* cellphone &/or smoking outside too. The food is good but the atmosphere is slightly better than WalMart on check day. This area has overdeveloped at too fast a pace! Traffic lights with turn arrows, as well as basic courtesy, would improve things greatly.", "label": 3}, {"sentence1": "Latte was great!  Staff was friendly, ambience was neat and seemed good for working. Got a salmon bagel which I did not enjoy at all - barely any salmon, lots of greens which were drenched in a sweet balsamic vinaigrette which is a weird taste for a lox bagel, one slice of sour green tomato, and the capers were nickel sizes slices so instead of a small taste as you eat it was more like a chewy big caper with most bites.  Can't say anything about the other lunch options but would not recommend the salmon bagel.", "label": 3}, {"sentence1": "Good breakfast, but not out of this world like some other diners in Boston. Good service!\n\n3.5 stars for the food not-quite being killer diner food.", "label": 3}, {"sentence1": "Really, this Mexican restaurant is like any other. The food was exactly what you would expect, and they have an ok happy hour on Sundays for jumbo house margaritas. The prices were way too high in my opinion for what we were getting, however. Basically none of the plates were below $14 and went up to $20 for basic meals. Again, food and drink were fine but too steep I think.", "label": 3}, {"sentence1": "Another business club.\nI have been several times and it is unremarkable; up on Xteenth floor of a tall building right OTP up 75.  I am a member of one in Buckhead and they all share the same basics.\nI have had a lunch here, been to several dinners and receptions and they have all been fine.\nHard to get excited about it...", "label": 3}, {"sentence1": "I so greatly want this establishment to succeed because of the community and because of the owner. I've had 3 separate dining experience here and each experience has been eventfully negative. I write this review because this was the final straw. I ordered shrimp and grits I get a bowl of shrimp. \nI honestly think that the staff here is purposefully sabotaging this establishment. Who sends out a bowl of shrimp and grits without the grits that's not a mistake that's intentional.", "label": 3}, {"sentence1": "Sauce is too \"safe\" for my liking. Fun atmosphere in the restaurant. Good local joint. Recommended for a quick weekday meal. Place holds a crowd. You'll run into townies here. Probably one of the most happening restaurants in downtown Wakefield", "label": 3}, {"sentence1": "Good food, expensive, long wait.", "label": 3}, {"sentence1": "After eating here again today I can say the burrito I had was pretty good. Friendly people too!", "label": 3}, {"sentence1": "I eat a lot of ice cream...obviously.  And I liked Amy's overall.  There's way more hype over Amy's.  I'm assuming it's a local thing.  Everyone's been going there forever.  \n\nThe lines were a little nutty long.  The photo machine ate our money.  Overall it was okay.  \n\nHowever, I liked the stuff I got from the street vendor on Guadelupe much better.", "label": 3}, {"sentence1": "The food is good. Service is quick. However the cleanliness of the estsblisment is lacking in the dining area. I just hope the kitchen area is a different story. Tables and seats were very sticky and gross. You could see where perhaps an employee attempted to wipe down a table due to left over circular water marks left on the table but food bits remained. I gave them 3 stars in the off chance that they were having a busy day.", "label": 3}, {"sentence1": "Decent Mexican food staples and margaritas.  Good, friendly service.  It's pretty cramped inside, so if you come, you shouldnt mind cozying up with fellow diners.  The parking lot is also small.  Probably the best of its peers in this neck of the woods.", "label": 3}]