[{"sentence1": "I was not impressed at all with this place -- yes, it's cheap, but I was injured!  My cuticles were trimmed so severely during the pedicure that one toe actually started bleeding.  That has never happened to me before during a pedicure.  And the woman doing my nails didn't apologize or really even acknowledge that it happened.    \n\nThe manicure was average -- chipped pretty quickly though.  And I found the staff to be sort of cold, even though I was the only person in there.  \n\nI do not plan to come back.", "label": 2}, {"sentence1": "Just all around disappointed but I'll keep it brief as I don't want this place to waste any more of my time. Bella's Restaurant is essentially Olive Garden's creepy uncle with lower quality food and higher prices. Either improve your food/service or lower your prices. 2 stars because at least the Bruins game was on and the beer was cold.", "label": 2}, {"sentence1": "I've never had such a bad mani/pedi in a long time. This was beyond rushed and the gel mani was painted too far away from the cuticle so it looks like I've had it done for more than a week", "label": 2}, {"sentence1": "(Portland, not Seattle) I took my little dog in with what appeared to be an injured paw.  She was wincing with pain when it was touched.  $300 later it turned out to be a torn nail.  They didn't discover the torn nail until after they had done x-rays and were trimming her nails.  I think a basic exam of her paw should have been done before the x-ray.  I won't be going back.", "label": 2}, {"sentence1": "I was craving falafel, so I looked on the aps on my phone to see where I could order ahead and saw this place with good reviews. If you have falafel in your name, you should have good falafel, right Not the case here. Well, the falafel itself might have been fine, but it was hard to get past the crumpled bread, dripping sauce and jumbled vegetables. I picked up the wrap, but the insides looked like someone had played soccer with it.", "label": 2}, {"sentence1": "I was excited to try this place because of all the 5 star reviews,  but I just don't get it.  I got the avocado tacos with chicken.  The rice and beans were barely warm.  They didn't even use cojita on the beans,  just regular shredded cheese,  and the tacos were on flour tortillas (why?). The salsa was weirdly bland and spicy at the same time.  None of the food was adequately hot.  No need to return.", "label": 2}, {"sentence1": "An apology has been issued by the League and although it was quite too late, it was a sincere apology.", "label": 2}, {"sentence1": "Meh. It's a'ight.\n\nGo to Bova's.", "label": 2}, {"sentence1": "Although overpriced on most items. I am giving 4 stars for the beauty area! They applied my false lashes for free and gave me advise on what the different styles would look like on me. (Aka they saved me from looking 'crazy').", "label": 4}, {"sentence1": "its really very good \n\ni was there yesterday evening for dinner i got a bbq chik pizza it was good and the way they make it is better then everybody else in town and now they have $ 5 sub and dinner for $ 8 which i think is the cheapest of all rest.\n    freindly service good people and fast. this resturant have good breakfast too which they also deliver from 8am to 1am almost like a store 24..... \n\nshould be visited at least once ....", "label": 4}, {"sentence1": "The food - I have zero complaints.\nThe service is great and the prices are reasonable.\nCan't go wrong.", "label": 4}, {"sentence1": "They pour a pretty decent latte. No frills. Perfect foam. I noticed bright, fruity notes to the coffee the instant I took my first sip, which isn't my thing, but it was still well done.", "label": 4}, {"sentence1": "Walking thru Quincy Market. Stopped Tuesday night. Came back Wednesday night too. Really good cannolis!  Love the market. Yes it's touristy. I worked there when I was in college at a more small local bakery space.", "label": 4}, {"sentence1": "Who ever is working the front counter today should be put in the back of the house.  Terrible communication skills, called in an order, was pretty rude.  Made my order though and came to pick it up and he didn't even start preparing my meal.  Why?  Because one person was in the restaurant.  Good thing he there wasn't a second person here.  \n\nLove the food and have been coming here for awhile but my god.  That dude needs to step up.", "label": 4}, {"sentence1": "Great school! Convenient location! I earned a Coding and Billing degree and have since worked with wonderful people in the medical field thanks to BCI!", "label": 4}, {"sentence1": "I had the rare beef Pho it was on point. I also had the pork Vietnamese egg rolls, they were fire. My uncle ted had chicken teriyaki not so good. He like it tho", "label": 4}, {"sentence1": "This was by the far one of the worst experiences I've ever had in Boston. Incredibly rude staff, food was subpar. Honestly the staff was the worst part. Will never go again and would tell everyone to stay away.", "label": 1}, {"sentence1": "My first time visiting  barking Crab was Sunday 7/6. the food was great, and the service was wonderful but beware of large rodents trying to share your dinner because that's just how close this creature was.   i feel this is a problem that you should address because no one should be subject to this while there dinning and when it does happen the manager should be gracious enough to apologize or even offer the customer somthing for the inconvinice.", "label": 1}, {"sentence1": "Terrible service, mediocre food and insanely overpriced for what you have to put up with here. We were finished with our appetizer before we even got utensils... Luckily it was lettuce wraps so no fork necessary. If I were Jerry Remy, I'd be embarrassed to have my name attached to this place. It's clear he doesn't care and neither do the cooks, managers and certainly not the servers. We even witnessed a table of five wait so long they got up and went to the restaurant next door. It also was far from busy on a beautiful day.", "label": 1}, {"sentence1": "Save your money and go to Whataburger! This place is awful! After the host \"forgot\" to seat us, we eventually ordered at the bar. The menu consists of burgers & chicken sandwiches. We ordered one of each and they were equally bad. Both were covered in bitter, black grill grime; completely inedible. But hey...the fries were good. Good thing, because it was $12 for the sandwich and fries...like I said- go to Whataburger. This place will never survive the summer months.", "label": 1}, {"sentence1": "They refused to seat two of us 45 minute before closing, even for drinks. Last time, the food was honestly just ok (some hits, mostly misses). I'd avoid this place until they get better management have a more reliable kitchen", "label": 1}, {"sentence1": "Chris Galvin is the worst barber I have ever met. He nearly don't ask about your opinion. And his cut just spend 10 min and appear a bad look. So I highly recommend don't choose him to have the haircut.", "label": 1}, {"sentence1": "Over 2 hours and still no food. I'm literally only a mile away from the store smh. Called twice and got the same answer the driver is delayed....what does that even mean?? Don't waste your time order from a local pizza shop.", "label": 1}, {"sentence1": "Ordered Chola Batura which involves chickpeas and large fried breads, but this order just had some gravy and the bread but no chickpeas. When we called, the guys talk to each other and explain that it is in there and that I am mistaken. WTF??/ I just called and complained and the response is that I am mistaken?!! Well FU Daawat... Last time customer here...", "label": 1}, {"sentence1": "This place is a real gem!  Spicy hummus, saganaki and lamb quesadilla were all very good. Cold beer. Nice patio. Service was top notch - they were not particularly busy but our server was knowledgable and exceptionally outgoing and nice. I see many visits in our future to try more from their menu.", "label": 5}, {"sentence1": "I found FlightCar by chance while searching for a rental car over the holidays.  A full 7 days only cost 119 dollars!  Every other car rental out of Logan was at least $400 for the week.  I chose a vehicle that was older, as I was not picky and wanted maximum savings.  The Camry I was given was clean and ran like new.  I had absolutely no problems using this service and I would highly recommend that every traveler give FlightCar a shot!", "label": 5}, {"sentence1": "Caveat: I was vegetarian when I ate here. \n\nThis may not be the world's classiest deli, but I really enjoy it. \n\nFirst of all, they've got field roast, which is a godsend for vegetarians who just want a protein-rich sammich. The bread is good, the toppings are nearly endless, and the combo is a really good deal. \n\nHardly any seating, but if you want a yummy veggie sandwich this place is cheap and awesome, and the people are friendly.", "label": 5}, {"sentence1": "I ordered the chicken biscuit and it was phenomenal!  The bloody Mary's are an absolute must also!!", "label": 5}, {"sentence1": "Went here for magical dining and it was a fantastic experience! Was able to try a little bit of everything for a fraction of the price. Easily one of the best restaurants in Disney Springs. Gustavo was our waiter andwas super helpful and delivered amazing service. We will definitely be back!", "label": 5}, {"sentence1": "Amazing service and food. Really treated me  exceptionally for my birthday! Everything we had was phenomenal.", "label": 5}, {"sentence1": "We have four very finicky pizza loving kids, and all of them votes to review with five stars. That is a really tough thing to do with this crowd. Well done Blaze, well done! \n\nThe high rise won over the naysayer in the group. The meat options were plentiful for my meat eaters, and your veggie options were spot on for this vegetarian! \n\nLooking forward to the next visit.", "label": 5}, {"sentence1": "My 21 month old grandson adores Dr. Cora Forsten!  Her calming style, her expertise with pediatric meridian therapy & Japanese style acupuncture truly treats both the physical and emotional elements in her patients.   I've recommended several friends to Dr. Forsten.  They all agree.  She is the BEST !   \n\nGrandmommie J.", "label": 5}, {"sentence1": "Many varieties of fish. Tetras, dwarf frogs,gold fish, bettas,etc. Price range is cheap, especially aquarium tanks. $30 for a full set of 10 gallon aquarium, including water conditioner, light hood, net, decorations, etc.( wouldnt recommend buying any fish though, only the equipment) \n Many types of aquarium accessories,such as, decorations, siphons ($10 for small), filters, pumps , lights, etc. The shop owner has been working there for more than 20 years.", "label": 3}, {"sentence1": "Yea yea the lobster rolls are really good, straight buttery bread with a ton of juicy lobster meat and no lettuce/tomato/mayo filler it's everything you want! But I felt pretty guilty paying almost 30 bucks for it. It's so simple that I have a feeling I could make it myself for much less. And the wait is ridiculous... the joint fits like 20 people maybe. I went to try it once but I wouldn't go back again.", "label": 3}, {"sentence1": "The old store was fantastic: you could wander around for hours in the discount section and come away with a pile of good books for less than $20. When they changed locations, I was glad to help with the move, considering all of the years I had been going there to find great books at incredibly low prices.\n\nThat being said, I wouldn't recommend going to the new store unless you live nearby: they don't carry anything particularly rare or unique, and the prices are usually comparable to Barnes and Noble.", "label": 3}, {"sentence1": "Always heard about Vancouver's dim sum and ended up chatting with some Asian Canadians while I was on my cruise up to Vancouver and they had mention about some dim sum place that was two-stories so I'm assuming they were talking about this place. The food was decent, we got the standards har gaw, siu mai and other items, well actually a lot but can't say it beats LA's dim sum scene. Service was good and liked how in Canada, splitting a check is not a big issue even at a Chinese restaurant.", "label": 3}, {"sentence1": "They got the job done. But they did not honor my time and I ended up waiting about an hour longer than I was told. Then my seats after being shampooed were not covered. It's just sort of a mess. But after all its a car wash...", "label": 3}, {"sentence1": "Borinquen is not the cleanest restaurant but the prices are great. We ordered 3 meals for around $16. Plus if you check in on Yelp, you get 10% off. The food was good. A hefty amount for the price. I ordered the chicken stew with yellow rice and pigeon peas. The stew was full of flavor.", "label": 3}, {"sentence1": "Consistency is my biggest issue with PJ's. Sometimes there's nothing better than cramming your face with a sandwich stuffed with random fried foods after a long night of boozing, but getting PJ's is always a risk. Do not go to PJ's unless you are heavily intoxicated as that is their target market (\"Home of the Drunks\" printed on the front window)", "label": 3}, {"sentence1": "I'd give it a 5 star if they didn't try to nickel and dime ($2 per) over asking for a sample before I experiment with new beer. It's a simple request and I don't care if you have 100+ beers - so does everyone else.\n\nI'm sure the food will be good but this a is real deal breaker.", "label": 3}]