[{"sentence1": "The French fries were not salted, and they weren't even fried. Why are they called French fries if they're not even fried. And the to-go box was even a box, it was just a bag. I would use the bag to put over my head and suffocate rather than come here again. But the burgers were really pretty. --Vivian Nguyen and Renee Yu", "label": 2}, {"sentence1": "I've tried several dishes from here and they've consistently been subpar.  Tonight, I ordered the stir fry chicken and broccoli thinking it would be hard to mess up .  The rice was so undercooked it was crunchy and inedible.  The broccoli was cold and the chicken was tough.  The prices are outrageous for the quality.", "label": 2}, {"sentence1": "This is just an average at best spot to grab breakfast. If you're like me and prize taste and quality above a heap of food for cheap, you'll be as unimpressed as I am. Server was brusque and acted a little put out to have to actually provide service. Eggs ordered over medium had runny whites and English muffin wasn't toasted-just barely warmed.  Fruit was obviously from a previously frozen bag.  I really can't recommend it.", "label": 2}, {"sentence1": "The food is ok but the service is TERRIBLE! We come here because it's close but everyone we order something is wrong. Going through the drive-thru will 100% get you the wrong order, no salsa, or missing items.\n\nUPDATE: this is how the burrito was wrapped.", "label": 2}, {"sentence1": "Well done! Despite being a food chain, You have the idealism(concern for the community, environment and care about children), the energy (use or try to use local produce and focus on organics), and the popularity! We had an hour wait in which we decided to eat at the bar! But the stop and the wait was well worth it, given the locality!", "label": 4}, {"sentence1": "Service was a little slow.  I had the jalapeno burger, was delicious.  Also got the pretzel bites, the sauce that came with it was amazing!", "label": 4}, {"sentence1": "Great Pizza! Love that the crust is thin that the pizza overall was not greasy. \n\nService was a bit slow, but the the pizza made to order was worth the wait.\n\nIf you're in a hurry just grab some pre-cooked slices to go instead of having something made to order.\n\nThe Caprese was fantastic and is a good pick for those of you who are vegetarian. The salt and pepper made that pizza- which surprised me. Those are not typically ingredients you boast about first on anything!\n\nThe Carnivore is great for meat lovers. Loaded with protein me mozzarella!", "label": 4}, {"sentence1": "I was really surprised by the price of an arepa... $8??? For one? Does that come with sides? I've had tasty arepas for half the price so I didn't get an arepa. The guy suggested a cachapa which is a flat corn cake/tortilla topped with meat, cheese, and sauce. It was pretty good but the corn cake/tortilla was too sweet for me. I also got the sweet plantains and fried yuca chips which were delicious but again pricey... $4 each. And the guava juice is great. I would get the arepa next time even though it's crazy overpriced.", "label": 4}, {"sentence1": "the worst costumer services in a small neighborhood,  and super expensive, plus if you buy  it you can't returned even when is not open.  bad business", "label": 1}, {"sentence1": "Worse slow service we've ever experienced...waiters paid us no attention, food took 1 hour, food was not what we are used to from the Roy's franchise, very disappointed, been coming for over 5 years but will NOT return to the Roy's in Orlando again", "label": 1}, {"sentence1": "This place is great if you are trying to drop a few pounds. Usually out of stock (peanut butter 100% of the time) and their \"fresh\" fruit was certainly fresh five days earlier. The staff usually greets you as if you bullied them in high school.\n\nBonus: Be sure to check out the filthy smoothie pitchers too... Can you say penicillin?", "label": 1}, {"sentence1": "Fake farm to table restaurant. Pizza crust no better than fast food. Fries from a bag. Only one night in Boston and wasted it on this place.", "label": 1}, {"sentence1": "Food was awesome Kim took great care of us will definately be back!! She was awesome and so was everything else! A+", "label": 5}, {"sentence1": "If you love Sushi  you gotta come here. When you think of Hibachi automatically you think smoke, someone throwing food at you to catch. Not at all had a upscale feel with great service. They cook the food behind the counter on a hibachi grill that you can see. They made Mother's Day so much fun!!  Thanks Taylor", "label": 5}, {"sentence1": "I get my dry cleaning done twice a month, and these guys are always on time with next day delivery. I never used lazy bones when I went to BU because I felt that people really need to just not be lazy and do their own laundry, ESPECIALLY when it racks up to like $25 a load. HOWEVER, as I found myself having less and less time to get my own laundry done, and with simple dry cleaning's prices, I started trying it out and found myself a great deal every time.", "label": 5}, {"sentence1": "Positive experience. Each bun was carefully crafted so that each bite was as satisfying as the one before. Each of them has a plentiful amount of meat so you feel like you're getting your money's worth and at the price that who can complain. The environment is nice. Everything is sanitary (very important during these times). Please go and support this local business.", "label": 5}, {"sentence1": "A great local wine market with a small selection of craft beers and premium spirits.  The staff is knowledgeable and friendly, which is something we look for in a local liquor store.", "label": 3}, {"sentence1": "I've only spent time in the basement portion but have always enjoyed my time there.  Great pool table, but the bulls eye on the dart board is so beat up the dart won't stick to that part.  We had to modify our game of Cricket to have the triple 4 be the bullseye.  Other than that, the vibe is good and the drinks are good, although not as strong as I'd like,", "label": 3}, {"sentence1": "Ordered via grub hub.  Said it'll take 40 min.  Got order 1:20 min later.  Kept asking if they actually had my order and it hadn't gotten lost, but couldn't get answer.  Worst part is I got attitude from staff and manager because I kept asking.  Food is very good.", "label": 3}, {"sentence1": "Having seen so many dramatic reviews, I feel the need to chime in. I agree the baked goods/pre-prepared foods are mediocre and remind me of what you might find at Roche Brother's Bakery. I agree the exterior looks more promising than the reality but it's a serviceable bakery. I have always had decent service, and I am a fan of their soups which are chock full of fresh ingredients. So overall, A-Ok.", "label": 3}]