[{"sentence1": "Could just as easily be called Mediocre Deli.   The lines are absurd and if you want a side with your sandwich you get to stand in TWO of them!  Tried the pastrami twice...it's the blandest you're likely to find in the city.", "label": 2}, {"sentence1": "The service here is okay... I always try to be understanding because they're right in the mall and it's the most convenient Starbucks located in the mall so it can get hectic but the drinks here aren't so good. I went here multiple times and my drinks are never good. I mean I don't really drink coffee like that so I don't really care for my coffee to be perfect but it's just not made well here.", "label": 2}, {"sentence1": "Eh...  No.\n\nI think this is a tourist trap.  The bread is alright, but my roll didn't have that much lobster.  The clam chowder was only so so too.\n\nI'd gone to James Hook & Co Lobsters earlier, so I think I'd been a little spoiled.  James Hook is off of the main drag, and it's right off of the water.  It's SO much better.", "label": 2}, {"sentence1": "I was here this past Saturday night. The place was dead and the waitress may have been walking dead; she was very strange and seemed like she could not remember anything.\n\nI had a turkey cobb salad which was mediocre at best. The other guys ordered burgers and they said that they were ok, but nothing to write home about.", "label": 2}, {"sentence1": "Good food- different dishes and cozy atmosphere.  Give this place a try.", "label": 4}, {"sentence1": "In the area, and found on Yelp. Nice quiet, atmosphere. Staff from hostess and wait staff above average. Extensive wine selection.  Had the grilled shrimp and risotto entree which came with a nice salad. The wife had the short rib with risotto which she let me sample. Both choices were well prepared and tasty. Baked apples and ice cream was shared and very nice. Excellent coffee. Food was good quality and value. As always, good wines can increase your tab quickly. \nWould recommend and would go back.", "label": 4}, {"sentence1": "I asked the bartender about the origin of the \"Terminal J\" lounge thing. Apparently before it was actually called that, airport announcers would say, over the loudspeaker that employee meetings would take place at such-and-such a time at \"Terminal J.\"\n\nI asked him if they sold any Terminal J pint glasses, and he gave me one from behind the bar for free. Jeveli's is one of three things I miss about Beastie.", "label": 4}, {"sentence1": "Really awesome Italian food and the service was fantastic at least...It happened for us to take out the food and they have given us with fresh pieces of breads and the service was again great..this is my second time..Those who love cheese gonna love the place at any cost...", "label": 4}, {"sentence1": "I was eating my rice and a huge roach crawled out. Never again. I used to enjoy their food but now I'm paranoid about bugs in my food.", "label": 1}, {"sentence1": "So now, apparently out of fear of covid, they won't do just nail grinding. They require a full spa treatment, meaning I have to drop off and later go back to pick up. Inconvenient. And how is this any safer for them or for me? Goodbye PetSmart LaVista, or any other PetSmart for that matter. I will remember this even after they stop using covid as a reason to nonsensically limit customers' options.", "label": 1}, {"sentence1": "Wow- small room and super outdated. Definitely not a room like what was shown in the pictures. Can't believe I spent $300 for a night here plus $48 for parking. I understand it's a great location- but I could have gotten a nicer room in a motel for $69. I'm editing to add- make sure you bring your toothpaste and mouthwash- you don't get that here either :/", "label": 1}, {"sentence1": "I was unfortunate to get dragged into the place a while  back by some friends new to austin. The upstairs deck was the only cool thing about it, but any respect t I could have had for the place was quickly destroyed by the bartenders who served other people that had not been waiting as long as me. I guess you have to have a popped up collar to get a  drink in this place.", "label": 1}, {"sentence1": "Went here for a random date night. It was so much fun reminded me of my childhood and spending countless hours on Super Nintendo. The bartender\nThere was super nice. I had the pizza and it tasted pretty good. The whole place was decorate with gaming stuff which is pretty awesome!! I will definitely be back here..", "label": 5}, {"sentence1": "Great happy hour. Nice seating outside with firepits. Employees seemed nice too. The five buck mixed drink was pretty strong. Thumbs up!", "label": 5}, {"sentence1": "I am a property manager and call them for any and all of my tenants appliances that have issues. They are almost always available same or next day. Polite, professional, clean and most of the time repairs are complete the same day. \n\nThe prices are more than fair, and they allow me to pay over the phone which is super convenient for both me and my tenant. Highly recommend.", "label": 5}, {"sentence1": "Amazing place! Great ambiance & very vegan friendly (as are most places in Boulder). The Spicy Peanut Noodles are delicious and definitely have a kick. Will definitely go back next time we're in the area!", "label": 5}, {"sentence1": "A solid Fenway staple! It's a great spot to stop by before or after a game. Get here really early because the closer it is to game time, the more packed the bar is. It's a fun atmosphere because everyone is celebrating the Red Sox and people are in true party mode. It's a couple grades above a dive bar but still very casual.", "label": 3}, {"sentence1": "This is a difficult review because the Cuban sandwich I had was terrible, but my wife's Turkey BLT croissant was exceptional. If the Cuban wouldn't have been soo bad, I would have given them four stars. In addition, our waiter  Gilberto, was hands down, one of the best we have had on a Disney property. Gilberto even went in back to fix-up a special sauce to meet my finicky pallet. The prices at this place are affordable in comparison to other Disney resorts and food establishments inside the park (Shades of Green).", "label": 3}, {"sentence1": "The staff needs to choose their words wisely when speaking to customers. If someone wants food replenished, they shouldn't be harsh and reluctant to provide. Overall, the location is great and food is above average but employees seemed unenthusiastic.", "label": 3}, {"sentence1": "It's not a bad place for a burger if you're in the area. Decent selection at the fixings bar for your burger and the staff was friendly enough but it's still not in the same league as a FiveGuys or Smashburger", "label": 3}]