[{"sentence1": "Delicious food but slightly overpriced. Definitely a place to go if you want to razzle and/or dazzle a date.", "label": 2}, {"sentence1": "It was okay.  Way too salty. Not worth driving across town for.   We probably won't go back.", "label": 2}, {"sentence1": "Bagels are good, but disliked the atmosphere and general vibe. Also, my bagel with egg and cheddar took 20 minutes to come out, after 15 minutes of standing in line just to order. I could've eaten at almost any sit down restaurant and gotten my food faster. It would've helped if the waitstaff had been even semi-friendly too. But with all of this, I definitely won't be back.", "label": 2}, {"sentence1": "Overpriced menu with mediocre quality.  \n\nIf you want a high quality breakfast, go to First Watch - better food than Kekes at a lower price.  If you want to save money, go to IHOP/Denny's - similar quality to Kekes for a fraction of the price.\n\nAvoid the omelettes.  They're really unimpressive, not well constructed. \n\nFrench toast was a small portion with no sides for $9 and up.", "label": 2}, {"sentence1": "I am a fan of Genoa and knew that Accanto couldn't be bad, but it has exceeded my expectations.  I had the cod special and it was perfectly crisped on the outside, tender and flaky on the inside.  The accompanying potatoes were creamy and extra buttery but by no means was it heavy.  De-lish!", "label": 4}, {"sentence1": "oh man.   these donuts are so damn good.   the coffee blows, but it comes in extra large.  the donuts are buttery, fresh, and sweet, and the grill food is pretty good too.", "label": 4}, {"sentence1": "First, important to know it's inside the Boston Public Market. Second, the ladies making the crepes are super nice.  With regards to the crepes, my daughter had the cinnamon bun crepe waffle, she loved it!  I had the caprese crepe and it was okay; the shredded mozzarella wasn't melted, they use a lot of what tasted like balsamic dressing, may be better without the dressing or with pesto...  definitely would have been better if the cheese was melted.", "label": 4}, {"sentence1": "This restaurant is so good. My husband and I often come here whenever we go to Orlando. \"Bun cha Ha Noi\" and \"bun chat ca\" are really delicious. Highly recommended.", "label": 4}, {"sentence1": "Good food, terrible service, expensive. Waited 25 minutes for a strawberry milkshake.", "label": 1}, {"sentence1": "Every store had a horrible moldy smell. This was by far the worst mall I have ever walked into ! Sure if you can stand the smell go for it.. Many vacant spaces and Macy's had no upscale brands. Dillard's was the worst... The mold smell was overwhelming and I had to leave immediately. Bring a barf bag!", "label": 1}, {"sentence1": "Just went here and havent been here in ages. Wasnt what I remember. I remember them as fast and yummy. The orange chicken was congealed and tasted like safeway deli food. The cream cheese puff things were cold and gummy. 100% wwant my money back so i can move past this and never come back.", "label": 1}, {"sentence1": "Their auto delivery is impossible to stop on their website . They have no button for ending all deliveries. You can only temporarily cancel the auto delivery. Called their 800 number and was on for 10 minutes . Hung up.", "label": 1}, {"sentence1": "Great spot for a delicious breakfast sandwich. Sausage (or ham or bacon) egg and cheese on a roll or bagel for less than $5. Super friendly staff working behind the counter. Looked like they also were preparing some pretty delicious looking lunch sandwiches as well, so I might check that out at some point. Good, affordable breakfast spot (especially given its location in otherwise expensive Harvard square)", "label": 5}, {"sentence1": "Such a delicious and unique offering! Menu is limited because what they do they do WELL. The owner is friendly, the beers are $3 (for good options including microbrews), and there's free barley tea. Highly recommend!", "label": 5}, {"sentence1": "Tried the hotdog with chili and onions as well as the megafries.  The Hot dog was great and the megafries were loaded with bacon and cheesy goodness!  The toppings were fresh and the service was fast!  Don't leave without trying the megafries!", "label": 5}, {"sentence1": "This place is awesome. Their crust is filling but the consistency is light (it's how they cook them in Italy). Also, the peppers were crunchy and fresh. I will be ordering again (try the \"Slice\" app). It's cheaper for you AND the restaurant.", "label": 5}, {"sentence1": "I could not hold back anymore and had to stop my Ethiopian craving (the food, not the people, I am NOT a zombie). I was downtown and Ethiopian pickings were slim.  I got my usual vegetarian combo, full of all kinds of legumes, potatoes, cabbage, collard greens, spices.  I tried to not eat so fast hoping my belly would tell me to stop when full. It didn't happen. I ate it all again! It's a huge amount. Had no room for dinner. Best of all though, craving all gone too.", "label": 3}, {"sentence1": "Just wanted good coffee, place was cool looking. White mocha was okay. My husband got the hot coco which was delish. Wish they had more of a selection. Guy at the front was a little bit of an asshole.", "label": 3}, {"sentence1": "FYI- the assistant manager DID reach out to me and I DID talk to her on the phone and the entire time she was defending their pricing and not once apologized for the injury my dog sustained. She also added \"well I'm sure you didn't watch the play cameras all day did you?\" I replied with \"actually yes I did and I saw my dog play for 10 minutes.\" Her response?- \"oh you're one of those crazy moms.\"\n\nFantastic way to smooth things over!", "label": 3}, {"sentence1": "all the veggies and fruits are really fresh and the meat looks always clean.", "label": 3}]