[{"sentence1": "sweet tea was good, rice was fabulous. people were really nice, and caring. that's about it tbh. small selection of food.", "label": 2}, {"sentence1": "Typical smokey dive bar karaoke joint.  Usually these places are lots of fun, but this one has a cranky KJ who doesn't use the usual list/tip method for assigning people.  His buddies get to sing 2 or 3 times per rotation while everybody else waits.  Good, cheap drinks, though!", "label": 2}, {"sentence1": "Food ok. Hostess was super rude. She threw menus and silverware.", "label": 2}, {"sentence1": "Disappointing.  In the first place, a restaurant should be cleaner... regular dusting and cleaner bathrooms.  The food was so-so...  taste was not bad, merely okay.  As for me, their special Masman Beef Curry lacked as the beef appeared and tasted to be a low-quality meat.  Basically, I've had A LOT better at other local Thai restaurants.", "label": 2}, {"sentence1": "Big boys did a great job on my bmw ! Even cleaned it! Professional and on top of everything! Definitely recommend. Only complaint was time but they were professional about that as well. Definitely recommend.", "label": 4}, {"sentence1": "Very decent meal. I ordered vegetable lo Mein, vegetable fried rice, and the broccoli in garlic sauce. All were good quality and very filling. The broccoli was a little over cooked in the sauce but it was still a delicious meal.", "label": 4}, {"sentence1": "Fabulous roast beef and I mean truly great...however...lobster roll was terrible. Not fresh...not tasty...not good at all. Stick to the roast beef it's what they do best.", "label": 4}, {"sentence1": "Okay - I've heard of this place before, but never had the chance to stop in here before today. A colleague and I stopped in here on a sales call and we were both taken away by the beauty of all the furniture that is in this store. Jon, the sales manager was very informative and was there to answer our questions. There was alot of beautiful items for the home. I will definitely be stopping by again to shop!!", "label": 4}, {"sentence1": "Rude employees...Didnt get order right and when i told them thats not what i ordered they insisted it was. All i got was some noodles and some red sauce thrown on top. Didnt fit the description at all.", "label": 1}, {"sentence1": "I've gotten better steak from fast food places, I asked for medium well and got a rare steak with blood still dripping out of it, also the plate was 54$ and did not fill me up. Would never come back here ever again. The service was good but the food itself was awful, way too overpriced do not recommend to anyone.", "label": 1}, {"sentence1": "Terrible service. Server didn't even bother coming over, too busy talking with her friends.", "label": 1}, {"sentence1": "I stopped in this afternoon to see what all the shouting was about.  It's a nice store with not a terribly large selection but the prcies...WOW!  $2.75 for a cupcake.  Geez!  Too rich for my blood.  \n\nWell, not only were they expensive, they were also STALE!  I had to take mine back today.  It was either that or throw it out and I wasn't going to let them off the hook that easily.", "label": 1}, {"sentence1": "Trader Joe's is a dream for people with special dietary restrictions and preferences. \n \nJust stop by the customer service desk (on the far left wall) and ask for a shopping list that is tailored to your needs.  I know they have lists for gluten free, vegetarian and vegan diets; there may be others too.  Everything on the list has been vetted by Trader Joe's so there's no need to check labels.  You can quickly walk through the store and pick out products you want.  Super convenient.", "label": 5}, {"sentence1": "100% the best restaurant on the South Shore. Fresh and made to order every time. A family business. The only complaint I have is that I wish they would pave  the back parking lot! My favorite dishes are the Eggplant Wrap, Strawberry Chicken Salad, and Beef/chicken kebab dinner. Their pilaf is the best. Just truly- go there (unless it's Sunday- then they're closed)", "label": 5}, {"sentence1": "Second time coming to this restaurant was today! Tried something different than the first and it was amazing just like the first meal I ordered! Bon noodles are my favorite right now! The spring roles are delicious, especially the one with cream cheese and shrimp! Next time on Wednesday when I go, I'm  going to give their special Wonton Wednesday a try! To add, the atmosphere to this restaurant is pretty neat! Pretty cozy and laid back! I always recommend this restaurant to family and friends!", "label": 5}, {"sentence1": "Great food and atmosphere. It was our first visit to the restaurant  time and we were pleasantly surprised. Jessica, the server, was wonderful. We haven't had any luck with the restaurants in Medford square, and this restaurant really made it for us. Thank you for the great dinner. We will be back and try some other dishes.", "label": 5}, {"sentence1": "Got Migas wrap. Small portion. Lukewarm food. Nothing special. Food truck would've been better.", "label": 3}, {"sentence1": "One of the places opened on Christmas Eve. We were desperate for food. Glad they were open. The service here is great. I ordered the stuffed cabbage rolls. I feel like the meat stuffing could've been seasoned better. Tried a bite of the liverwurst sandwich. It was ok. We ordered the matzo ball soup. It was my first time trying matzo ball soup so I can't really compare. I'd maybe come back and give it a second try. I definitely want to come back and give breakfast a try.", "label": 3}, {"sentence1": "they're super cute but the nail tech was new to gel and it's uneven/bumpy and missing some areas of nail. would come back, but would request a nail tech who has more experience with gel next time", "label": 3}, {"sentence1": "I was thrilled about gluten free ramen and the corn and pork belly was amazing, I mentioned it several times throughout the meal! Yet, they didn't have any spicy ramen and the only thing to add spice is  chili paste which is not spicy, more flavorful than anything. For the price of food the service could be way better, our waitress disappeared and only came back to deliver the check. Probably will not be returning but I won't tell people not to go...unless they want spicy ramen.", "label": 3}]