[{"sentence1": "s'alright, s'alright.  The Margaritas are definitely the strong point of the menu.  \n\nSalsa is a bit watery but I like you can order it mild/medium/hot, also the case for most dishes.  Is that a good thing or do they just add extra spice at the last minute?\n\nWe ordered the fajitas, which taste exactly like those at Border or any other tex-mex place for that matter.  Also had a taco, enchilada, and a flauta- all tasted the same.\n\nOnly came here because of a New England Perks coupon, plenty of better mexican places around so we won't be back soon.", "label": 2}, {"sentence1": "Wow came here today and ordered the Lobster Mac and cheese and only got 3 small pieces of lobster! $15.99 so not worth it. I am so disappointed because the last time I was here it was as so good and I couldn't wait to have the lobster Mac and cheese again. We came all the way from Salem but after today I doubt we will do it again.", "label": 2}, {"sentence1": "This part of town has little to offer in the way of Korean food. I wanted to like this place but really it's probably just better as a sushi restaurant.\n\nOrdered the rock bibimbap. First off, it's $13. It's white rice and vegetables with an egg. No spices, nothing. The pricing is absurdly high. Other things I've ordered were overpriced and too salty. \n\nIf you're interested in Korean food, I guess your only option is to go to North Lamar.", "label": 2}, {"sentence1": "This place is dirty, time consuming, and far too in love with crappy patriotic \"antiques\" and slowly dying to justify it's existence. \n\nWe ate here and I was far from pleased. It was crowded, I had elbows in my face, a disinterested waitress, and subpar food. I live literally across the street and I won't be coming back unless it's with a bottle of Lysol for my table and the dolls.", "label": 2}, {"sentence1": "We went there the other night for dinner. The service was very good and the food was excellent. They have a nice patio for the summer evenings. Great new non-chain option in Louisville.", "label": 4}, {"sentence1": "Great pastries and coffee. Didn't have the pastry we wanted but if you snooze you lose! \n\nGet in early, awesome that it's right next to the Sheraton while their preparing a new market to replace the Starbucks.", "label": 4}, {"sentence1": "Had some pie because I was there at an odd time. ..it was pretty meh. I think they microwaved it to make it warm, so the top crust was soggy. My friends' nachos looked pretty good though, and they all enjoyed their beer.", "label": 4}, {"sentence1": "I've been to Atlanta Airport so many times, but somehow I missed this little takeout deli by Food & Wine Magazine.\n\nSalad, sandwich, wrap, and coffee. I picked up the Pho, they fill in hot water for you, fresh spinach, beef, it was solid, hit the spot when you get a cold.\n\nThe Caesars Salad wasn't good. The chicken was dried. The cherry tomato looked old. So I ate the romaine lettuce only.\n\nCafe Latte was ok. Service was wonderful by this gal, polite and helpful. I'll be back if I'm at this terminal D again.", "label": 4}, {"sentence1": "Literally the worst HEB I have ever been to. When we went to check out, they only had\nFour lanes open. It wasn't the end of the night, there was still 4 hours left in their day. When we were checking, a full cart I might add, we found out they didn't have SHOPPING BAGS!!! You have to buy reusable bags from them. I just found that to be insane and very inconvenient.", "label": 1}, {"sentence1": "Paid for a cosmetic treatment in 2018 at the time of treatment. They billed me again for it, never called me, emailed me or reached out just sent it to collections. My credit score dropped and this will be on my credit report for up to 7 years because of their negligence.", "label": 1}, {"sentence1": "I really wanted this to be my morning coffee shop. It's the closest coffee place to my work. Tried going there about 6 times. Every single time it took about 15 minutes to go through 5 or 6 people. The people that worked there didn't really seem to care and goofed off with each other instead of make people drinks. The last time I went I waited 15 minutes in line and when I was about to make an order the coffee girl walked away messing with the iPod or music, I waited for  minute and bailed.", "label": 1}, {"sentence1": "Bad experience tonight. We originally had reservations for 6:30.  They called and moved it to 7.  Got there and they had no clue.  We waited 20 minutes for a bad table.  Wait person was bad and food was iffy at best.  Won't go there again.  Don't waste your $.", "label": 1}, {"sentence1": "Excellent food & great service. Fantastic for business &/or pleasure. Try the flaming chorizo, manchego cheese plate & the peppers. Everything was delicious.", "label": 5}, {"sentence1": "I just attended my first spin class at Define today and had an awesome experience! I'm pretty picky when it comes to spin classes (I'm a huge fan of CYC, Ride & Soul Cycle) & this class definitely challenged me! It's another rhythm based class & the music was intense. Also, the instructor combined a lot of ab, arms and intense leg work. Great cardio too! \n\nThe studio itself is brand new and everyone was so welcoming! I am looking forward to trying their other classes!", "label": 5}, {"sentence1": "Ignore all the people that bitch about the way the system is set up, it works. We came here off all the reviews and the title Best cheap eats, and so glad we did. The line was long, but we got our food quick and it was SOOOOO good. I scarfed down the coconut curry and my husband who is such a food critic loved the luc lac. Such a great find, will go back next time we go!", "label": 5}, {"sentence1": "This place was delicious. I would come here again. 3 of us with 11 dim sums was $40 total. Tip not included. We tried as many different things our stomachs would allow. Chicken feet, short ribs, shumai, sticky rice, sesame balls etc. I enjoyed it all. Can't wait to go back.", "label": 5}, {"sentence1": "Pho broth is decent. Banh Mi's were not overly toasted making the bun nice and soft and I also enjoyed their\nspring rolls. However, the food takes way too long to make and serve. There was what looked like a piece of bread in my water and hair on my chopsticks.", "label": 3}, {"sentence1": "Eh, it's alright I guess. I mean the only major complaints I would say are the bathrooms; they sometimes have puddles of piss on the floor and used paper towels thrown all over the frickin' place. Also, the prices at the snack bar are better than the prices at Tinseltown or Cinemark. The chairs are nice but their usually is not enough room in the auditorium. I only go here when I have a dinner and a movie night with my parents, So I would not make a special trip for it.", "label": 3}, {"sentence1": "Food was great, large portions, & some delish and hearty options. But not good enough to make up for the wait staff, where slow service and gossiping seem to be the norm. It was very uncomfortable to witness the passive aggressive give and take between serving staff and bartenders/kitchen/boh. Happy hour seemed decently priced but as our server forgot about us we decided to just pay and get out. But good food!", "label": 3}, {"sentence1": "This was ok, a little pricey. Was disappointed that a Downtown DISNEY restaurant does not include a drink or a dessert with their 8$ mac and cheese KID's meal. The kid's drink is the same price as an adult drink (both lemonades, one half the size of the other). So it turned out quite an expensive mac and cheese. I recommend splitting an adult drink for 2 kids to save some $$. My other son had the most ordinary hamburger ever. Adult meals were ok.", "label": 3}]