[{"sentence1": "I wanted to see it because of two reasons. One, it was the remake of High Sierra with Bogart, two, the Bogart part was played by Jack Palance, whom can play dramatic roles with some subtility, as in The Big Knife.<br /><br />But now I wonder why they decided to shoot this remake. The film follows the same plot as Hig Sierra; only here, the actors don't care, the director is lost in his thoughts, and who knows what the producer was thinking. Jack Palance is getting bored looking at Shelley Winters and Shelley Winters is asking herself what she's doing in this film. I don't even want to compare her to Ida Lupino in the same role. And of course, they had to use the dog story again! They surely could have come up with some different ideas. Perhaps the color makes it nice to see the same location where they shot High Sierra, but that definitely doesn't add any quality to the film.<br /><br />It's a waste of time if you've seen High Sierra before. Otherwise, why not see a pseudo-film noir. As for me, I'd rather die than see it one more time...", "label": "negative"}, {"sentence1": "Hilarious, laugh out loud moments ... and yet not a comedy. I particularly liked the planted gag of the ambulance soaking the \"filthy bum\" who then shouts after them in anger \"you filthy bums\", I mean wow, someone's online degree in literature is paying off! The worst script imaginable, with plot introductions in an instant, ridiculous movement in the story, ZERO character development (even between the characters who meet .. it's as if they all have known and trusted each other for years) dodgy voice over with added echo effects, and plot holes.. oh God are there plot holes!! To be honest I write this not even having watched the entire thing, but I certainly expect the last 30 mins or so to not exactly enhance the already pathetic attempt in cinema ... thank god we've got a good looking lead to somewhat make us forget that the film is a load of ... well ... use you imagination for the conclusion of that particular sentence!", "label": "negative"}, {"sentence1": "Okay... it seems like so far, only the Barman fans have commented on this film - time for a counterpoint. Beware, this writeup is *LONG*.<br /><br />For those not in the knowing (mostly the non-Belgians) : Tom Barman, director of this film, is the frontman of dEUS, one of the better known rock bands of the late 90's here in Belgium. Basically, they made a couple of very adventurous and innovative albums and quickly rose to fame on the national scale. Then, egos started hurting and the band basically fell apart, with Barman and a couple of others remaining to go on making albums under the dEUS-monicker. The way it always happens in such cases, the post-breakdown dEUS was a lot tamer and less interesting than the original. They tried to go for an international breakthrough with their album \"The Ideal Crash\" in 1999, presenting a much diluted form of their earlier style of songwriting. They didn't quite make it. However, egos were still pretty big it seems : big enough for Barman to consider himself enough of an artist to try on movies.<br /><br />More often than not this sort of thing is a VERY big mistake, and this film does not make the exception. And Barman clearly went for *art* on this one, another very big mistake. For one thing, he's a musician, not a movie director. For another, dEUS at it's best made fun and provoking music, but never anything close to what I would consider *art*. It shows.<br /><br />So, what's this movie about? Basically, it tells the story of a bunch of completely uninteresting people, doing equally uninteresting things over the course of a totally uninteresting friday in Antwerp, as even more uninteresting stuff happens to them in the act of being uninteresting. The characters are shallow, the plot totally pointless and the film just doesn't have any other redeeming qualities to make up for these shortcomings. Humor? The whole film made me smile (slightly) about 3 times, and actually managed to provoke a single 5-second laugh (not quite loud). Mood? The film just doesn't seem to show any kind of emotion or feeling at all. Mystery? Well, (*MINOR SPOILER*)the idea of the \"wind-man\", inspiring the name of the film, is as enthralling as a banana pepper pizza - not very, and has been done a thousand times before (anyone remember Johny Destiny - one of Tarantino's worst appearances on film to date)(*END MINOR SPOILER*). And well, its *artistic*, so don't expect any kind of real action to make up for all the previous. In other words, except for the few smiles, it bored me out of my shorts.<br /><br />So what remains? Well, the soundtrack is pretty good, though it suffers from some of the same problems that other OST's have shown lately : first, it makes the movie seem like nothing more than a commercial for the CD. Second, it gives the impression that Barman is trying to hide the weaknesses and lack of emotional content in the film behind the content quality of the songs, which simply doesn't work. In the end, it makes the film look like nothing more than an illustration to the songs. And sadly, it's Barmans own contribution to the soundtrack which gets the most attention, though it is the weakest part of the whole soundtrack as far as I'm concerned. All in all, it just stands to show that Barman knows more about music than movies. Camera work is okay as well, though not anything that would make you scream out with joy.<br /><br />The only thing about this movie that kept me watching was the sight-seeing factor. Since I originate from Antwerp, it was fun to play a kind of \"guess-the-location\" game. I would hardly consider this as a quality though.<br /><br />All in all, another chance lost for Flemmish film. I keep on noticing that lately, the best Belgian movies have been coming from the French part of the country. This is mostly because at least, they have something to tell and manage to tell it in way that is both sharp and emotional (the brothers Daerden come to mind). Maybe the Flemmish art-house filmmakers should try that too.", "label": "negative"}, {"sentence1": "For those who commented on The Patriot as being accurate, (Which basically satanised the English), it was interesting to see this film. By all accounts this was the bloodiest war that Americans have ever been involved in, and they were the only nationality present. It was therefore very refreshing to see something resembling historical accuracy coming from that side of the Atlantic that did not paint America as either martyrs or saviours. All in all though what this film did bring home was the true horrors of any conflict, and how how whatever acts are committed in war only breed worse acts, often culminating in the suffering of the innocent. This was not a film where you cheered anybody on but both pitied and loathed all.", "label": "positive"}, {"sentence1": "This, for lack of a better term, movie is lousy. Where do I start......<br /><br />Cinemaphotography - This was, perhaps, the worst I've seen this year. It looked like the camera was being tossed from camera man to camera man. Maybe they only had one camera. It gives you the sensation of being a volleyball.<br /><br />There are a bunch of scenes, haphazardly, thrown in with no continuity at all. When they did the 'split screen', it was absurd. Everything was squished flat, it looked ridiculous.<br /><br />The color tones were way off. These people need to learn how to balance a camera. This 'movie' is poorly made, and poorly done.<br /><br />The plot - You got to be kidding. If I was an SS agent, I'd sue the producers. looked like the Marks Brothers with radios and guns. Sutherland was in his '24' mode - I can see this for free. Eva Longoria would have been better with a little less on, and a lot more showing. As an action bimbo she wasn't much.<br /><br />I couldn't see a real plot, other than Douglas boinking the Presidents wife. Never did say why the mercenaries were trying to kill the pres. I just don't see the President of the United States running for his life in the utility tunnels of a building, like a rat in a maze. p-l-e-a-s-e.<br /><br />Hollywood is dead. This movie is the proof. I like 'the big screen'. Have since I was a kid. Many more 'movies' like this and I'll quit going. Whats the matter Hollywood, made so many chick flicks, forget how to make a real movie? If I owned a theater, I'd start running the old movies. The one with real actors, good story lines - and good Cinemaphotography.<br /><br />This 'movie' is a dog. Don't waste your time or money on it. I rate this 'movie' a zero! Douglas isn't suited for this role. I can over look his age, but his just is to much of a wimp to carry this off.", "label": "negative"}, {"sentence1": "Elvira Mistress of the Dark is just that, a campy concoction of fun, sex appeal, horror and comedy all poured into a low cut black gown and toped with a sky high black bouffant hair-do. This movie is sure to delight any fan of Elvira's. It takes you upclose and personal with Elvira and probes deep into her...um past revealing her enormous... ancestry.<br /><br />The movie takes you on a ride with Elvira as she goes from TV Horror Hostess with the Mostess to her home town of Fallwell Mass to claim her inheritance from a deceased Great Aunt. Where she encounters a stuffy town, a studly cinema owner, a creepy Great Uncle who seems to be after her for more than her good looks. A slew of high school kids that immediately love her, and a town board who are will do anything to get her out of town, even if it means burning her at the stake! Watch Elvira woo the kids, stalk the stud, avoid her creepy Great Uncle and thumb her nose at the stuffy uptight 'preservatives' who have no kind words for her, in Elvira Mistress of the Dark!<br /><br />As Elvira would say \"I guarantee it'll be a scream! (screams in background) Whoa! Good thing I didn't say it'd be a gas!\"", "label": "positive"}, {"sentence1": "What a wasted opportunity to actually make an interesting film about a complicated subject. There is very little exploration about what it really feels like to be a straight (or gay) man working in a gay sexual environment.The dancers keep talking about their art as if it has no erotic component. They may not all be prostitutes for hire, but they are indeed sex workers playing out fantasies and selling private sessions where more than dancing is offered. From the film one would get the impression that they mainly appeal to the women who go to the gay clubs and then end up hiring the \"dancers\" for private sessions. Even the shots in the club only show women in front of the stage and the \"dancers\" only playing to the women in the audience. This just isn't the reality of these clubs. It would be pretty hard to make a living doing private dances for straight women and couples. So what do they really feel about their gay admirers and clients? We learn very little. Instead we get filler. A gay activist who adds nothing to the study of straight dancers. A manager who tells us about the costumes for the drag acts but offers no insight into the dancers' lives and attitudes.<br /><br />The pictures of Mexico City are generic. The phallic montage showing sausages roasting is ridiculous.<br /><br />This is a totally simplistic film which should be of interest only to those who want to see a few pictures of pretty boys dancing. The rest of the movie is an insult to gay men.", "label": "negative"}, {"sentence1": "This show is awful. How is George wanting the death of his mother funny? This show is terrible. The parents are obviously horrible and the children should be taken to child services. The daughter is a witch with a b and the son is just a complete brat. George isn't funny, especially when he speaks his loud and obnoxious brand of Spanglish. Ernie is a loser, but at least I've chuckled at him a few times, but mainly at how pathetic he is. George's mother, Benny, in an awful, despicable character. Sure, her husband left her, but how anyone can laugh at the way she treated George as a baby is beyond me.<br /><br />Can someone explain to me how George's head being big is funny? It's not even that big! I've moved on from characters because they're too awful and it would take hours for me to write and I, frankly, don't care enough. I do care enough to tell anyone looking at this and wondering whether or not they want to watch this show, that this show is an abysmal excuse for a sitcom, and is not worth your time.<br /><br />I give it 2 starts, because the wife is extremely attractive.", "label": "negative"}, {"sentence1": "There are good ways to make a movie and bad ways and this very much the former. This short caper exacts nothing more than what it gives to the audience. It presents a simple story, told very plainly with enough wisecracks to keep you going, then just gets better and better. Clooney's cameo is funny and very welcome but the leads including Sam Rockwell and Luiz Guzman can easily make it on their own. Likeable and funny, hilariously so towards the end, Welcome to Collinwood is a welcome addition to the heist genre.", "label": "positive"}, {"sentence1": "THis movie may be the worst movie I have ever seen. Basically it is right above Leprachaun 5, the only difference is that it missing Ice T. The scene where he does the chick with the carrott...priceless. Oh yeah they made a second one, genius", "label": "negative"}, {"sentence1": "Hilarious film. I saw this film at the 2002 Sydney Gay and Lesbian Mardi Gras Film Festival, and laughed from start to finish. The acting was subtle but very funny. I'm not entirely certain about \"The Real World\" influence, we don't get that here, but the film holds up without the understanding of that show. Heather B steals every scene she appears in, most notably when acting with her seldom talkative red co-star. Highly recommended. I'd love to see this released on Video/DVD some time in the future.", "label": "positive"}, {"sentence1": "I'm a big fan of horror flicks, and zombie films are a particular favorite of mine. That said, Zombi 3 is one of the absolute worst films I have ever seen. So needless to say I really enjoyed it, it's the best bad movie I've seen in a long while. The story has some similarities with Dan O'Bannon's \"Return of the Living Dead\", but whereas that film was intentionally funny, this one is the opposite. It has some of the most laughable acting I've ever witnessed, especially from the main scientist character. His scenes with the General were just hysterical. Also, the effects are subpar and in many cases sloppy, and the death scenes are often just downright stupid. This, of course, makes it all the more fun. POSSIBLE SPOILER - The worst is the scene where the guy opens the refrigerator door and sees the severed zombie head, which then opens its eyes and somehow FLIES OUT OF THE FRIDGE (obviously pulled out ineptly with a bit of string), latching onto the guys neck, killing him. Zombie heads have the ability to float in the air now? It defies every law of physics known to man, and it's one of the most absurd things ever filmed. That's just one of many really goofy moments in the idiotic mess. I can't believe it's gotten so high a rating here. If you are a fan of bad movies, do yourself a favor and rent this sucker.", "label": "negative"}, {"sentence1": "I very much looked forward to this movie. Its a good family movie; however, if Michael Landon Jr.'s editing team did a better job of editing, the movie would be much better. Too many scenes out of context. I do hope there is another movie from the series, they're all very good. But, if another one is made, I beg them to take better care at editing. This story was all over the place and didn't seem to have a center. Which is unfortunate because the other movies of the series were great. I enjoy the story of Willie and Missy; they're both great role models. Plus, the romantic side of the viewers always enjoy a good love story.", "label": "negative"}, {"sentence1": "1991 saw the release of the two best sequels of all time: TERMINATOR 2: JUDGMENT DAY and BILL & TED'S BOGUS JOURNEY. Out of the two, I've always liked BILL & TED'S BOGUS JOURNEY a bit better. TERMINATOR 2: JUDGMENT DAY is the better made, but there's just nothing like Bill and Ted. Besides Chris Farley and David Spade in TOMMY BOY, it's hard to think of a greater comedic duo than Bill and Ted. They are one of a kind.<br /><br />Seemingly influenced by National Lampoon's O.C. and Stiggs, Bill and Ted were created by Ed Solomon and Chris Matheson, two incredibly talented writers who invented the duo while performing at a local theater in L.A. back in the 1980s. The two quickly began writing a screenplay about two and before long BILL & TED'S EXCELLENT ADVENTURE was born. The film, shot in 1987 and released in 1989, became a big box office success and an instant cult classic. It wasn't long before work began on the sequel. Stephen Herek, the director of 'EXCELLENT ADVENTURE' wasn't keen on working on the sequel since he considered it to be too mean-spirited and unlike the first one so Peter Hewitt, making his feature film debut, was brought in to direct the sequel. There couldn't have been a better director for the job. BILL & TED'S BOGUS JOURNEY is marvelously directed. It's filled with its own unique style and energy that can't be matched.<br /><br />What makes 'BOGUS JOURNEY' one of the best sequels ever is that it while it is darker than the original, it is just as fun. It doesn't change the characters like most sequels do. Bill and Ted are the same lovable characters that they were in the first film. This is because it was written by the original writers. Most sequels are not written by the same writers as the first one, but since 'BOGUS JOURNEY' had the same screenwriters, it ended up being just as good as 'EXCELLENT ADVENTURE' if not even better. Just like the first one, 'BOGUS JOURNEY' is absolutely hilarious, well written, fun, and above all, original. It's filled with spectacular special effects and fantastic comedic performances from Alex Winter, Keanu Reeves, and William Sadler. It's an unforgettable 'journey'. 10/10", "label": "positive"}, {"sentence1": "I wondered why John Wood was not playing Dr. Falken until I watched the film. BAD plot, bad science, bad acting and overall a bad film. Please don't watch this film. Rent the original \"War Games\" if you are feeling nostalgic.<br /><br />I didn't like the bending of the plot to beat-the-terrorist-threat idea either. In the first film W.O.P.R was built because Russia had 1000s of warheads pointed at the U.S.A. In this film the idea behind the computer was to kill terrorist in training before they are a threat. Politics aside, one of the good thing about the first film was the highlighting that even a stupid computer could grasp the idea of the pointlessness of war in the end. No such insight is offered in this film.", "label": "negative"}, {"sentence1": "There were good performances by Robin Williams and others but the movie was dull overall and very disappointing compared to the positive reviews.<br /><br />I thought Sy might become a serial killer who bores people to death: a forlorn guy in ugly clothes trails his victims around food courts, quoting Oprah and reciting his medical history until they beg him to shoot them.<br /><br />I think the movie mostly appeals to egomaniacs who think strangers are interested in their photos. I expect most retail workers want a break from the customers.", "label": "negative"}, {"sentence1": "\"Like the first touch of pleasure and guilt, like a spontaneous youthful flirt of fascination and fear, like a climax of contrary emotions\" said one of the movie buffs after viewing LOVE AT THE TOP, the misinterpreted title version of stylish director Michel Deville's LE MOUTON ENRAGE. <br /><br />Vincent Canby in New York Times, however, just after the 1974 premiere of the movie stated: \"LOVE AT THE TOP which opened yesterday at the 68th Street Playhouse, is a 1973 French comedy that dimly recalls a number of nineteen-fifties English comedies about the rise and rise of cynical young men possessing\u0097and possessed by\u0097ambition.\" Yet, the significant difference that he mentioned was the fact that LOVE AT THE TOP is not concerned with the English class system...(January 27, 1975)<br /><br />Having left the evaluations up to single individuals, of course, the test of time has done its just job. What may be said with certainty after more than 30 years is that we can hardly find such movies like LE MOUTON ENRAGE where decadence appears innocent, where liaisons appear youthfully enthusiastic, where feelings occur so manipulative. <br /><br />For Romy Schneider's fans, it seems useless to point out that this film is a must see, not only because she gives a unique performance (as she did in all of her roles) at the heyday of her career (9 years before her sudden death) but because she is particularly attractive here. It is not TRIO INFERNAL where the, so to say, 'forced escape' from and the mockery of Romy's sweet image haunted for years by saccharine Sissi meets its most discouraging manifestation, but a film where the brilliant actress is given a fair role. She plays Roberte, a woman who becomes the object of lust for the story's lead, playboy Nicolas Mallet (Jean Louis Trintignant). It is him who takes financial profits from lustful liaisons. This movie can boast truly memorable and unique shots of Romy and she is given some of her very best scenes. Romy's sex appeal is unforgettable here.<br /><br />Another strong point of the film is its execution of the content with a development of individual perception. Immoral as it may seem, the director makes a perfect use of contrast: conventions vs pleasures, innocence vs decadence, genuine lust vs instrumental affair. Nicola owns most of the features that viewers may like or detest, may find attractive or disgusting; yet, his are the features the viewers must treat seriously, more to say, they are the ones we all must accept. That is why, one is led to a peculiar, gently wild, erotically unique world of the main character. Although he sleeps with lots of women, there are two women that represent a sort of contrary worlds for Nicola: Roberte Groult (Romy Schneider) and Marie-Paul (Jane Birkin). He manipulates them, makes love to them, cannot refrain from both desire for their bodies and desire for money; yet, he perceives them differently. Yet, despite all of this 'adult maturity,' he is emotionally like a little boy who plays with a toy-car on the table - a sort of 'detailed insight into male mind...' in a comedy-like way, of course.<br /><br />Finally, there are very good performances, which makes LE MOUTON ENRAGE slightly underrated. Not only the aforementioned Romy Schneider does a brilliant job supplying the viewers with an extraordinary insight into her role, but young Jane Birkin appears to be convincing in the role of young, inexperienced streetwalker Marie Paul, Jean Louis Trintignant makes it possible to see Nicola in the right way. This artistic merit lying in performances goes with terrific music by Camille Saint-Saëns, the tune that will ring in your ears for long. Therefore, apart from some flaws of the movie like dated colors, slow action (sometimes), possible clichés (noticed by some viewers), the merits should be found significant. <br /><br />LE MOUTON ENRAGE, in sum, is a clear manifestation of contrary manipulative tools in life. It is worth seeing as a moment in Romy's career, a prelude to strong eroticism, a chain of contrary emotions, of love and hatred, appreciation and disgust compared to the first orgasm and the first angasm... But aren't we, humans, 'viewers,' movie buffs built upon such contrasts?", "label": "positive"}, {"sentence1": "This is one of those feel good, Saturday afternoon movies. It's right up there with other retro flicks like Flight of the Navigator. Just a cute movie with some subtle comedy to lighten things up. And it's fun to see how 20 years has changed the stars like Kelly Preston and Lea Thompson. Not to mention Joquin Phoenix.<br /><br />I personally really like movies like this from time to time. Nothing too deep or too scary. Just a nice story line. And I would have never known Mr. Phoenix had I not recently read the credits. He was just a baby really when he made this movie.<br /><br />Kelly Preston was quite the young budding actress then too. She and Lea did a wonderful job in this movie. I agree it's not an Oscar caliber movie. But very much worth watching. Especially if you have kids in the , let's say, 8 to 11 year old range. Or ones that are interested in the space program.", "label": "positive"}, {"sentence1": "I kind of feel like a genius; I feel like I'm the only one who saw through this fake film. I watched it three times, once with commentary, and I found myself getting annoyed at all the close-ups, all the times the screen just blacks out, and worst of all, I feel the film never really resolves anything. Yes, the priest dies, but he didn't really seem at peace with the town that gave him so much grief, or with himself. That and he was an idiot. If it weren't for the commentary by Peter Cowie which explained not only the movie but the book it came from, I wouldn't have been able to stomach it at all. I enjoy French movies, but this is one that was completely absurd.<br /><br />Diary of a Country Priest is filmed in beautiful black and white photography but, that alone cannot save this deadly dull tripe. Scene after scene of extreme close-ups where characters don't say anything until the camera cuts away and goes to a black out do NOT make an interesting or relevant story. How this film ever became a classic is mind boggling: it reminds me more of The Emperor's New Clothes.<br /><br />Yes, Claude Laydu's performance is heartfelt and thought provoking, if you are a sadist, but this film left me feeling empty because overall it is a weak impression of the Catholic priesthood, which is an ignoble and inglorious institution of corruption. The young priest's triumph over the countess's pride is a weak scene but 90% of the film will drag you down with its dreary introspection and window into the young priest's melancholy thoughts. This priest doesn't come across so much as being humble as he does just plain pitiful.<br /><br />Being that I don't speak or understand French I was looking forward to doing the English SUBTITLE thing to help understand the film. Well, the English SUBTITLE is at times impossible to view/read and the text rolls by so quickly that there was much I could not read (and I am not a particularly slow reader - I just finished Dostoyevsky in 3 days). <br /><br />I really wanted to like this film . I try out everything \"chosen\" by the Criterion Collection, and yet can not see why in many ways this one merits some sort of critical nod. However, I sat through this entire two hour film yearning to feel some sort of empathy for the main character, and it never materialized. He just seemed like a victim rather than a fighter. And for that, I say it stunk.", "label": "negative"}, {"sentence1": "I really didn't like this movie because it didn't really bring across the messages and ideas L'Engle brought out in her novel. We had read the novel in our English class and i absolutely loved it, i'm afraid i can't say the same for the film. There were some serious differences between the novel and the adapted version and it just didn't do any credit to the imaginative genius that is Madeleine L'Engle! This is the reason i gave it such a poor rating. Don't see this movie if you are a big fan of L'Engle's texts because you will be sorely disappointed. However, if you are watching the movie for entertainment purposes (or educational as was my case) then it is an alright movie!", "label": "negative"}, {"sentence1": "It's easy to see how this below-average screenplay got by in the early sales-pitch meetings at Regency Films (and later with Fox): cross the superhero genre with a comedic take on \"Fatal Attraction\"...voilà! I don't know how on earth a talented director like Ivan Reitman got involved, unless the pay was just too tempting. A dateless employee at an architectural design firm in N.Y.C. meets a girl on the subway and asks her out; despite the fact she's distracted and unpleasant, he eventually gets her into bed--only to find out later she's the Big Apple's resident superhero, G-Girl. This distaff Superman, with powers bestowed upon her by a fallen meteorite, isn't a fantasy heroine, however...screenwriter Don Payne has conceived her as a needy, possessive, vindictive bitch (he telegraphs this to us from miles away, though Uma Thurman still plays the role for sassy laughs). This is the kind of worthless movie that can't let an insult slip by. Our introduction to leading man Luke Wilson, talking with Rainn Wilson on the train, is accompanied by a sour dig at gays (it prods at us to be assured these two buddies are strictly ladies' men). After being approached by G-Girl's nemesis, who wants to zap her powers, Wilson is told this will make her just an ordinary woman scorned...and isn't that better after all? Thurman's early performances in films like \"Henry & June\" and \"Jennifer 8\" showcased an intelligent woman with angular grace and hypnotic poise; her films with Quentin Tarantino helped expose her sinewy hardness and intensity, but that came at a price (the actress has seemingly lost her graceful touch). The picture is exceedingly well-produced and shot, with expensive-seeming special effects, yet nobody bothered to find the humor in this scenario. It's pushy, leering, ugly, and badly-cast. Bloated, frozen-faced Wilson can't tell any of his co-workers that he's dating G-Girl because she made him swear he'd rather have a chainsaw stuck up his rectum. I wonder if writer Payne actually thought that was hilarious...or, indeed, if anyone involved did? * from ****", "label": "negative"}, {"sentence1": "An excellent interpretation of Jim Thompson's novel, this neo-noir thriller has all the requisite elements--deranged ex-boxer turned drifter, alcoholic widow with sinister desires, ex-cop turned small-time crook, and a kidnap plot destined for doom. Yet, the film never crosses into cliche country, but remains fresh and intriguing. The performances are all superb, particularly Bruce Dern's role as the wicked sleazeball, Uncle Bud. There is a tense uncertainty to the film's movement which, intentional or not, adds to the grim proceedings. Highly recommended.", "label": "positive"}, {"sentence1": "Disney's done it again. The company that made \"Mr. Magoo\" and \"George of the Jungle\" has made another movie that barely resembles the cartoon on which it is based, and keeps none of the spirit of the original.<br /><br />\"Inspector Gadget\" was one of my favorite cartoons when I was a young one, and for a movie of it to exist may have been a dream come true back then. Now that that movie does exist, I was severely disappointed, even outraged.<br /><br />First we have the characters.<br /><br />Gadget himself has the gadgets that made him such a fun character in the original cartoon (with well-done special effects accompanying them), and he even has some of the naivete of the original Gadget, but he is now more competent and is expected to solve the crime himself while Penny and Brain just watch.<br /><br />Penny has little to do; while she played a major role in the cartoon, discovering the crime and halting it, and occasionally getting captured by the MAD agents, now she is simply introduced and then forgotten, although she does at least sneak into Claw's base.<br /><br />Claw is the movie's version of Dr. Claw, who was a rather sinister, raspy-voiced man who wore metallic gloves and sat in his chair, his face hidden from view, as he stroked his cat and oversaw various crimes. Now he is simply a man with a claw for a hand, with no mystery behind the character.<br /><br />Brain and Mad Cat exist in the movie, but are rather insignificant to it.<br /><br />Even small parts of the cartoon aren't spared in this butchering. The famous expression \"Wowsers!\" was mysteriously changed to \"Wowser\", and Gadget's Gadgetmobile now looks different and talks.<br /><br />There is even product endorsements everywhere. Why is \"Yahoo!\" advertised on a sign? Why does the Gadgetmobile have buttons for M&M's or Skittles?<br /><br />Fans of the cartoon will hate it, others might will likely find the movie below par, and when all is said and done, this movie is another attempt to make some quick bucks off another old show.", "label": "negative"}, {"sentence1": "I just went to a screening of the film during Expresion en Corto, a short film festival in Guanajuato, Mexico. One of the producers was there and gave a brief introduction. The Film rolled and from the first shot I was amazed: one long continuous shot of a futuristic Paris in glorious black and white.<br /><br />I shouldn't go on with the details 'cause I think it is a film worth seeing. The sci-fi story might be found average for many... to me was really good. The action is great, the camera is free to fly everywhere and I mean everywhere. Things you would not be able to do or see is accomplished beautifully. The cast performance is good, in my opinion no one hits the wrong note.<br /><br />Now, the thing that I found awesome is the animation. 3D grafics look 2D. A BW comic book brought to life. The details on the backgrounds gives more texture as if it had been done by hand (I'm sure it was but when the angles change you see the depth). <br /><br />The producer at the screening talked about the hard work behind the film: 7 years! The director, she said, is brilliant, but perhaps he was quite unexperienced since he only had one short film in his CV. So, many people had true faith in them. They started their own studio from scratch and ever since they faced the challenge they brought upon them.<br /><br />Don't miss it. I think you won't regret it... maybe Richard Linklater for the final look of this film is superior to his I think.", "label": "positive"}, {"sentence1": "It is very hard to rate this film. As entertainment value for 21st century viewers, it fails miserably. However, for the student of early sound films and history, it is a jewel. \"Show of Shows\" was a revue filmed to compete with MGM's successful \"Hollywood Revue of 1929\", which still survives intact complete with its Technicolor scenes.<br /><br />The purpose of the all-star revue was to showcase a particular studio's silent stars in speaking roles, and show that they could make the transition. However, Warner Bros. seems to have forgotten this and employs many acts and stars that they didn't even have under long-term contract such as Ben Turpin, Lloyd Hamilton, Beatrice Lillie, and even a marching band. Meanwhile, their biggest talent - Al Jolson - is noticeably absent. Even at a high salary he could not be compelled to join in. Almost every act is overly long and the film plays like a dozen or so Vitaphone shorts strung together with no continuity. The finale is also overly long, but it is really enjoyable with all of its dance numbers.<br /><br />The highlights of the film are two numbers from Winnie Lightner - \"Pingo Pongo\" and \"Singin in the Bathtub\", a couple of numbers with Nick Lucas, John Barrymore performing Shakespeare, and the Chinese Fantasy \"Li Po Li\" with Nick Lucas and Myrna Loy. This last number is the only part of the film that survives in Technicolor, and it really is quite attractive. Reasonably enough, the players in these good acts were long-term Warner Bros. stars so perhaps the director knew how to play to their strengths since he was familiar with them.<br /><br />This film acts as a snapshot at an odd point in film history - the year 1929, which was the bridge year between two eras - the silent and sound eras, and the roaring 20's and the Great Depression. Just two years later this same film would have had an entirely different cast, as Warner Bros. would abandon its silent era stars and the stars they hired just to produce the early musicals in favor of those stars that gave Warner Bros. its distinctive urban look and feel - James Cagney, Joan Blondell, Edward G. Robinson, and others.", "label": "positive"}, {"sentence1": "I wasn't born until 4 years after this wonderful show first aired but luckily I managed to catch the reruns of the mid 90's and the rest is history......I was hooked. The premise was pretty simple; two hardened Nemesis agents, Richard Barrett and Craig Stirling ( William Gaunt and Stuart Damon) are partnered up with an expert (if not young) Doctor and Biologist (Sharron Macready) to head behind the bamboo curtain to retrieve a dangerous biological agent from being used by red china. Whilst making their escape, their plane is hit by machine gun fire and they crash in the heart of the Himalayas where their lives are saved by a mysterious and previously undiscovered civilisation who heal and enhance the senses of the trio, thus setting the scene for many exciting adventures to come...<br /><br />The series lasted for 30 hour long episodes and I guess it was its relatively short lived, one season run that has set it up for cult status.<br /><br />Monty Berman, the producer, was notorious for making things as cheaply as possible and sometimes the show suffered for this with incredibly tacky sets - particularly in Episodes such as \"Happening\" ( a studio deputising for the Australian outback) and the 'snow' sets of \"Operation Deep Freeze\" and \"The Beginning\" but if you can get past this, and focus on the characters and the story lines, the show was really a lot of fun. It had a great mix of adventure, and plenty of deadpan humour (mainly from some terrific one liners from William Gaunt).<br /><br />The chemistry from the three leads was fantastic - you get the sense that they were really having a lot of fun making the show and this is borne out in the 2005 reunion documentary where the three reunite after over 35 years to reminisce about the show (and laugh about Anthony Nicholls awful wig!!). They all shared equal screen time and all had their moments to shine. I have to say, I was always a Richard Barrett fan - I loved his sardonic humour along with that dangerous edge - he was certainly a man you didn't cross, and those eyes........the bluest eyes you would probably see on TV. I have also followed Bill Gaunts career with interest since. However, Craig Stirling certainly would have had his legion of female fans and I am sure Alexandra Bastedo had a whole queue of male fans swooning over her too.<br /><br />The show also had a plethora of guest stars to entice with, including Donald Sutherland, Jeremy Brett, Peter Wyngarde, Burt Kwouk, Anton Rodgers, Kate O'Mara, Jenny Linden, Paul Eddington and Colin Blakely.<br /><br />Notable episodes for me were : \"Auto Kill\", \"The Interrogation\", \"The Fanatics\", \"The Mission\" and \"The Gilded Cage\" but I am sure every one has their personal favourites.<br /><br />If you do get a chance to watch this show for the first time, or to re watch it after many years, remember to watch it in the context of the time it was made and just sit back and enjoy - the characters and the chemistry from the three leads is what made this wonderful show for me and I don't think I will ever tire of it.<br /><br />Enjoy!", "label": "positive"}, {"sentence1": "To Be Honost With you i think everything was so good in this movie there should be no reason why it didn't go into theaters,The Deaths in the movie are awesome the fx are awesome when used,There are a few dull moments when the story's following the little girl but all in all this was a very good movie that i hope someday get's the props it should.The very first part of the movie is prob why it came straight to video with them killing a little boy but after that the story is based on a little girl and her mother who came to visit the moms boyfriend who moved out to try to become a writer,The property he buy's turns out to be where the Witch(Tooth Fairy)lives and anyone who live in her house or goes on her property will be in great danger don't wanna give anything really away just a little info if you've wanted to see this movie then do so it's worth the price of the rental", "label": "positive"}, {"sentence1": "When a movie shocks you with it's disturbing, brooding atmosphere, and grabs you by the throat with it's stunning cinematography, you just know that you have stumbled upon a treat, masterpiece of a film. Although with most modern movies, extremely enjoyable as some are, those that really shock you into focus are the strongest, and are the ones that are most critically acclaimed and mostly, stick with you for a life time. I say, proudly, that I am a fan of movies that disturb, not just horror movies, but those that send a vibe laden with foreboding. Movies like Breakdown and The Missing, that send a chill down your spine, making you think \"holy crap, that could happen to me\", and visually entice you, are up there with some of my favorite aspects in a movie. Because I am only 21, I did not grow up with actors like Burt Renyolds, Jon Voight and Ned Beatty, albeit I am familiar with them, I didn't watch them grow and proceed as actors, as opposed to actors now like Shia LaBouf and Justin Long. I must say, after the long hype and witnessing Deliverance for the first time, I was so admired by these veteran actors in a movie made more than 30 years ago, and still lives it's terror up in competition to modern movies. Burt Renyolds plays Lewis, the macho self appointed leader of a group of four friends on a canoe trip down a fictitious river before a dam is made, filling the whole wilderness in water. Renyolds' character is an experienced adventurer, sort of no nonsense, and filled with machismo. Witnessing him portray the tough guy, made me think differently about him as an actor, as i have only seen him as a seedy old guy or an angry politician. The dialog the director provides for his character gives him enough malice to be proved as a strong and even intimidating leader. Ronny Cox and Ned Beatty play as the novice adventurers, Drew and Bob respectively, joining in for the fun of a canoe trip. The actor that i thoroughly enjoyed watching was Jon Voight, once again I have only seen him as an older actor, however, unlike Renyolds, I have quite liked Voight's acting (and i don't regard Anaconda when I say that), for example the national treasure movies. Voight plays Ed, whom, like Lewis, is experienced in adventuring but is seen as a more reserved character, a reluctant hero/ leader and definitely lacks Lewis' machismo. The film basically opens up with the four driving into a small town while asking to find someone to drive their cars to the bottom of the river whilst they canoe the rapids and camp along the riverside. You immediately get a creepy vibe from the hillbilly characters we are introduced to, like the imbred kid who plays the infamous \"Duelling Banjo's\" at the start of the film with Ronny Cox's character Drew; and more so the two mountain men in the films pivotal and disturbing rape scene. As with all atmospheric movies, from this moment on, dread and confusion fills the characters as well as the audience and it is here we see the characters take shape and change form. The canoe trip that follows is expertly shot and it is from here the men fight against both human and nature's odds for survival. The film's cinematics do not let up, and I back that comment up with the scene in which Ed fights one of the rapist mountain men with a composite bow. As Ed falls on to one of his arrows and notices his enemy approaching him, cocks his rifle, only to shoot the floor as he falls with an arrow in his neck; was possible the greatest piece of cinematic shooting I have seen in a film. In wrapping up, Deliverance is one film, who's dread and atmosphere carry the mood across and to this date, remains one of the best films in cinematic history.", "label": "positive"}, {"sentence1": "That hilarious line is typical of what these naughty sisters say. (It's funny on its own terms and pretty funny unintentionally , too.) Only two of the sisters are really bad. Boy, are they bad, too! One is given to pinup poses and salacious comments where e'er she goes. The other is got up to look like Marilyn Monroe. She has those sensual, slightly parted lips. And, not to give anything away, she is even more bad than the other.<br /><br />All three sisters are played by starlets. The man who stumbles into their lives is played by John Bromfield. He had something of a career.<br /><br />This looks today like possibly the first mainstream soft-core porn ever marketed. Well, of course not the first but the raciest at that time.<br /><br />The girls wear as little as possible and let's not forget about the female audience members: Bromfield is shown shaving with an electric razor -- whose fetish was this? -- bare-chested. He also is shown sopping wet in a swimsuit.<br /><br />There's a real plot here, too: The girls' family, see, is cursed. They are prone to suicide -- or dramatic deaths that can be made to seem like suicide.<br /><br />The movie is not bad. I truly don't know where it was shown. Maybe it was made for drive-ins. Somehow, and I could be wrong, I felt that the typical male audience was not the primary target here. The women are scantily dressed. They often resemble lurid covers of mags like Police Detective or jackets of dime novels.<br /><br />But the guy seems to be the central focus. Not everyone in the movie likes him, but all the girls love him. And I think the audience is meant to also.<br /><br />It's lots of fun -- and on its own terms, too.", "label": "positive"}, {"sentence1": "It is quite a simple not very active but very charming film. There were moments where I can see why Cher won the Academy Award for Best Actress, but there were other times when I wondered why Glenn Close didn't win for Fatal Attraction. Anyway, Oscar and Golden Globe winning, and BAFTA nominated Cher plays Loretta Castorini, a simple woman with a low pay job who has just been asked by Mr. Johnny Cammareri (Danny Aiello) to marry him. He promises her he'll be back in a month, as his mother is sick, so she mean while needs to get as much of his family to attend the wedding as possible. Only problem is, when she finds Johnny's one-handless brother Ronny (Golden Globe nominated Nicolas Cage), they start having a relationship, and there love goes on to that moon scene (where the title comes from). Also starring Oscar nominated Vincent Gardenia as Cosmo Castorini, Oscar, BAFTA and Golden Globe winning Olympia Dukakis as Rose Castorini and John Mahoney as Perry. It ends with no wedding for Johnny and Loretta, but she and Ronny were happy together. It won the Oscar for Best Writing, Screenplay Written Directly for the Screen, and it was nominated for Best Director for Norman Jewison (In the Heat of the Night) and Best Picture, it was nominated the BAFTAs for Best Score for Dick Hyman and Best Original Screenplay, and it was nominated the Golden Globes for Best Motion Picture - Comedy/Musical and Best Screenplay. It was number 96 on 100 Years, 100 Quotes (\"Snap out of it!\"), it was number 17 on 100 Years, 100 Passions, and it was number 41 on 100 Years, 100 Laughs. Very good!", "label": "positive"}, {"sentence1": "Although there were some amusing moments, I thought the movie was pretty lame. The longer it ran, the worse it got. Once the action entered Monument Valley, I found myself watching the magnificent outcroppings more than the increasingly silly and unconvincing interaction of the characters.<br /><br />The character of the daughter was particularly incoherent. First she's in on the deal, then discovers the truth and she bails. Then she's back again, then deserts them again. Then she's back again. There's no apparent motivation for any of her decisions. There were interesting characters, some interesting scenes, and many missed possibilities. I would have to say the pictures was much less than the sum of its parts. Apparently the people who liked Repo Man were inclined to like this one. Searchers 2.0 is no match for The Searchers.", "label": "negative"}, {"sentence1": "This is a must see for anybody who loves thriller's specially political thriller. One scene that stands out is Milgram experiment it is shot to perfection very rarely do we get to see a movie shot and scripted the way this movie is presented.<br /><br />The movie starts with a Kennedy like assassination and a three member team is constituted to investigate the assassination. However one of the member does not agree with the final findings of the committee. As per the terms set that member would initiate a one man investigation into the assassination. This investigation gets him involved in into to deep and dark secrets of high office politics and the way they are controlled.", "label": "positive"}]