[{"sentence1": "The movie may be great. I just watched it last night, but feel unable to give an honest opinion of it because I read the book first. The book is so much better than the movie that I was disappointed with the film. If you plan to watch \"Of Human Bondage,\" don't read the book beforehand. On the other hand, the book is so good, and contains so much more than the love affair Phillip has with Mildred, you could still enjoy it after seeing the movie. I do not make this claim lightly. I average reading a book every 4 days, and read such disparate authors as Danielle Steel, Ovid, Faulkner, Plato, and Shakespeare. \"Of Human Bondage\" gets my vote as one of the top ten novels ever written.", "label": "positive"}, {"sentence1": "** HERE BE SPOILERS **<br /><br />The government has continued to develop the UniversalSoldier program, now called UniSol. The soldiers are now stronger and are able to take more damage than before. However the government is downsizing, the project endangered and the supercomputer that is in the middle of all feel threatened, so he takes steps to ensure his own safety. He activates and controls the UniSols and start to run mayhem. The only one who can stop them is Deveraux (Van Damme). <br /><br />This movie is about one thing. Choreographed fighting. The story is bad, and is soon drowned in all fights. Whatever happens, and wherever they go, they fight. Unfortunately for this movie, it is no fun watching a fight where you know one part of it is indestructible. Normally you're pretty sure the hero will win, but you still want to feel the fights are between two somewhat equal combatants. Not where one is indestructible and can't lose. Then the fights just become a tool to stretch time. You wait until the final fight when Deveraux miraculously finds a way to beat his unbeatable foes. To further lower my opinion, a desperate and sure sign of a bad movie is how much scantily clad women there are. Well, there aren't really that lot of them, because the characters are most men (there are at least one woman UniSol though), but almost every woman is needlessly shown with at least just a bra once. The female leads get by with this, but we also pass through a strip-club (to use a computer no less) with much more undressed women. These moments do not give anything to the story and is just there to try to please the adolescent-minded male audience.<br /><br />So, in conclusion, boring fights. No more, no less. Well, maybe less...<br /><br />2/10", "label": "negative"}, {"sentence1": "Despite its low-key release in this country, and its apparent disregard in other countries (the 'R' rating in the States can't have helped - honestly, just because HBC uses the C-word!), this is actually a fine piece of work. The sentimentality does occasionally threaten to choke it, but it's overcome by the playing of the two leads.<br /><br />It's easy to win plaudits just because you're playing a physical or mental cripple (Daniel Day-Lewis, Geoffrey Rush, Dustin Hoffman, etc.), and Helena Bonham-Carter may not quite capture the physical degradation of MND, but her vocal stretching and ruthless emotional drive compensate entirely. In fact, almost all her performance is conducted through her eyes (and what eyes!). This is an intelligent turn from an actress who is rapidly undoing her English Rose reputation, and emerging as a figure of some stature. Awards must surely follow, though not, alas, for this fine performance.<br /><br />Branagh, one feels, has never quite given his best on film (except possibly 'Hamlet', and there his playing was diluted by the large cast). Here, though, he tops his other appearances, playing to the hilt a self-loathing, unstable, ultimately lovable guy with a subtlety he hasn't always displayed, and exhibiting both intelligence and depth. In short, we believe him, just as much as we could NOT believe him as Frankenstein, as the priest in 'The Proposition', as the lawyer in 'The Gingerbread Man', even as Andrew in 'Peter's Friends'. This is surely his finest performance yet - so why could he not produce the goods much earlier?<br /><br />As a film, it looks more like a television offering, and without its stars it probably wouldn't amount to very much. But it's been a pleasure to see this pair perform their socks off like this, and I eagerly await more from them (though not 'Love's Labour's Lost'...). 8 out of 10, but Branagh and HBC get 10 out of 10.", "label": "positive"}, {"sentence1": "Vertigo co-stars Stewart (in his last turn as a romantic lead) and Novak elevate this, Stewart's other \"Christmas movie,\" movie to above mid-level entertainment. The chemistry between the two stars makes for a fairly moving experience and further revelation can be gleaned from the movie if witchcraft is seen as a metaphor for the private pain that hampers many people's relationships. All in all, a nice diversion with legendary stars, 7/10.", "label": "positive"}, {"sentence1": "This movie should not be compared to \"The Sting\", or other caper/heist/con game films. What makes it such a great movie experience is what it has to say about relationships, deceit and trust. It's also a fairly cutting critique of psychiatry, given that the female protagonist is a shrink who is so easily deceived and then acts out in such a primitive manner in the finale. Has Mr Mamet had an unfortunate experience in therapy? Highly, hugely recommended!", "label": "positive"}, {"sentence1": "When I heard the plot for this movie I simply had to see it, I mean whole cities being wiped out by killer tomatoes! Sadly the title is about as funny as it gets.<br /><br />Led by Detective Dick Mason, a special team of military and scientists (including Greg Colburn who never takes his SCUBA outfit off and Lt. Finletter who is never pictured without his parachute trailing behind) 'Attack Of The Killer Tomatoes' is a parody of B-Movies, in particular Japanese horror of the 1950's. The film begins with a standard sized tomato being discovered by a women washing up in her kitchen before we find ourselves in a middle of a crime scene as the tomato has supposedly murdered this lady, and let me tell you it doesn't get any saner as the film progresses! To be fair there are a couple of funny moments, for instance anytime the Japanese scientist Dr Nokitofa speaks his voice is dubbed over in an American accent, or when disguise expert Sam Smith infiltrates the tomatoes 'hey, can somebody please pass the ketchup?'. Equally this film was probably a lot funnier in 1978 with the whole so bad its good concept. Unfortunately for 'Attack Of The Killer Tomatoes' spoof films such as the 'Airplane' and 'Naked Gun' series have been released and done this kind of comedy a lot better since.<br /><br />The acting is atrocious; there is zero continuity in the editing and it just feels genuinely slow and lacking energy. For a parody film to work you need a lot of things happening at once, one gag after the over. The singing in the film seems pointless and the adverts for the furniture store that flash across the screen are damn right bizarre, even for this film. Ultimately, however, you can see why this film is a cult one; I can't see many people being indifferent to it. Unfortunately terrible would be the way I would sum this up.", "label": "negative"}, {"sentence1": "As a study of the frailties of human nature in the context of old age, this film is without parallel. It is, quite simply, brilliant. Full marks to everyone - from the scriptwriter to all involved in the finished product. You can only marvel at the perceptions inherent in the characterisation of the two ageing performers.", "label": "positive"}, {"sentence1": "First-time director Tom Kiesche turns in a winning film in the spirit of cutting, dark comedy. Shot on a shoestring budget, yet had the flavor of the early Coen brother's film Blood Simple ... and throw in some Monty Python flavorings to boot! Needs to seen more than once to appreciate all the elements that carry one scene to the next. Expect more good things to come from this writer-director-actor.", "label": "positive"}, {"sentence1": "Although John Woo's hard Boiled is my number 1 favorite movie. But i have to say police story is my number 2 favorite movie. I say this because the stunts, the fights and the action my favorite part of the movie is when Jackie Chan jumps off the rail at the top of the esculator at the mall grabs on to a pole surrounded with Chrismas lights and slid down the pole fell through a skylight and finally land on his back on the hard marble floor. OUCH! Buy it at amazon.com for 14:98. (Or something in 14 dollars.)VHS new line home video. any questions or comments please feel free to reply. (i'm only 14 but i know where you can find any movie ever made.) if you looking everywhere for a movie and can't find it please reply to me. Thank you and good night!", "label": "positive"}, {"sentence1": "This is the best version (so far) that you will see and the most true to the Bronte work. Dalton is a little tough to imagine as Rochester who Jane Eyre declared \"not handsome\". But his acting overcomes this and Zelah Clark, pretty as she is, is also a complete and believable Jane Eyre. This production is a lengthy watch but well worth it. Nearly direct quotes from the book are in the script and if you want the very first true 'romance' in literature, this is the way to see it. I own every copy of this movie and have read and re-read the original. The filming may seem a little dated now but there will never be another like this.", "label": "positive"}, {"sentence1": "I find it rather useless to comment on this \"movie\" for the simplest reason that it has nothing to comment upon.It's similar to a rotten egg which has nothing good to show to the world excerpt for the fact that it is rotten as other endless number of eggs have been before it. But since a comment is mandatory for such a grandiose insignificance ... <br /><br />Filth is definitely the proper word to describe this movie created in the same manner as any other Romanian \"movie\" directed by Lucian Pintilie who insists to depict the so called \"Romanian reality\" following the Communist era (1990 to present days).<br /><br />Under no circumstances recommended for people outside Romania as for the others (who lately find amateurish camera, lack of plot, lack of directorial / actors's quality etc, noise etc. as being trendy and even art-like) : watch & enjoy this \"movie\" (as I know you will) but do the other well intentioned IMDb members a favor, don't write an online review for it will misguide, irritate and in the end waste their time.<br /><br />On the other hand this movie (among others) has some value whatsoever, an educational one for it sets the example for : \"How NOT to make a movie.\"", "label": "negative"}, {"sentence1": "i love this film. the songs and story lines are great fun. and the song \"saying goodbye\" always moves me. what a brilliant thing to do to bring puppets to life, in a way that you actually care about these things made of cloth and fabric and whatever. great voices and great talent. why were all the other muppet films that came after this one so much less interesting, moving and funny? is it that mr. henson is just so very missed?", "label": "positive"}, {"sentence1": "I rented this movie because it falls under the genres of \"romance\" and \"western\" with some Grand Canyon scenery thrown in. But if you're expecting a typical wholesome romantic western, forget it. This movie is pure trash! The romance is between a YOUNG GIRL who has not even gone through puberty and a MIDDLE-AGED MAN! The child is also lusted after by other leering men. It's sickening.<br /><br />Peter Fonda is portrayed as being virtuous by trying to resist his attraction to Brooke Shields, and her character is mostly the one that pursues the relationship. He tries to shoo her off at first but eventually he gives in and they drive off as a happy, loving couple. It's revolting.<br /><br />I don't see how this movie could appeal to anyone except pedophiles.", "label": "negative"}, {"sentence1": "Spirit of a murdered high school geek animates a scarecrow which then takes revenge on everyone.<br /><br />This movie really annoyed me. It has a great looking monster, has some good low budget effects, some atmosphere but manages to short circuit the good stuff with bad. Half way in I started to fast forward and then step through the chapters on the DVD.<br /><br />The problems with this movie are many. First off the cast looks about thirty and yet they are suppose to be in high school. You don't believe anything from the get go as a result. The scarecrow, while looking great isn't much beyond that. He says stupid one liners and moves in a manner more designed to be funny then scary. Is this a comedy or a horror movie? Its a problem that goes beyond the one liners to much of the dialog and set up. It seems more send up of every cliché than heartfelt horror film. I some how expect that the film was made for a very narrow audience in mind, horror fans who want to mock the genre rather than embrace it.<br /><br />Despite the good looking monster this is a film to avoid. Even if you pick it up in the bargain bin for under five bucks, you're paying too much.<br /><br />Avoid.", "label": "negative"}, {"sentence1": "I wonder who was responsible for this mess. The jokes wouldn't have worked for gilligan's island. If this had gone to series, would there have been jokes about Auschwitz, or would Eva have to replace her oven, only to have Adolf suggest the kind that seats 50?? Another post compared this show to I love Lucy. The problem with this is that Lucille Ball was a genius at physical comedy and bizarre situations, and this mess was just plain badly done and an insult to my intelligence. <br /><br />After the damage the Nazi's did to England and the number of people they killed, I would think the very concept of a comedy about Hitler would seem repugnant and most normal people would have killed this concept before any episodes were produced.", "label": "negative"}, {"sentence1": "What would happened when a depressed cop works with a shrink on probation? May be a lot of fun... This movie set a benchmark in the action/comedy genre of the Argentinean cinema. Dearable characters, probable story and a pace that between laughs has some thrill. I recommended it for a pleasant time of entertaining. Peretti and Luque join their efforts to fight against a cold and daringly foe in a time when it's difficult to trust someone. This movie will surprise you, the other side of the coin of \"Analyze me\", but not alike, with nothing to envy. And if you like to know Bs.AS there where few scenes of downtown and the city center.", "label": "positive"}, {"sentence1": "This is one of the most atrocious rewrites I've ever viewed. If they want to make a movie with a lousy story, they should refrain from giving it a title of a fine book. There is hardly a relation between Wolfe's book and this movie other than the title. I don't mind changes if they help a story flow on screen. At least the changes shouldn't hurt the final product. The last scene in the movie is painfully unconvincing. The actors are miscast. The director and/or screen writer obviously could not decide whether to make a lame comedy or preach an unconvincing sermon.<br /><br />If you've seen this movie and disliked it, try the book. If you've seen this movie and liked it, read the book.", "label": "negative"}, {"sentence1": "What could have been an engaging-and emotionally charged character study is totally undermined by the predictable factor. Fox is OK as Nathaniel Ayers, the Julliard trained musician who dreams of playing with the Walt Disney orchestra until his bouts with schizophrenia drive him into the street and ultimately skid row. Looking for a good story to boost his flagging career, reporter Steve Lopez {Robert \"rehab\" Downey } gets to know him and tells his story. Taking every element of the classic \"how we hit the skids\" movies, borrowing very liberally from \"A Beautiful Mind\", taking the bogus \"feel good\" attitude of films like \"Rocky\"-you pick the sequel number-and whipping up too much 1930s style melodrama all that is left on the screen is a burnt out shell of a movie. It is corny, trite, utterly predictable and plays way too often on our sentiments. I hate to say it, but this is the kind of movie that, if you say you hated it, people will give you bad looks. I really wish I could say something positive about this film, but I really can't. The acting redeems it somewhat, but not enough for me to give it more than one star. Strictly made for TV movie stuff. Not worth your time.", "label": "negative"}, {"sentence1": "Sudden Impact is a two pronged story. Harry is targeted by the mob who want to kill him and Harry is very glad to return the favour and show them how it's done. This little war puts Harry on suspension which he doesn't care about but he goes away on a little vacation. Now the second part of the story. Someone is killing some punks and Harry gets dragged into this situation where he meets Jennifer spencer a woman with a secret that the little tourist town wants to keep quiet. The police Chief is not a subtle man and he warns Harry to not get involved or cause any trouble. This is Harry Callahan Trouble follows him. The mob tracks him to this town and hell opens up as Harry goes to war. Meanwhile the vigilante strikes again and the gang having figured it out is ready for her. Jennifer Spencer is caught and Harry comes to her rescue during the film's climax. Sudden Impact is not the greatest Dirty Harry but at the time it gives us a Harry that is very much an anti hero ready to go to war just to pursue Justice. Again not the best not the worst but the one with the most remembered line. Go Ahead Make your day.", "label": "positive"}, {"sentence1": "If you want to make a movie like this, have the threat be real. Don't surround your patsy with a bunch of Bonzos. There is no credibility here. The plot is dull and unbelievable. The acting is even worse. I thought that I was watching Arthur Lake (Dagwood) who is one of the worst actors in history, when I saw the main character. Oh well, at some point he has to face the music and get fighting mad. I don't care. Do you? There are all these long scenes set in this austere office (the furniture made out of cardboard or masonite). People talk and smoke and don't do anything. Most of the action happens in a five minute sequence. After that, it's over. Don't bother.", "label": "negative"}, {"sentence1": "The Order starts in Rome where the head of a special order of priests who deal in ghosts & demons named Brother Dominic (Francesco Carnelutti) is found dead, cut to New York City where one of his order Alex Bernier (Heath Ledger) is contacted by top-brass Cardinal Driscoll (Peter Weller) who ask's him to investigate the mysterious circumstances surrounding Dominic's death. Along with his girlfriend Mara Willims (Shannyn Sossamon) & fellow priest Thomas Garrett (Mark Addy) Alex travels to Italy to delve into his mentor's death, as the truth begins to emerge it appears that Dominic was a 'Sin Eater' someone who absorbed other's sins & lived with the burden of them so they could die peacefully & that the Church wasn't happy about his activities. Alex must do what's right even if it goes against what he believes...<br /><br />Also know under the title The Sin Eater this American German co-production was written, produced & directed by Bian Helgeland & didn't really do that much for me if I'm honest & I usually am, honest that is. Anyway lets start with the mess of a script that has some OK ideas but it's throughly predictable, excruciatingly dull & boring, really silly at times & it takes itself far too seriously. The whole concept is daft & while it thinks it's clever with it's oh so neat twist ending that ties everything up & brings the story full circle I thought it was the most obvious & lazy way to end things. There's the usual religious themes here, morality, sin, forgiveness, faith, belief, prophecy's, blah, blah, blah you know the sort of thing. Then there's the twists which aren't hard to see coming, there's the abuse of power by high ranking clergymen, corruption, greed, evil, etc. you know the sort of clichéd Hollywood ideals & themes that get reused every time it deals with the Church. The Order has nothing new to say & as a serious piece of film-making it sucks, a lot. I'm not too sure who The Order is meant to appeal to, as a die-hard horror fan I didn't see much horror in this at all, as a thriller it's less than thrilling, as a mystery it's too predictable & there's nothing here to really grip or maintain ones interest & for some reason I cannot figure out the IMDb also lists The Order as an action film which is absurd as it's as exciting & action-packed as the average episode of Sesame Street (1969 - present), harsh maybe but it's what I think...<br /><br />Director Helgeland does an OK job, the film seems to have a very soft lighting scheme & it all looks a bit drab, grayish & dull. For a supposed horror film The Order is very light on scares or horror elements, in fact there aren't any of either apart from two evil kids who can turn into a flock of birds for no apparent reason, don't ask. Forget about any gore or violence as there isn't any which is fine but it would have helped at least make The Order somewhat watchable. According the IMDb's 'Trivia' section the release date of The Order was put back so some of the special effects could be improved because they looked unintentionally funny, all I can say is judging by the finished film the effects must have been really bad to start with because they aren't exactly brilliant as it stands now.<br /><br />I was amazed to see The Order had a budget of about $28,000,000 which is a hell of a lot of money & I just can't see where it all went apart from the sets & production design which are good. The whole film looks & feels very average & utterly forgettable. The acting is OK although the annoying fat guy who seems to be some sort of foul-mouthed comic relief irritates, a good actor such as Peter Weller deserves better than this.<br /><br />The Order, I prefer the title The Sin Eater actually not that it matters too much, misses all of it's intended targets by the proverbial mile as far as I'm concerned & is a pretty dull way to waste 100 odd minutes of your life so don't do it! Not recommended.", "label": "negative"}, {"sentence1": "Sure, if you ask any mom who's the most beautiful baby in the world, she'd tell you her son is the most amazing kid in the whole world. She's right, at least in her own world.<br /><br />The producers of the movie were biggie's mother and his good friend Puffy. Oh, well, do I need to say more? I'll break it down for those who doesn't want to do a simple deduction.<br /><br />The whole movie was fake. You may just put a few biggie's MTV video together and call it a movie.<br /><br />The beautiful Angela Bassett played Biggie's mother. The real one in life looks like a dog.<br /><br />I just wonder why he called himself biggie small. Big body Small dick? Big mouth Small sound? Big fat Small eyes? Disclaimer: I'm a person of color. So keep your racist remark to yourself.", "label": "negative"}, {"sentence1": "i know you've read that before, on countless other films no doubt if you're reading the comments here, but voodoo academy still stands as the absolute worst film i've been able to track down. no doubt the really bad ones aren't even available to buy or watch on tv, but even so i feel it's fair to qualify that i'm not just some dumb renter who picked badly.<br /><br />i've seen two thirds of the bottom 100 ranked films here on the imdb, and i'm ticking of the remaining ones with every chance. most of those stand head and shoulders above this... excersize in absolute monotony.<br /><br />i like to rate truly bad films (as in ones with no humour even in how bad they are) by how many people you need to watch it with to make it all the way through. if you can watch it by yourself, it isn't that bad. if you can watch it with one single friend... it's bad but could be a lot worse.<br /><br />it took 5 of us to make it all the way through voodoo academy. and not even the usually fun moments of watching bad films (spotting the boom mic for example, 3 times in this one if i'm not mistaken) could take away the dry taste in my mouth. yes i'd watched it, but i'd also forced 4 of my friends to watch it with me to achieve that end.<br /><br />i hope and pray we saw the directors cut... to think that there could be a version with 20 more minutes of big eyebrowed lugs with baby oil glands rubbing their torsos just scares the hell out of me. so much of the film centers around this.<br /><br />i do applaud david decoteau for managing to lens this film in two days on a short budget, just as i applaud him for convincing people to pay him to make what is no doubt a celluloid version of some of his fetishes. but it isn't a good film. the original shop of horrors was shot in the same length of time for a comparitive amount of money (considering inflation) and was an utter gem. it's not an excuse for how bad this baby is.<br /><br />spoilers ahead...<br /><br />it's not even worth picking apart the plot holes or cliched know it all hero characters... the pacing of the film... is insane... nothing... is interesting for the length of time decoteau dedicates to the pectoral self massaging. no matter what your alignment or sex... rubbing just cannot sustain that kind of screen time.<br /><br />the acting is cheese... but not overly amatuer... i've seen a lot worse in better films... but somehow it's the semi competent delivery of some of the worst lines you'll ever hear in a film, that really grates.<br /><br />rent this if, like me, you have a fascination with the worst of the worst, and only if you're going to watch it with a group of people who are prepared to work to get through it. this is no ha ha ha the set wobbled affair. it's an endurance test you probably want to skip.<br /><br />i'm sure there is worse... but i wouldn't be surprised if it has decoteau's name on it.", "label": "negative"}, {"sentence1": "This is one of the best movies I have seen in a long time. All of you who regard this movie as absolute sh*t obviusly are not intelligent enough to grasp all of the subtle humor that this movie has to offer. It shows us that real life and \"ficticious\" action can produce a winning combination. Also, as a romantic comedy, it has one of the most clever ways for two people to find each other. Name me another movie where you can see all of that as well as Donald Sutherland singing a song like \"They're Going to Find Your Anus On A Mountain On Mars.\"", "label": "positive"}, {"sentence1": "this has by far been one of the most beautiful portraits of a person that I've ever seen on screen. Andy Goldsworthy is a kind of man that is upon extinction. he views the earth and nature with such admiration and respect that it's primitive in a good sense. his purity, honesty and kindness breathes clearly as you watch him work in such simplistic yet full of life momentary pieces of art. I was amazed how patiently he created his pieces and how patiently he accepted their end. sometimes prematurely, but his Scottish sense of humor covers his disappointments brilliantly. the film is shoot elegantly and contains the same flow that Goldsworthy's art has. it combines nature and art in a minimal way as it is in itself. Fred Frith's score is organic enough that it blends everything together without interfering with it naturalistic sound. this is overall a great piece of work in every aspect. it has no boundaries as far as age goes.", "label": "positive"}, {"sentence1": "I don't see what everyone liked about this movie. The set-up was too long and talky, and when it was done, the main character remained as flat and opaque as he had been in the first scene. After the film finally got Cusack into the eponymous hotel room, I had to wonder, well, what's going to happen here for the next hour or so to keep me engaged. The answer: not much, just John Cusack having a long, drawn-out, mental breakdown.<br /><br />Maybe if the Cusack character had more depth . . maybe if his freak-out were a more thorough reworking of his everyday life . . . maybe if the film had either better developed its half-baked themes about loss and faith or had not tacked them on in the first place . . . maybe if the film had made a choice to be either psychological horror or thrill-ride horror and had fully embraced one of these styles . . . I dunno. All I do know is that I saw this movie with two other horror buffs and none of us much liked it.<br /><br />Except for the disquieting episode on the hotel ledge, the alarming crazy lady with the hammer, and the so-stupid-it-was-fun crypt keeper in the air duct, all three of which account for no more than five minutes of screen time, this film was a bore.<br /><br />By the way, this story seems to steal ideas from The Shining and use them here to much less powerful effect. Is Stephen King now reduced to stealing ideas from himself?", "label": "negative"}, {"sentence1": "This movie was featured on a very early episode of Mystery Science Theater 3000, but when I see this film, I don't think about that wonderful TV series. I believe this was a surprisingly good early 40's horror flick, with very surprisingly good sound and picture for a 67 year old public domain horror movie. I actually enjoyed watching Bela Lugosi and his bizarre staff, including his wife who requires fluid from the glands of young would-be brides, an old hag, and her two bizarre sons, one a giant idiot, the other a comical dwarf(Angelo Rossitto from 1932's Freaks). I also enjoyed the plucky young female reporter, who is kind of a stereotype, but still fun to watch. My only problem with this otherwise decent film is it's plot, even ridiculous and unbelievable for a movie. I don't want to spoil any of this film, so go out and rent it, or, better yet, buy it for a couple of bucks.", "label": "positive"}, {"sentence1": "As with that film we follow the implausible if always engaging adventures of the 2 lead characters. But whilst C + J eschew sex for a girly trip back into childhood, this pair revel in their carnality even to the point of exploring homoeroticism. Most of the sex they acquire from grudging or unwilling partners and yet, despite their deeply un-PC behaviour, everyone emerges smiling. Like C + G, through it all they remain innocents at heart, rebels against the quotidien, the bourgeois, the restrictive. As someone else has commented, I wouldn't want to know these 2 and it's a minor miracle that their trip brings scenes of mostly comedy and very little tragedy (and what there is of that cannot be laid at their door) and thus for that reason, it left me beguiled but with a sweet taste in the mouth. Dare I say that only the French can get away with films like this. And that is part of their genius.", "label": "positive"}, {"sentence1": "I saw \"The Grudge\" yesterday, and wow... I was really scared, a good thing. I love horror-movies, and I really liked this one. There were so many 'surprise'-scenes (what's the English word?) that made you jump in your seat. Though, too much screaming from the audience made it difficult not to laugh. I think the most scary scene was... on the bus, when the face flashes by on the window, or when Yoko's walking without her chin. The make-up is also VERY good. Sometimes you could really see it was there, but it was still adding a freaky look to the scene. The boy was very good indeed, so cute without make-up and so terribly scary with it on. The next time I hear a cracking noise I will probably feel pretty scared...", "label": "positive"}, {"sentence1": "Robert Wagner is the evil boss of Digicron, a telecommunications company with a virus that kills people.<br /><br />'so you're saying that the software virus has become a real virus that can kill people - that may be medically possible but not possible from my system' <br /><br />'i'm having to write some new virus software of my own to trap it - it may take some time'<br /><br />'but it's not going after software, it's killing people'<br /><br />watch out for the 'i'm into virology' love moment and perhaps first ever film plot to feature death by braille keyboard", "label": "negative"}, {"sentence1": "Spoilers... if such a thing is possible... . . . . . . . As a rabid Robin Williams fan, I felt it necessary to buy this film as first on-screen appearance. Wow... I could not imagine a more mind-numbing movie. Essentially, the movie takes one bad joke after another that your uncle Artie would tell you after dinner and dramatizes them. Robin Williams plays a lawyer in a 30 sec skit.<br /><br />I'm all for bawdy humor, but this humor wasn't pleasantly vulgar, or ribald... it was just mind-numbing. There are no redeeming qualities to this film, other than Robin Williams fanatics, like me, who simply have to own every piece of film.", "label": "negative"}, {"sentence1": "The psychology of this movie is really weird to try and figure out. Its often billed as an anti-RPG movie, but its really not that simple. Here are come apparent contradictions that make me wonder just what (if anything) they're trying to say about gaming.<br /><br />They laboriously introduce all the characters home lives by way of introduction, all of them having parents who are divorced, alcoholic, and totally out of touch with their lives except for the times they're harshly pressuring them to succeed. Tom Hanks is arguably the worst off, having just failed out of another school and still dealing with a brother who disappeared and may be dead. <br /><br />Its mentioned a couple of times that they play the game to work through problems in their real lives. And sure enough, at the end, when they go to see Robbie (Hanks), they're all happy and well-adjusted, embarking on their adult careers, problems solved, games put away (Daniel doesn't even want to design computer games any more), and even Robbie's mother, who's been constantly drunk and dissatisfied, is suddenly the Happy Homemaker, looking fresh and bright and arranging flowers. <br /><br />Sure, JJ suddenly (and quite cheerfully it seems) decides to commit suicide, but the reason seems to be entirely because he's a lonely boy genius who can't get a date, and not because his character dies, as in the famous Jack Chick tract (which happens afterward anyways, and it almost seems like he does it on purpose so he can end Daniels game and get everyone to come play his. In fact, the prospect of live-action role playing in the caverns seems to be the only thing that saves him from killing himself!) And in what may be the coolest tableau scene in the whole movie, Kate, looking very fetching in chain mail, looks right at the camera and says something like, \"The scariest monsters are the ones in our own minds.\" <br /><br />The biggest fantasy element in this movie is the two muggers passing up the rich couple so they can rob the dirty, homeless-looking guy of his magic beans. The recurring theme (a \"The Way We Were\" for the 80s)might have been poignant at the end, but as a way to kick off a movie is downright depressing and seems out of place. And for one final mystery, our hero, wearing full Pardu regalia, has a psychotic break, becomes his character completely and embarks on his quest, so of course the first thing he does is change into 20-century street clothes. <br /><br />So maybe the movie's irrational, but I guess its dealing with an irrational topic. In those days a circle of kids with dice and pencils was regarded as tainted and possibly possessed, and you could go insane if they spoke their mumbo-jumbo at you. The anti-game paranoia is pretty much summed up in the first scene, where the reporter asks the cop whats going on, the cop says a kids lost in the tunnels and there's a chance Mazes and Monsters is somehow involved. The reporter admits to being vaguely familiar with the game (although he allows his own children to play it), then turns to the camera and reels off a polished spiel that blames the game for everything and admits no possibility of another explanation. In the end, its no masterpiece, but interesting as made-for-TV movies go.", "label": "negative"}]