[{"sentence1": "First off, I have to say that I loved the book Animal Farm. I read it with my 9th grade class, and it was great. We also decided that watching the movie would be beneficial. The movie was so disappointing to me. The movie cuts out some characters, and misses a lot of the main points of the book. It skips around a lot, and doesn't explain anything in detail. If someone was watching this movie without having first read the book, they would be confused. The most disappointing thing in this movie to me, was the ending. The ending in the book was the most powerful, and in the movie, they changed it! It was supposed to be the pigs and men in an alliance and sort of \"melting\" together, but instead, the movie made it seem like the animals were going to rebel against the pigs. To sum up, I don't think that this movie captured the real meaning that Orwell portrayed in his book.", "label": "negative"}, {"sentence1": "Having enjoyed Jean Arthur in \"The Devil and Miss Jones\", my interest was peaked, so I tried sitting through this second-string screwball outing about an investigation into the death of a jockey--but I didn't make it to the end. Arthur, photographed in a gauzy, movie-magazine fashion, either wants alimony from ex-husband William Powell or another shot at marriage, but I never felt for her because the character is just a string of wisecracks (she's the type of heroine prone to comical curiousness, but once inside a morgue--like all women in these '30's comedies--she faints). William Powell reportedly had a high time working with Miss Arthur, but you'd never know it from the end result; they look awkward standing next to each other, hesitant over their banter. The actor playing Powell's valet is excruciating, and the pauses for viewer laughs are pregnant with unease.", "label": "negative"}, {"sentence1": "If you ever have the chance to see Sandra Bernhard live in person, you better move on it sweetie. I saw her last year in Los Angeles at the opening of her Everything Bad and Beautiful tour and i still can't believe that i was in the first row, and lucky enough to experience such a phenomenal show. She is now in New York with the show and it coincides with the release of her groundbreaking stunner, \"Without You I'm Nothing\". We have lost Richard Pryor, Lenny Bruce, Nina Simone, but Sandra is still with us. Patti Smith is missing in action, but not Sandra. Barbara Streisand continues to peep her head out once in awhile but Sandra more than makes up for where Babs leaves off. Okay, i want it known, Ms. Bernhard is a little of these influential entertainers and more. I really wanted to push this film because of its truth, honesty, humor, eclectic songs (ranging from Laura Nyro, Sylvester, Nina Simone, Prince), and a script that defines the decadence, joy, sadness, ups and downs of the 70's and 80's. It is my opinion that many (and i mean, MANY) comics have lifted, okay outright stolen, so much from this show if not from Sandra herself. I won't name names but come on, people, you and i know who they are. See, the thing is, Bernhard plays by her own rules. This movie shows, as does her live performances, that she is a performer who has stayed true to the old school of show business, as well as pushing forward. Her performances are reminiscent of smoky jazz clubs (during the time of Miles Davis,Coltrane,Monk), 70's TV shows, intimate cabaret acts and concerts that are reminiscent of everyone from Judy Garland to Joan Jett. Most comedians couldn't even touch where Sandra is coming from or going to. So, here i was, a year ago, watching Sandra at the Silent Movie Theater, in total awe and joy. I wanted to meet her after the show, give her something that meant something to me, that, hopefully would mean something to her. But i listen to my copy of Giving Til it Hurts, and just thank her in a prayer, of sorts for making me laugh, making me think, making me FEEL. You can't deny this lady's presence and you certainly cannot deny the talent that just rushes from the stage. She's still here, damn it, even after the release of Without You I'm Nothing, some 15 years ago. And she looks great, by the way. I know this firsthand, walking from the theater one audience member said to another, \"She is SO FUNNY..and she still looks incredible!!! If you can't experience her live yet, please see this movie. As for me, I do hope that Sandra will see this. You've meant a heck of a lot to me, gotten me through some tough crazy times. If you can send me an email, please do. If not, knowing that you are still kicking it out and will continue to do so, is enough for me. Come on, people, give it up for the Lady!!!!", "label": "positive"}, {"sentence1": "When Samantha Eggar (as Phyllis Dietrickson) answers the door of her house swathed in a towel, you realize that as competent an actress as Eggar may be, she doesn't have the hypnotic allure of Barbara Stanwyck. And it is not entirely Eggar's fault. In the original film, Wilder had Stanwyck not only appear in a towel, but she enters the scene on the second floor balcony of the house. And she doesn't \"come out\"; she appears, almost as if by magic. Walter Neff is staring up at her from below on the first floor. There is a reason for this. Stanwyck is much higher than Neff (Fred MacMurray) when they are first introduced. It is not just the towel. The towel adds to the seductive allure. Her pose is like a Greek Goddess overlooking her domain, and, in a strange way, you feel as if, from the start, she is actually controlling the entire situation. She has sexual, even magic, power. This person is no ordinary housewife. This person is a mystery with secrets hidden within.<br /><br />Back to 1973. The remake has Crenna knock on the front door. Stanwyck's stand-in, Eggar, answers the door with a towel around her. There is no \"appearance\". She simply opens the door. The alluring superiority that grabs the audience at the first appearance of Stanwyck in 1944 is entirely absent in 1973. She opens the door with a towel around her. It may be sexy in a Charlie's Angels sort of way, but it's not nearly as mysterious. The filmmakers of the remake seem to misunderstand Wilder's point. The script may have said \"Phyllis appears in towel\" so the filmmakers of the remake simply follow the instructions and include the required towel. The point is not the towel. The point is the enigmatic quality of Phyllis, and the potential power she wields. Wilder gave her a towel to add to her mystique. The filmmakers of the remake gave her a towel because that's what Wilder did. And in the choice of shot, lost all of Phyllis' mystique.<br /><br />Richard Crenna also seems miscast. He seems like he's \"acting\" and not really in the midst of the dilemma. Part of the problem is Crenna appears so much like a 70's actor. He can't get into the 1940's. When MacMurray first speaks into the microphone, sweat begins to drip from his face. No sweat on Crenna. And they also changed one of the crucial lines at the beginning. In the original, Neff says, \"I didn't get the money, and I didn't get the woman.\" In the 1973 version, Crenna says, \"I didn't get the money, and I didn't want the woman.\" Did the filmmakers completely misunderstand the entire point of the story? Or were they dumbing it down for a \"television\" audience?<br /><br />This made-for-TV movie is a by-the-numbers rendition. All the sharp edge of the original is lost. The only stand-out, maybe, is Lee J. Cobb in the role made famous by Edward G. Robinson. But he cannot save the loss of intensity of the original. This 1973 boring remake is a forgettable TV-movie made probably by the same people who did \"Gilligan's Island\". They might as well have tried to remake \"Citizen Kane\" or \"Gone with the Wind\". If mediocrity is the best one can hope for, what's the point? The 1944 classic is a Film with a capital \"F\". This made-for-TV remake deserves an \"F\" grade, or, maybe a \"D\" for dumb.", "label": "negative"}, {"sentence1": "If this is based on the true-life relationship, as purported, between Ms. Curtin and Mr. Levinson, I'm thrilled I do not know them personally. This is painfully slow, and both characters take stupid pills liberally throughout the movie while the theme song gets played into the ground. Many stupid scenes with people acting stupid does not make for a comedy.", "label": "negative"}, {"sentence1": "Patricia Hunter: Oh, professor, do you also make a habit of collecting coffins? Dr. Lorenz: Why, yes, in a manner of speaking. I find a coffin much more comfortable than a bed. <br /><br />Interesting Bela Lugosi (Glen or Glenda, Dracula) vehicle where he plays the mad scientist. I was especially creeped out when he appeared in the bedrooms of his guests when they were sleeping.<br /><br />Luana Walters (Girls in Prison) was really appealing as a sensual reporter, Patricia Hunter< who was to be a victim, but woman-power trumps evil scientist every time.<br /><br />2'11\" Angelo Rossitto and creepy Frank Moran , who liked to stoke the women's hair added to the film.<br /><br />Interesting look at a 40s horror film.", "label": "negative"}, {"sentence1": "Especially for a time when not much science fiction was being filmed (1973), this is a terrific vision of a future where everything has gone wrong. Too many people, and nothing works. The only people who can live in comfort are the rich. It's set in New York in 2022 (I think), and it reminds you of your worst vision of Calcutta.<br /><br />I got to appreciate Charlton Heston's acting after seeing him in Orson Welles' Touch of Evil. He was (maybe is) capable of portraying a range of heroic or semi-heroic people. Here, he is torn between being a cop who is just a little bit corrupt (taking rare food treats from the rich), and being totally corrupt (actively condoning evil). <br /><br />The movie all seems to take place at night, and sweat is dripping off everyone, except in one of the rare air-conditioned apartments. Even though I hadn't seen it before, I knew the famous ending (which will not here be revealed), but the ending is certainly foreshadowed.<br /><br />Great scenes with Edward G. Robinson: going to the council (made up of elderly Jews with heavy accents, so it seems), where the truth is revealed. And then going off to the Thanatopsis to check out.<br /><br />Gritty, pre-Star Wars dystopian science fiction.", "label": "positive"}, {"sentence1": "A very unique Sci-Fi animated film, and frankly I love uniqueness no matter which way it tends to be, better or worse. This French film is quite interesting to watch, the technique part is innovatory, like \"Waking Life\" I recently watched.<br /><br />It took me quite a long time to get used to the Black-White style, but eventually I love it, the sketchlike images are really fancy! The contracted future world is a symbol of human race's final destination which I adore it very much.<br /><br />The whole plot is fine for a Sci-Fi, not so intriguing but it's OK, like some Hollywood's products, a giant conspiracy about human's eternity, a little bit cliché and the twisted ending is not so convincing, some development is just too plain and insipid, and the whole movie is too long.<br /><br />So I think I'm just in love with the style this film shows, others are not so good.<br /><br />About the eternity of life, I think most people have come to a unanimousness that we don't want eternity because it demolishes the meaning of life, we treasure our lives because they are limited and meaningful, if everyone can live forever, thus the world world will become a disaster and chaos. Leaving someone you love is hard and heartbreaking, but that's also a way to show our lives are genuine and all the emotion fulfills one's life and make the world colorful and lively.", "label": "positive"}, {"sentence1": "i would never have thought that it would be possible to make such an impressive movie without any music. but it is. just the pictures. watch out for that picture: anne talking with that little boy benny 'bout the soul. really strong. might make you feel different.", "label": "positive"}, {"sentence1": "A surprise thriller with more twists and double crosses than a doodle pad. A great cast mixing it up with an intriguing plot overseen by a Twin Peaks-ish influence in director Dahl. Nicholas Cage is a very underrated actor and shows a great portrayal of a man in a bind looking for the right thing to do. J.T. Walsh (RIP to a great actor) is always a wonderful villain, as is Dennis Hopper. It's such a shame he never made to a higher profile in the biz. I'm sure he has his followers, though. In all, this is a great film that shows you that you don't need big bangs or a commercial soundtrack to be an entertaining film.", "label": "positive"}, {"sentence1": "I went to go see this at the Esquire Theatre in Cincy, OH, and - I hate my life now.<br /><br />Christopher Reeves would have been a more believable boxer.<br /><br />As a film it was painful, but seeing Bret Carr in person was to see desperation at its pinnacle.<br /><br />My favorite part of the movie was seeing BC slammed in the face with what appeared to be a \"C\" battery. The jury is still out on this. It was from a dildo and it was in slow-mo. Yep.<br /><br />\"Shoot the left side of the face only...people become famous by demanding things!\" - Bret Carr B. Carr donned a Chicken Suit for a bit of reverse psychology, roaming the streets of Clifton bashing his own film. He should. This is correct to bash the film.<br /><br />My soul felt chafed after this movie.<br /><br />Bret Carr is not charismatic enough to be the leader of a cult, or smart enough for that matter. That is the feeling you get from the What the Bleepesque trickle of brainwashed, impressionable neo-yuppies that came to see this Bret Carr Piece of Work.<br /><br />It's an emotionally draining experience just thinking about writing about this film, so goodbye.<br /><br />-Anonymous", "label": "negative"}, {"sentence1": "Of all Arnold's mid-'80s movies who would have thought that most relevant today would be The Running Man. A chilling and surprisingly realistic tale of reality TV gone mad. It may have been far-fetched back then but not so now. Not when you think about it. Currently, Reality TV shows are either scraping the bottom of the barrel or desperate to raise the bar. If the next one isn't more controversial as the last, it's a dud. How long will it be before we really do see shows like The Running Man? How long before we have 'court-appointed theatrical attorneys' or the entertainment division of the Justice Department? There is so much satire and intelligence in this movie that may have been missed back in 1987 that is desperate to be seen again considering the current state of TV shows.<br /><br />The biggest message of all is 'You are being lied to'. It's no secret that the Government and the media work in cahoots. And the masses believe what the media tells them to believe. It's a very scary state of affairs and unless more accurate representations of the truth emerge we may easily accept a brutal show like the Running Man in the near future. It's no secret that Reality TV is not very realistic. It's edited and reshaped before being aired and it's only what the networks want you to see. Usually it's far from the real truth.<br /><br />Although rather different than Stephen King's book (the ending is completely changed) the script does conform to the typical Arnie formula. Yes, he does have numerous and very corny one-liners and he does say 'I'll be back' (which he never REALLY said that often anyway, when you think about it) in the most ironic situation yet but he's still a zillion times better in the role then Christopher Reeve or Dolph Lundgren would have been (these two were considered BEFORE Arnie believe it or not).<br /><br />The director is none other than Dave Starsky himself (Paul Michael Glaser). It may not be artistic but it is still strong enough to generate excitement and his use of neon and flourescent colors gives each individual set a pretty cool look. Andrew Davis (not a director I particularly like) was attached before Glaser, though no matter who directs, the film is still marred by a very heavy 80's feel.<br /><br />First of all, Harold Faltermeyer's score (remember him?) is incredibly dated and robs the action scenes of any timeless integrity. And the fashion sense of the movie is far too excessive to be convincingly set in the future. Apart from the dated feel, the only other thing that bugs me is the poorly staged shoot-out that passes as the climax.<br /><br />This new DVD is a zillion times better than the original release. Gone is the horrid letterbox picture. In its place is a brand new hi-definition 1.85:1 anamorphic transfer. The colors sparkle and literally pop from the screen. The new Dolby 5.1 EX and DTS ES soundtrack are also amazing. There constant use of the surround channels to great effect and the bass is strong and powerful. Definitely one of the best re-masters I've seen so far. Two intriguing documentaries, a trailer and a 'Meet the Stalkers' gimmick are included in this 2-disc set that comes in a rather neat slip case.", "label": "positive"}, {"sentence1": "This could well be the worst film I've ever seen. Despite what Mikshelt claims, this movie isn't even close to being historically accurate. It starts badly and then it's all downhill from there. We have Hitler's father cursing his own bad luck on the \"fact\" that he'd married his niece! They were in fact, second cousins. Hitler's mother, Klara, called his father, Alois, \"uncle\" because Alois had been adopted and raised by Klara's grandfather and brought up as his son, when he was really his nephew. Alois was much older than Klara and so as a child she'd got into the habit of calling Alois, \"uncle.\"<br /><br />The scene in the trenches where Hitler is mocked by his fellow soldiers and decides to take it out on his dog is simply a disgrace and an insult to the intelligence of all viewers. We see Hitler chase the dog through the trench, when he catches up with the poor thing he proceeds to thrash it for disobeying him. In the distance we see and hear his fellow soldiers continue to mock and chastise the cowardly little man, but then a shell lands directly on his persecutors, and every last one, we are told, is killed outright. How then, if Hitler was the only person to survive the scene, did this tale of brutality and cowardice come to be told? Did Hitler himself go around \"boasting\" about it? - I don't think so.<br /><br />Next up, Hitler bullies and intimidates a poor, stressed out and war weary Jewish officer into giving him an Iron Cross! I can only assume that this Jewish officer had been a pawnbroker before fighting for the Fatherland, and had thoughtfully brought along some pledged medals from his shop, because I'm certain that Iron Crosses were not being handed out as shown in this comic farce.<br /><br />All the grotesque clichés are here, not least the calming and hypnotic effect of Wagner's music upon the little man. If only the producers had kept Ian Kershaw on side. Then they might have discovered that Franz Lehar's \"Merry Widow\" was more likely to float the Fuhrer's boat than any \"Flying Dutchman\" from the cannon of Richard Wagner!<br /><br />Hitler may have been responsible for the deaths of 60 million people but how can he ever be forgiven for his appalling taste in music?<br /><br />I could go on but I'd be at it for hours.<br /><br />Give it a miss.", "label": "negative"}, {"sentence1": "Despite the overwhelming cult following for this sad \"documentary,\" I must admit to having cordially loathed the film which struck our party as far more a distressing exploitation piece than usefully informative. That said, after seeing the magnificent stage musical drawn from it, one can appreciate what the film might have been in surer hands. <br /><br />One suspects that those many of us who actively suffered through the film may have had any campy delights its crueler fans enjoyed destroyed by the uncomfortable suspicion that too many of us - or those we know - are only a misstep or two away from the deplorable plight of the two mad women depicted who live in and contribute to a squalor they seem incapable of controlling or escaping.<br /><br />The film leaves the viewer desperately wondering how any person could have slid to this level of degradation and, unlike the musical, offers no cautionary clues or explanations, only a horror show unredeemed by humor or insight. <br /><br />This soul crushing flatness of the film makes the achievement of the stage version (hopefully to be filmed ultimately for cable) all the more remarkable. Act II is faithful in almost every detail to the film under discussion but strangely, setting the sad inmates' plight to music, raises the human tragedy to art. Even more important, this act is preceded by a fine Act I where we meet the women before their decent into mutually enabled madness, and are offered hints how their isolated purgatory came about. In short, everything which the FILM is lacking.<br /><br />To the filmmakers' credit (or their successors), the excellent Criterion DVD release includes out-takes and bonus material that partially redeem the main film - behind the scenes photographs, interviews and commentary - filling in some of the blank spots the original editing consciously decided to omit in its drive for unadulterated horror and depression. They can't make the amateurish film itself satisfying, but they can at least make it a bit more comprehensible. <br /><br />Ultimately though, it is only the remarkable stage piece inspired by and drawn from it by book writer Doug Wright, composer Scott Frankel and lyricist Michael Korie which raises the rating of the original GREY GARDENS above a single (generous) star.", "label": "negative"}, {"sentence1": "I thoroughly enjoyed this true to form take on the Dick Tracy persona. This is a well done product that used modern technology to craft a imagery filled comic era story. If you are a fan of or recently watched some of the old Dick Tracy b&w movies then you're sure to get a kick out of this rendition. The pastel colors and larger than life characters rendered in a painstakingly authentic take on an era gone by is entertainment as it's meant to be. I personally find Madonna's musical element to be a major part of this film-the CD featuring her music from this movie is one I've listened to often over the years, it's just so well done and performed musically and tuned to that era. In my mind, Madonna's finest moment both on-screen but especially musically. This is sure to bring out the \"kid\" in you.", "label": "positive"}, {"sentence1": "Until today I had never seen this film. Its was filmed on the sets of the Old Dark House and Frankenstein and concerns a small Bavarian village where supposedly giant bats are sucking the blood of the villagers.<br /><br />Frankly its a damn good movie that has atmosphere to spare and a cast that won't quit, Lionel Atwill, Dwight Frye, Faye Wray and Melvin Douglas playing a character named Brettschnieder which is of interest to me since that was my great grandmother's maiden name.<br /><br />This is a carefully modulated film that has suspense and witty one liners that slowly builds for its brief running time, only going astray when about ten minutes before the end they realized they had limited time to wrap everything up. From that point to the end its a straight run to the finish with very little of the fun that preceded it.<br /><br />Leonard Maltin and IMDb list a running time of 71 minutes and warn of shorter prints. The trouble is that IMDb and Maltin can be wrong, and in this case I think they are since a source I trust more says the full running time is 67 minutes (The Overlook Film Encyclopedia) Quibbling about this I know is insane but since most prints that are available tend to run around 60-63 minutes the amount of missing material is considerably less if its only 67 minutes long. Personally I think it won't matter that much since its at most five minutes and I doubt very much it will make or break the film.<br /><br />What ever the running time , if you like creaky old films, do, by all means do, watch this movie, its a great dark and stormy night film.", "label": "positive"}, {"sentence1": "An update of the skits and jokes you would have seen on a Burlesque stage in the first half of the 20th Century. It's a string of several jokes acted out. Some of them you could tell your Grandmother, some of them not, but it's a fairly safe bet she's heard them all before. For what it tries to be, it's not too bad. Before you rent it, remember that it's an older style of entertainment and has more value as history than as comedy or titillation. Robin Williams has a couple of bits, but he's interchangeable with the other players.", "label": "negative"}, {"sentence1": "I enjoy Ralph Bakshi films (\"Wizards\", \"Cool World\" and the underrated animated \"Lord of the Rings\") and am a Frank Frazetta collector and fan. I am also a sword and sorcery fan who loves the worlds of Edgar Rice Burroughs and Robert E. Howard.<br /><br />I missed \"Fire and Ice's\" theatrical release back in 1983 and have looked forward to seeing it on video or at some revival ever since then. Therefore the 2005 release was a dream come true for me. However, I bought it with some trepidation, because I hoped it would not be only worth watching once and then put on the shelf as a \"collectible\" gathering dust until the day I died. Fortunately my fears were groundless and I was pleasantly impressed with this movie.<br /><br />As with Frazetta art this is a gritty film that has a physicality and sexuality that is hard to find in most fantasy/sword and sorcery films without being cheesy or dirty. The art is good and you see glimpses of Frazetta at his best. Even my young boys loved watching it with me and ask to watch it again and again. However, my wife has some objections due to the scantily clad princess (very Frazetta-esquire). I don't mind that because it is believable and there is no sex scene.<br /><br />There is roto-scoping used, but personally I enjoy roto-scoping. It gives more fluid and realistic movements to the characters that is hard to find in animation.<br /><br />Despite some continuity problems, I recommend this film to all Bakshi, Frazetta, Conan, and sword and sorcery fans. Enjoy!", "label": "positive"}, {"sentence1": "I think my summary sums it up. I found it inane and stupid. I also saw the ending a mile a way. Everyone is copying that ending anymore when doing a TV/Theater crossover anymore. Sometimes, it's better to let the movie stand alone.<br /><br />Others, its better to forget the movie altogether. This is one of the others....", "label": "negative"}, {"sentence1": "The script is nice.Though the casting is absolutely non-watchable.No style. the costumes do not look like some from the High Highbury society. Comparing Gwyneth Paltrow with Kate Beckinsale I can only say that Ms. Beckinsale speaks British English better than Ms. Paltrow, though in Ms. Paltrow's acting lies the very nature of Emma Woodhouse. Mr. Northam undoubtedly is the best Mr. Knightley of all versions, he is romantic and not at all sharp-looking and unfeeling like Mr. Knightley in the TV-version. P.S.The spectator cannot see at all Mr. Elton-Ms. Smith relationship's development as it was in the motion version, so one cannot understand where was all Emma's trying of make a Elton-Smith match (besides of the portrait).", "label": "negative"}, {"sentence1": "This film wasn't programmed in Italian cinemas,I have seen it at a manifestation called \"fantafestival\".I find it terrible because some scenes seems like music videos chaotic and dark, the use of fluorescent colors is ridicule and there's no suspence in the film. Music is completely out of the story and I don't have words to describe the visual effects.If you look at the first scene the film seems to be interesting, but a few minutes later it becomes busy.The story is interesting but the development needs a complete review.", "label": "negative"}, {"sentence1": "\"Hollywood Hotel\" is a fast-moving, exuberant, wonderfully entertaining musical comedy from Warners which is sadly overlooked. It should be remembered if only for providing the official theme song of Tinseltown -- \"Hooray for Hollywood.\" The score by Richard Whiting and Johnny Mercer has a number of other gems, however, including the charming \"I'm Like a Fish Out of Water,\" and \"Silhouetted in the Moonlight.\" The best musical number is \"Let That Be a Lesson to You,\" in which Dick Powell and company detail the misadventures of people who found themselves \"behind the eight-ball,\" a fate which literally befalls slow-burning Edgar Kennedy at the number's end. The picture celebrates Hollywood glamour and punctures it all at once, as it gets a lot of comic mileage out of pompous and ego-maniacal actors and duplicitous studio executives. The cast includes a gaggle of great character comedians--Allyn Joslyn as a crafty press agent, Ted Healy as Dick Powell's would-be manager, Fritz Feld as an excitable restaurant patron, Glenda Farrell as Mona Marshall's sarcastic Gal Friday, Edgar Kennedy as a put-upon drive-in manager, Mabel Todd as Mona's goofy sister, and Hugh Herbert as her even goofier dad. The \"racist\" element mentioned in another review here is a ten-second bit where Herbert appears in black-face during a pseudo-\"Gone With the Wind\" sequence. It's in questionable taste, but it shouldn't prevent you from seeing the other delights in this film, notably the Benny Goodman Quartet (including Teddy Wilson and Lionel Hampton!) in what I believe is the only footage available on this incredible jazz combo. The \"Dark Eyes\" sequence goes on a bit too long and comes in too late, but otherwise \"Hollywood Hotel\" is a gem, well worth your time and certainly a film which should be considered for DVD release.", "label": "positive"}, {"sentence1": "In a penitentiary, four prisoners occupy a cell: Carrère (Gérald Laroche), who used his company to commit a fraud and was betrayed by his wife; the drag Lassalle (Philippe Laudenbach) and his protégée, the retarded Pâquerette (Dimitri Rataud), who ate his six months sister; and the intellectual Marcus (Clovis Cornillac), who killed his wife. One night, Carrère finds an ancient journal hidden in a hole in the wall of the cell. They realize that the book was written by Danvers (Geoffrey Carey) in the beginning of the last century and is about black magic. They decide to read and use its content to escape from the prison, when they find the truth about Danvers' fate. \"Maléfique\" is an original, intriguing and claustrophobic French low-budget horror movie. The story is practically in the same location, does not have any clichés and hooks the attention of the viewer until the last scene. I am a great fan of French cinema, usually romances, dramas and police stories, but I noted that recently I have seen some good French horror movies, such as \"Un Jeu d' Enfants\", \"Belphegor\" and \"Dead End\". My vote is seven.<br /><br />Title (Brazil): \"Sinais do Mal\" (\"Signs of the Evil\")", "label": "positive"}, {"sentence1": "This is a simple tale but it feels very manipulative. It lacks pathos for it does not leave a room for imagination or a personal thought or time for reflection.<br /><br />The animation is well done but I feel like it is too presentational. I would have preferred more images from behind, more space in the background and maybe then this would not feel so kitsch to me.<br /><br />But for a Hollywood style film it works OK but it is very derivative of Aardman films and this is bothering to me. Perhaps a longer film will test if this maker can do without the voice-over.<br /><br />I think the voice over is too glib.", "label": "negative"}, {"sentence1": "American icon Henry Fonda portrays \"Elegant\" John Howard, an aging trucker who has had his beloved big rig \"Eleanor\" repossessed after a lengthy hospital stay has forced him to miss his payments. Deciding that he would like to make just one more perfect run, he breaks out of the hospital, steals back Eleanor, and hooks up with old friend Penelope Pearson (Eileen Brennan), who is in need of relocating her troupe of prostitutes.<br /><br />Fondas' wonderful performance is a natural anchor for a film that tugs at the heartstrings as effectively as it tickles the funny bone in the more comedic scenes. A superb cast including Robert Englund, as a reluctant young sidekick, Susan Sarandon (who also gets co-producer credit), and Dub Taylor (a delightful ham, as always, in the most blatantly comedic portion of the picture) helps immeasurably.<br /><br />The ultimately life-affirming nature of the picture and the poignancy of the journey carry incredible weight; this is a picture, that provided you get into it, you can remember long after it's over.<br /><br />The promise of the open road is vividly displayed here; the countryside just looks beautiful. Set to Craig Safans' wonderful music score, it's a remarkable picture in terms of aesthetics.<br /><br />It loses a little something in its final act (the characters played by John Byner and Austin Pendleton are little more than intrusions), but it still maintains its good vibes thanks to the appeal of its central characters.<br /><br />Not at all the exploitation / drive-in schlock picture one might expect from the title (especially its alternate title, \"The Great Smokey Roadblock\"), it's a rewarding movie experience that I can recommend without qualms.<br /><br />9/10", "label": "positive"}, {"sentence1": "I saw the film at the Nashville Film Festival. It was beautifully done, from cinematography to the acting. It's the story of a father and son, and how they come to appreciate each other during a family crisis. Beautifully written with dialog that never rings false, the film showcases the acting talents of Paul Reiser and Peter Falk, among others in this outstanding cast. The film begins with the aging father (Peter Falk)is trying to figure out why his wife (Olympia Dukakis) has left him. The father presents himself, unannounced, on the doorstep of his son and daughter-in-law. The father and son take off the next day to look at some property and end up taking a classic road trip. They fish, play pool, watch a baseball game, get drunk, get involved in a barroom brawl, and dance with strange women. But more important, they each confront the unspoken tensions that can affect any family. It's the kind of film that touches the heart and makes one appreciate those who are closest to them.", "label": "positive"}, {"sentence1": "I am SURE there is some sort of IMDB cult that likes movies that MST3K made fun of. After seeing both this and \"Werewolf\" and reading dozens of comments about how underated they are, I became convinced that there is some conpiricy going on here. Alot of people are saying that people who hate it \"are only scared by gore\", \"Don't know good horror\" or stuff like that. Well, I don't really care for gore, but I do want SOMETHING to happen in a movie! Most of it is just the wife sitting and looking around! Or walking around the house/garden! A movie requires something to give it atmosphoere, you don't get it by just have pointless scenes were someone walks around and stares. Oh, and \"Makes you think\"? Yeah, I was thinking \"MOVE! YOU @#$0&%!!\" One of the worst horror movie I have ever scene! <br /><br />P.s. For the record, I am a big fan of the old style of horror, Dracula, Frankenstein, That kind of stuff.", "label": "negative"}, {"sentence1": "In life, we first organize stones (Piedras in Spanish) such as a career, family, friendship, and love. In this way, we shall find space between these to fit smaller stones, our small necessities. If you act in an inverse way, you will not have enough room for larger stones. The five protagonists in this film are women who have not been able to organize the large \"stones\" in their lives. Ramon Salazar, a Spanish motion picture director defines his first feature Stones in this way. The film tells the parallel, conflicting trajectory of five women: Anita (Monica Cervera, 1975-), Isabel (Angela Molina, 1955-), Adela (Antonia San Juan, 1961-), Leire (Najwa Nimri, 1972-), and Maricarmen (Vicky Pena, 1954-).All are endeavoring to remove the stones that insistently appear in their path or, worst, that are in their shoes. They are five Cinderellas in search of Prince Charming and a new chance in life. The best story of these five Cinderellas is that of Anita (Monica Cervera) who also stars in \"20 Centimeters,\" \"Busco,\" \"Crimen Ferpecto,\" \"Entre Vivir y Sonar,\" \"Hongos,\" and \"Octavia.\" Sarge Booker of Tujunga, California", "label": "positive"}, {"sentence1": "Who in their right mind plays a lyrical song at the same time they are portraying an emotional scene between two people? When Flipper confronts his wronged wife in the dressing room, the song sung with lyrical content is as loud as the dialog, so one can hear neither, diluting any emotional impact the scene may have had. The scenes of Annabella getting beaten by her father with his fists, a lamp and then a belt was so cartoonish as to be absurd. This entire movie is a cartoon, the rampant prejudice against whites is literally astounding. The discussion by the black women after flipper's wife finds out he has cheated on her with a white woman - as if it were a discussion by an oxford debating team, is ridiculous. The rampant racism might be possible to endure, but the soundtrack and the sound mixing during this 'movie' is too much. It was a technically poorly made movie. There is no understanding of the basic craft of movie making, the sound track, the editing and the desperate attempt of great actors trying to keep this movie afloat. I actually felt sorry for Anthony Quinn, wondering why he had accepted a role in this flick - his appearance in this is painful. This is the first movie I have seen by this director and it will be my last.", "label": "negative"}, {"sentence1": "For anyone who has seen and fallen in love with the stage musical A CHORUS LINE, the movie is a shoddy substitute. Not only are songs cut, but unnecessary plot twists added, new dance sequences choreographed, and, let's face it, Richard Attenborough just doesn't know how to film dancers.<br /><br />Onstage, Michael Bennett's A CHORUS LINE was just that: Michael Bennett. His idea, his choreography, his direction, his gift to Broadway and the rest of the world. It was two hours of hard-hitting, in-your-face realism that really made you feel for these \"boys\" and \"girls.\" The movie, however, lacks empathy and depth: the actors look like they are auditioning for A CHORUS LINE rather than actually auditioning. Every move, every line of dialogue seems so weighted and planned; Michael Douglas, especially, as Zach is too in control for us to believe that he is this extraordinarily bitchy choreographer. Even when he throws his temper tantrums, you never quite believe him because every gesture, every accented word, every nuance is so obviously rehearsed. And as for him not dancing: Kevin Kline auditioned for the role of Zach on Broadway. Michael Bennett loved his reading, but Kline couldn't dance and ultimately lost the part. How I wish they had done the same for Douglas! A CHORUS LINE is supposed to be a show about nobodies, and aside from a few recognizable faces (Vicki Frederick, who played Cassie on Broadway, as Sheila and Khandi Alexander, of TV's NewsRadio, as one of the many auditioning dancers) you're not supposed to KNOW any of these people. Because you DO know these people. Having a star in any of the roles is a terrible decision: when you focus on Michael Douglas and his ranting instead of on the girls and boys on the line and their stories, you lose something.<br /><br />It is truly unfortunate that the best sequence in the show (Montage: Hello Twelve, Hello Thirteen, Hello Love) is cut drastically to make way for a terrible new song entitled \"Surprise, Surprise\" that surprisingly received a nomination at the Oscars. Cassie's \"mirror dance\" has a new song and tragically boring choreography -- one wonders why they bothered to shoot a movie version at all if they were going to mess with a working formula this much.<br /><br />For fans of musical theatre and those who enjoyed the stage version, this movie is a sad mockery of everything they cherished and loved. For those who never got to see the original production, either on Broadway or on tour, this movie is the only reference they will have to go by. And they'll have to wonder just how it got to be the longest-running musical in Broadway history -- until a little show called CATS overtook it in the late 1990's. But THAT is a different story, and don't even get me started there.", "label": "negative"}, {"sentence1": "I first saw this back in the early 90s on UK TV, i did like it then but i missed the chance to tape it, many years passed but the film always stuck with me and i lost hope of seeing it TV again, the main thing that stuck with me was the end, the hole castle part really touched me, its easy to watch, has a great story, great music, the list goes on and on, its OK me saying how good it is but everyone will take there own best bits away with them once they have seen it, yes the animation is top notch and beautiful to watch, it does show its age in a very few parts but that has now become part of it beauty, i am so glad it has came out on DVD as it is one of my top 10 films of all time. Buy it or rent it just see it, best viewing is at night alone with drink and food in reach so you don't have to stop the film.<br /><br />Enjoy", "label": "positive"}, {"sentence1": "Wow, it's been years since I last saw this movie. Watching it in 2008 is certainly different than watching it in 1986. Initially I didn't' think I would make it through the movie. Hunt Stevenson (Michael Keaton) was so obnoxious, arrogant and disrespectful that I found it hard to watch him. He embodied every negative stereotype of Americans. If that wasn't bad enough, once the small American town's finest workers were shown the image only got worse. On the opposite spectrum the Japanese were presented as emotionless, robotic workaholics. The movie wasn't even all that funny, I only hung in there because of the nostalgic value of it. And I'm glad I continued the watch.<br /><br />Just like boxing, judges are swayed by how you finish the round. This movie went from about a three up to the seven I rated it because of the ending. The end was excellent. You always want a harmonious ending and this was just that. It was great that the town got to keep there jobs and keep the factory, but what was most special was the marriage between the Japanese customs and values and the American customs and values. It was a mediocre movie that ended on a high note.", "label": "positive"}]