[{"sentence1": "Gloria Victor and Dolores Reed in space girl costumes.<br /><br />I love 50 sci fi, I even love cheesy 50s sci fi, but this film is really, really bad. And not in a MST3K kinda way.<br /><br />Virtually unwatchable as a couple of bozos do their best \"hip cat\" impression of Abott & Costello.<br /><br />Chessecake can usually save cheesy sci fi, such as in \"Cat Women On The Moon\" but it can't in this case. This film requires a mute button and fast forward feature.<br /><br />That said, I could watch Gloria and Dolores walk around the space ship for about an hour or so.", "label": "negative"}, {"sentence1": "It is finally coming out. The first season will be available March 2007. It is currently airing on ABC Family from 4-5 pm eastern time Monday through Friday. The last episode will air on December 19th at 4:30. I missed it the first 100 times around. I wish I could buy the whole series right now. Who does she pick? I have to write 10 lines in order to reply to the first comment. What am I going to say. La da da de de. La da da de de nope only up to 8 how do I get to 9 almost almost awww 9 now I need 10 - 1, 2, 3, 4, 5, 6, 7, I missed counted this is only number 8. Punky Brewster is pretty awesome too. Almost to 10 almost awwwwww.", "label": "positive"}, {"sentence1": "To put it simply, I enjoyed this film. The reason for my interest & enjoyment was not related to anything other than the subject matter itself. I had heard tales from my mother and grandmother about how Northern England working class life and attitudes used to be (as experienced by them)and this is an interesting depiction that seems to faithfully represent what they told me. In particular, the paternalistic but overbearing father who \"knows\" what is best for his family along with his stubborness when this paradigm is challenged. (Not much has changed there then!!)<br /><br />People who have seen the play will probably be disappointed with the film because the story does not easily transfer across the different media. In a sense however, the film is an historical document and I personally enjoyed it, if only because of the way it conveyed a social phenomenon.", "label": "positive"}, {"sentence1": "This is a bit of a first for me, the first time I have ever been disappointed in a Tim Burton film. POTA isn't a bad film (great sets, costumes and the odd great performance) but it could have been made by any off-the-shelf hollywood director. The pacing was very odd, the last third was just spent waiting for the film to end, by myself and the cast. Tim Roth was excellent, probably the only pleasure in the film. Come back Tim.", "label": "negative"}, {"sentence1": "I think this show is definitely the greatest show. Jessica Alba does such a great job in it. Michael Weatherly also does an awesome job, as well as the rest of the cast. The show is very intriguing and they have wonderful storylines and their stunts are amazing. It's like watching a 1-hour movie. It's definitely worth watching.", "label": "positive"}, {"sentence1": "I first saw this when it was picked as a suggestion from my TiVo system. I like Danny Elfman and thought it might be interesting. On top of that, I'm a fan of Max Fleischer's work, and this started out with the look and feel of his 30s cartoon. With both of those, I thought it would hold my interest. I was wrong. Just a few minutes in, and I had the fast forward button down. I ran through it in about 15 minutes, and thought that was it.<br /><br />Afterwards, I read some of the other reviews here and figured I didn't give it enough of a chance. I recorded it again and watched it through. There's 75 minutes of my life I'm not getting back.<br /><br />I can't believe there aren't more bad reviews. Personally, I think it's because it's hard to get to the 10 line comment minimum. How many ways are there to say this is a waste of time?<br /><br />The movie comes across as though it was made by a few junior high kids ready to outrage the world and thinking they can with breasts, profanity, and puke jokes. The characters are flat. The parody of \"Swinging the Alphabet\" is lame, essentially cobbling the tune, getting through A - E, hitting the obvious profanity a \"F\", and then having no idea where to go. The trip through the intestines to the expected landing doesn't work the first time, let alone the following ones. <br /><br />Across the board, the entire movie is what you would expect from someone trying to \"out-South Park\" Stone and Parker without the ability to determine what is and isn't funny. This might be amusing if you're high. Otherwise, it's not.", "label": "negative"}, {"sentence1": "Having seen men Behind the Sun I guess I hoped for an evolution in style & technique to match the larger scale of this movie. I was also quite interested to see someone make a hard-hitting fact-based fictionalised account of what happened during this most notorious of Japanese atrocities, but this is not it. This plays like a bottom-to-mid tier European Nazi exploitation movie from the 70s - e.g. SS Experiment Camp etc (perhaps more like Deported Women of the Special Section actually). Granted it has a greater scope and more people running around, but it resorts to the same cheap and cheerless device of lots of hapless non-actors limply falling over to the sound of ridiculously fake gunshots, spiced up with the occasional poorly executed 'shock' sequence. The admittedly horrible documentary footage is roughly spliced in between scenes so hackneyed that even these real images are robbed of much of their power. Watch channel 4's 'The Holocaust' (aired recently (still running?), as of 1 No 2006) for a genuinely disturbing documentary on the evils of war (featuring excellent in-context use of actual footage). This is the type of treatment the horror of Nanjing deserves, not this hackneyed exploitation garbage (a better executed exploitation movie minus the disrespectful use of stock footage would have been fine, but again this is not even a very good exploitation movie). Rating: 3 (5 as exploitation, 1 as a treatment of the subject).", "label": "negative"}, {"sentence1": "We toss around the term \"superstar\" way too lightly these days, but here's one guy that truly deserves it.<br /><br />I was glued to the set this entire show. The song selection was perfect -- it only contained the songs I actually wanted to hear and cut in with documentary footage during the weaker new songs. I loved that the band was just a five guys on stage in a very minimalist environment. (With songs of this strength, you don't need a circus to be entertained).<br /><br />The shots of the crowd were amazing, too. How many performers can affect the original Beatles fans (now in their 50's and beyond), get young kids to jump up at the opening lines of \"Can't Buy Me Love\" and impact everyone in between? <br /><br />While watching, I also realized that in the wake of John Lennon's tragic death, Paul McCartney instantly became an afterthought. Paul not only lost John and George (no matter what their final relations were, it must be hard to lose someone with whom you changed the world), but he also lost his wife Linda and never really seemed to garner the acknowledgment Lennon's murder received. I agree that Lennon's murder was horrible, but only now did I realize that Paul was sort of forgotten in the aftermath. I was very happy that he's found love again in Heather.<br /><br />As for those complaining about the audio/video quality, I had no complaints whatsoever; both were crystal clear on my set. I think these same people will complain about the quality of DVD when the next format comes out; they'll never be satisfied.<br /><br />My only regret was not buying a ticket to this show when I had the chance. Thanks to this video I was able to enjoy it.<br /><br />When people remember John Lennon, they will first remember his murder and then his music. I now have a new appreciation for Paul McCartney, because, if nothing else, he will be remembered for his music first. And let's hope another lunatic won't change this, because the McCartney catalog is pretty good.", "label": "positive"}, {"sentence1": "All of those who voted less than 5 are obviously not fans of clean, tongue-in-cheek humor. Keaton is brilliant in this - as in most of his work. This is not a blockbuster, bigger-than-life affair. This is campy, slapstick humor played out by some of Hollywood's best (and very versatile) actors. Piscopo was equally on the mark as the top dog wannabee, once.<br /><br />If you want to see the funniest attempt at not really cussing ever filmed, you gotta see Dimitri do his piece as Morone.<br /><br />I gave it a 7.", "label": "positive"}, {"sentence1": "There are some things I will never understand; why underwear comes in packs of threes when clearly thats not enough is an example. Similarly, I will never understand this film, and that is brilliant. If you approach this film expecting an actual movie, you might as well be approaching Satan expecting a hug; although that may well be possible if you greet this film's Satanic figures. Take Pitch for instance; the most ineffectual, camp, unhellish portrayal of a devil since Freddy Mercury and Wayne Sleep joined forces to create a ten foot Satan costume from red body paint and horns covered with condoms. However, it does create some of the most hilarious moments of any film ever. Seriously, this is no understatement. The same can be applied to every other character, bar the little girl who acts so sickly innocent she's probably overcompensating for some serious crime she's part of. Then again, if Santa's inter-space recon station is real, there is no chance she could have avoided him this long. Put simply, if you haven't seen this movie, you cannot consider yourself a serious buff. The achingly funny characterisation, acting, concept, and almost-under-the-radar racism makes this a must see above any film to date (if you're after pure laughter that is).", "label": "positive"}, {"sentence1": "The original show was so much better. They should have left on a good note. This movie killed the whole idea. It was boring, over-dramatic, and the funny parts were too far in between to make up the slack. This movie really seemed like it was trying way too hard to be serious, and that was definitely not what I was wanting from this sequel. Not to mention, that for a long time it was just depressing about the same thing over and over again. So, sorry, Tyler Perry, but try harder next time. This movie is just kinda dull, and not that funny either. Sorry. 4/10 stars is it.<br /><br />Jay Addison", "label": "negative"}, {"sentence1": "If you have seen very less films, this might be a big one for you. If you have seen lot of films, this is a joke. The acting of real heroes is portrayed very badly. Not to mention, there are songs, there are lot of flashbacks, and most importantly, the fighting scenes are stupidily performed. New characters, good direction, would have done a better job, but since it contains all the bollywood heros/heroines, you can predict whats going to happen next. You do not feel sad when something happens, the emotions they protray is terrible, mainly because we have seen this actor in 1000 other hindi movies. It suppose to be a realistic movie, but it fails to show. There are times you wondering, you have thousands of army vehical filled with soldiers moving and the pakistanis are bombing at them and none of their bomb hits them. Are the pakis really bad at aiming or the director made them look stupid? There were only a few characters acting that was very good, but as far it is concerned with plot, action, it is poorly directed. This movie could have been short if they took out songs, flashbacks, stick to the point.", "label": "negative"}, {"sentence1": "Glacier Fox is one of the most heartrending and wonderfully photographed wildlife films ever made.<br /><br />The film makes you care about each member of this fox family, from the blind cub to the strongest - their adventures are at times hilarious and also tragic. Set against an inhospitable countryside, the audience's hearts warm to the family members.<br /><br />The music score and lyrics tell the story intercut with narration about what is happening in general terms.<br /><br />Man remains one of the biggest predators, but we are left in no doubt that the foxes are capable of living, not just surviving beyond human endeavours.", "label": "positive"}, {"sentence1": "I was so eager to see this one of my favorite TV shows.I saw Universal trademark followed with a newly acquainted title and theme song which still impress me.Computer animation on some scenery like a solid title name\"The Jetsons\" or a dimension view of a spaceship approaching an amusement park and more made this version splendid and fantastic.Shortly after that till the end...I couldn't believe my eyes!!!!How lucky I was that I could forget all I had seen.Just songs by Tiffany and its theme song in new arrangement were in my head.Anyway,I wish to see this space-aged family (also The Flintstones and Yogi Bear) in all graphic computer design as Toy story or Bug's life.The best style for Hanna-Barbera's in my opinion.", "label": "negative"}, {"sentence1": "This movie is rated a classic on sentiment not on any quality of movie-making. It moves from the unlikely to the unbelievable, from the unrealistic to the ludicrous.<br /><br />The unbelievable plot revolves around an attempt by two British soldiers and a Hindu gofer to rescue a third soldier who has been captured by insurgent Indians. In the later scene we see a full regiment with drum and bagpipes marching into an ambush. In the British army, a sergeant does not order up a rescue attempt, and if you get past that, he does not attempt it with only one other soldier and an Indian servant when there is a full regiment on hand. The Indian insurgents are so incredibly inept it is laughable...there are hundreds of them but they can't hold their prisoner or kill the two rescuers, of course not. At one point we see the British soldiers throwing blocks of stone down from the battlements at the insurgents, who are scattered around the mountainside in ambush...one would have to have an eggplant for a brain to think this would do any damage. After Cary Grant as the rescued prisoner is shot, he lies on the floor looking around at the water boy...hardly the actions of someone who has been shot in the back. The water boy bravely blows a bugle (which comes from nowhere) to sound the alarm...this he does by standing up high on a wall so he can be seen and shot by the bad guys, and we shed a tear as he keeps trying to sound more notes as he is repeatedly shot and the bugle call breaks up into feeble squawks...instead of blowing the bugle while hiding behind cover as anybody with half a brain would do. This scene has deservedly been parodied in comedy sketches. If they wanted to make a Buster Keaton comedy, they should have hired Keaton and done it better.", "label": "negative"}, {"sentence1": "This is probably the fastest-paced and most action-packed of the German Edgar Wallace \"krimi\" series, a cross between the Dr. Mabuse films of yore and 60's pop thrillers like Batman and the Man from UNCLE. It reintroduces the outrageous villain from an earlier film who dons a stylish monk's habit and breaks the necks of victims with the curl of a deadly whip. Set at a posh girls' school filled with lecherous middle-aged professors, and with the cops fondling their hot-to-trot secretaries at every opportunity, it certainly is a throwback to those wonderfully politically-incorrect times. There's a definite link to a later Wallace-based film, the excellent giallo \"Whatever Happened to Solange?\", which also concerns female students being corrupted by (and corrupting?) their elders. Quite appropriate to the monk theme, the master-mind villain uses booby-trapped bibles here to deal some of the death blows, and also maintains a reptile-replete dungeon to amuse his captive audiences. <br /><br />Alfred Vohrer was always the most playful and visually flamboyant of the series directors, and here the lurid colour cinematography is the real star of the show. The Monk appears in a raving scarlet cowl and robe, tastefully setting off the lustrous white whip, while appearing against purplish-night backgrounds. There's also a voyeur-friendly turquoise swimming pool which looks great both as a glowing milieu for the nubile students and as a shadowy backdrop for one of the murder scenes. The trademark \"kicker\" of hiding the \"Ende\" card somewhere in the set of the last scene is also quite memorable here. And there's a fine brassy and twangy score for retro-music fans.<br /><br />Fans of the series will definitely miss the flippant Eddie Arent character in these later films. Instead, the chief inspector Sir John takes on the role of buffoon, convinced that he has mastered criminal psychology after taking a few night courses. Unfortunately, Klaus Kinski had also gone on to bigger and better things. The krimis had lost some of their offbeat subversive charm by this point, and now worked on a much more blatant pop-culture level, which will make this one quite accessible to uninitiated viewers.", "label": "positive"}]