[{"sentence1": "This has to be, hands down, hats off, one of the most uproarious comedies ever made. Starting with the animated blowing, popping bubbles, the entrance to the Daytime Awards, the usual phony drivel spewed by the stars on the red carpet, the rehearsed and badly acted acceptance speech, the venomous comments uttered by the actor's jealous co-stars and producer, under phony smiles. Now THAT is only in the first few minutes. Then, all hell breaks loose from there and it only gets more frantic and ridiculous. Ridiculous in a good way, no, make that a great way. This was the first time I'd seen the always charming Teri Hatcher. While I may not be a follower of Desperate Housewives, she herself is always watchable - same goes for Lois & Clark. Not a huge follower, but if I run across an episode I'd watch it. Robert Downey, jr., does a great turn as slimy, smarmy, snaky, sycophantic David Seaton Barnes, the producer who'd give his right eye to see Sally Field's Celeste Talbert leave the show, if only to finally get to get it on with Cathy Moriarty's Montana Moorehead.<br /><br />Moriarty absolutely shines in this movie, just as she had everywhere else she's appeared. Here, all she has to do is scream \"I HATE YOU I HATE YOU YOU CREEP!\" or give one of her anti-Celeste-co-conspirators an evil grin, and she has me rolling in the aisles. Yes, Cathy Moriarty is a very gifted actress, and one hell of a comedienne. Sally Field gratefully departs from the usual 70-MM-sized Lifetime Tragedy of the Week movies, and we're all reminded why she is who she is today, having started off in comedy afraid of nothing. Her ensuing years of drama had hidden her sense of humor, but like a caterpillar in a cocoon, the brilliant comedienne she is had blossomed and it was joyous to see her as hilarious as she was. The thing with dramatic actors and actresses is that you see in such heavy, serious roles, that you associate them with their character and you can't believe it when you see them finally having some fun on screen.<br /><br />How lucky were the producers to land Carrie Fisher, if only for a glorified cameo. She doesn't realize what a presence she bears on screen. She takes a role which, in the hands of a lesser actress, could easily have been forgotten, but she owns the character and it seems as if she wrote it herself.<br /><br />How lucky was Elisabeth Shue to get thrown in the middle of all this! At the time, she wasn't really known for much. Adventures in Babysitting was kind of cute (yes, I was dragged to an evening show for which I had to pay full price), but she didn't hold my attention - - much. But here, she makes the most of her character - star's niece who falls in love with the star's ex-co-star-and-lover who, of course, turns out to be the niece's father, and the star turns out to be the poor girl's mother.<br /><br />I'll stop there - I feel I practically wrote a book about this brilliant screwball comedy, or at least a novela. If you've seen it, then reminisce. If you haven't, you've missed a real classic, but not really. The DVD's are made of a material that'll last for at least 25 years, and this movie is timeless, so what the hell.", "label": "positive"}, {"sentence1": "I watched this movie, and hoped for something to get better the entire time. What is so great about a guy with no emotion? *yawn*<br /><br />You never see Alex show emotion for anyone other than his son. Yeah, I know that this is why his son is the only one to cause him to lose his temper (if you can call it that), I get it.<br /><br />Characters are undeveloped, relationships aren't given enough time to be understood. In one scene Sarah says they won't fall in love, and the next time we see her she's talking about how his death really shook her up because they were so close? Logic synapses abound in this film.<br /><br />It's like someone watched Boogie Nights and wrote this part to mimic Little Bill. Even the scene where he \"loses his temper\" is the same as when Little Bill shoots his wife, down to the facial expression (or lack thereof). Yes, William H. Macy is good at portraying a man without emotion - been there, done that - can you say Magnolia?<br /><br />This movie didn't only lack emotion, it lacked substance, a good script, developed characters, and a plot. And it certainly lacks my recommendation. :)<br /><br />~A~", "label": "negative"}, {"sentence1": "Oh God,what an idiotic movie!Incredibly cheap with fake special effects(the creature is played by one guy in lame costume)and stupid plot.All dialogues are unbelievably bad and these actors(HA!HA!HA!)...they're simply ludicrous.For example I have never seen so annoying characters like in this junk(these dumb kids or pregnant woman with his husband and many more).All in all,this is a great entertainment if you're drunk.Avoid it like the plague.Am I drunk?I don't think so...", "label": "negative"}, {"sentence1": "The only reason I don't give this movie fewer than 3 stars is because it isn't quite on par with a movie like Manos: The Hands of Fate. This movie's greatest crime is the fact that it is head-meltingly boring & terribly, unforgivably British. The premise of this movie sounds potentially promising, the whole teleporting concept, but the direction they went with it was completely uninteresting. It was more a movie about research funding and bowties than projecting lasers. The actors were wooden, unemotional, and aloof. As was the love affair between the two scientists-- which was anything but intriguing. I never was able to tell what the attraction was between them as the chemistry was non-existent. Nor did I really understand why the melty-faced main guy decided to slaughter everyone he met. At least now I know that I should always give someone a fair hearing before I cut off their research grants, else they go rampaging about, killing wantonly with goofy hand gestures.", "label": "negative"}, {"sentence1": "Robert Taylor as the mad buffalo hunter Charlie Gilson is the main character in this film. At the beginning I was thinking that Charlie would end up redeeming himself like John Wayne in The Searchers or James Stewart in The Naked Spur. But as the film goes along Gilson keeps doing more atrocities until you realize there is no hope for him. Stewart Granger is Sandy McKenzie, who wants to stop hunting because he realizes that the buffaloes will soon be gone and he becomes disgusted by the act of killing. Gilson is a natural killer who makes no distinction between animals or human beings. Debra Paget as the Indian girl is a surprising character considering the self imposed censorship of that time. She lies with Gilson in total resignation even though she hates him. The last scene of a frozen Gilson, is unforgettable.", "label": "positive"}, {"sentence1": "La Coda Dello Scorpione (a.k.a. Case of the Scorpion's Tail) was director Sergio Martino's follow-up to the wonderful giallo Strano vizio della Signora Wardh. This is the quintessential giallo, featuring all the aspects fans of the genre have come to know and love. Twisty plot, beautiful girls, black gloves, sharp blades, and a bit of gore all come together to make one heck of a piece of Italian exploitation.<br /><br />A group of gialli favorites, both in front of and behind the camera, work to make this one of the best non-Argento gialli around. There's the aforementioned Martino adding his touches as director, giallo great Ernesto Gastaldi as the writer, Bruno Nicolai creating the music, and a host of giallo stars and starlets, such as George Hilton, character actor Luigi Pistilli, and the fetching Anita Strindberg.<br /><br />With all this talent behind it, does Scorpione deliver? You bet. The film works on many different levels. It's a thrilling murder mystery, a tense and violent horror film, and a suspenseful thriller. All in all one of the best gialli around.<br /><br />Martino definitely knows what fans want when it comes to gialli. At some points in the film, he almost seems to be channeling Argento in his approach. For example, there is a direct rip-off of the scene in Bird With the Crystal Plumage where the killer tries to break through the door, that actually outdoes Argento's flick.<br /><br />Are there any problems with the flick? Hmmm... only minor ones. First, any scenes that aren't following the murders or the budding romance between the two leads begin to bore. But just before you fall asleep, the killer will pop out of nowhere and you'll be right back in the swing of things.<br /><br />Also, towards the end, the twists get a little too bizarre. I mean, what purpose did the scorpion pins really serve? If you don't play close attention to the dialogue, you could easily become lost with the twisting, weaving storyline.<br /><br />But these minor quibbles aside, La Coda Dello Scorpione is a tense, suspenseful, classy and all around entertaining film for giallo fans. Seek it out!", "label": "positive"}, {"sentence1": "The second Care Bears movie is immensely better than its predecessor. It has a deeper plot, better character development, and the tunes (especially the closing song) are both catchy and warm-hearted. Sure the movie tends to over stress caring but come on, it IS a Care Bears movie. This movie is a great picture to show to kids because it emphasizes friendship, love, and again, caring. Not to mention the Care Bears are just too adorable!", "label": "positive"}, {"sentence1": "I've read most of the comments here. I came to the conclusion that almost everybody agrees that 9/11 is a shocking piece of history. There are a few who think that the added narrative is weak and <br /><br />I agree that the narrative is weak and unnecessary. About two brothers finding each other back after the disaster and the cliff hanger about Tony. But I don't think narration is unnecessary. Like I lot of theorists I think that our own lives are narrations. We are living and making our own autobiography. So if we tell about our lives this is always in the form of narration. We don't sum up facts like: Birth, Childhood, High School etc. We create a story about our live.<br /><br />Because we are familiar with stories, we want to put history in a story as well. Because in the form of a story we can identify ourselves. We can better understand the things happened in history when its told in the form of a story. So that's the purpose of adding a story in documentary. The story is weak, so be it, but we understand whats going on. If it was me out there I would be worried sick about my brother.<br /><br />And the second point, making a blockbuster movie about it. True, it's been to recent to come up with a big movie about 9/11. Though, there have been a few about the subject, but none of them like this documentary. But what if there will be a movie in about 5 years? I agree it is wrong trying to make a lot of money out of 9/11. But I also agree that movies are one of the best way to tell history. How many movies about the World war 2 have we seen? If I had not seen these movies my view of the WW would me totally different. I remember seeing Schindlers List, and I cried for an hour during class. Movies give you a good image of the things that happened in history and although it is fiction it contributes to the memory of the disasters and the casualties. <br /><br />So my point: telling stories is not always bad, it makes us identify with the story, and makes us never forget what happened.", "label": "positive"}, {"sentence1": "A magical journey concocted by Alexander Korda and Michael Powell. These two TITANS of the British cinema have mixed some fabulous ingredients to produce a movie masterpiece! Some of the most ravishing early Technicolor, a SUBLIME and shimmering Miklos Rozsa musical score along with the youthful exuberance of Sabu, the theatrical and malevolent villainy of Conrad Veidt and the exquisite beauty and voice of June Duprez as the princess all work wonderfully well. Miles Malleson who plays Duprez father, the Sultan of Basra, also wrote the perfect screenplay which is appropriately grandiose. DON'T MISS THIS ONE! Since posting the above comments, I have obtained the recently released DVD and can honestly say I'd never seen the picture properly until viewing this DVD version-The clarity and resolution is so precise and the colors are so vivid that I was stunned-This amazing classic can be watched time an again and never fails to charm and delight the viewer. Again, A MUST SEE!", "label": "positive"}, {"sentence1": "The synopsis for this movie does a great job at explaining what to expect. It's a very good thriller. Well shot. Tough to believe it was Bill Paxton's directorial debut, though some shots do look EXACTLY like a storyboard version. <br /><br />Still, there are a few shots that really look good and show some real imagination on the part of Paxton. <br /><br />It's a solid story with some great twists at the end, several of them, all believable, all fun, and best of all, obscured well enough to make them true twists. <br /><br />The child actors in the movie do a great, too. I'm usually wary of movies with kids in starring roles because all too often they come off as Nickelodeon rejects, but both these kids do a good job.<br /><br />This movie is not gory. It's not very scary. But it IS very, very creepy.", "label": "positive"}, {"sentence1": "I turn on 700 Club once in awhile and only agree with some of the statements made- I'm one of many believers that is considered liberal by most Christians and conservative by most non-Christians. I vote my mind, and its usually not rep. or dem. - i don't believe 700 club tells people what to believe, but that it represents many older christians that grew up in very conservative backgrounds. i think many folks misunderstand what is said on 700 club. it bums me out to hear name calling either direction. i think 700 club folks really do love Jesus but are so busy trying to get people to vote conservatively that they've forgotten to show love to certain people and promote peace like Jesus did. Please don't judge Jesus based on ignorant individuals that believe on Him and let's also not be as ignorant with our comments about them. Why ARE people so mean to each other?", "label": "negative"}, {"sentence1": "Who me? No, I'm not kidding. That's what it really says on the video case.<br /><br />Plot; short version: Pretty woman stands around smiling. This, for some reason, makes all men kill each other.<br /><br />\"Find Ariel...Where's Ariel...Can't Find Ariel...\" She's right behind you, you idiot...<br /><br />Most of what can be said about this horrendous little Space Opera has already been said, looks like.<br /><br />A bunch of corny actors playing mostly convicts come in after the first selection of actors is knocked off very quickly. Then they get knocked off in the same way. Every scene is broadcast nearly fifteen minutes in advance. Perhaps it was a drawing of straws to see which actors had the most screen time and bigger pay check. The alien virus/hologram/VR witch/glitch seems physically powerless and doesn't do a thing. Why can't she just stay in the computer instead of doing her \"teleporting vampire\" routine? (Actually, it would've been more interesting if she had been a vampire, or doing more than just standing around looking at people, which is all she ever does. This is enough to make all the men kill each other. Go figure...)<br /><br />This isn't really a space flick. There are far more shots of the old western trail, 1950's Easy Rider trail, Film noir's night club scene, even a jog on the beach in fantasy-land, none of which has any real depth or even makes any sense. The night club scene is in black and white, of course. Worked with \"The Wizard of Oz\". Doesn't work so well, here. This is probably a good thing, as those few shots they DO show of space are depressingly silly. You will probably cry during those moments, especially upon seeing that swirling \"space ship\", which looks about three inches long.<br /><br />Nothing is felt for any of the characters, not because they are convicts or have no personality, but because they are in serious need of acting lessons, except for Billy Dee Williams who really does look depressed and at a loss, probably by being in this work...<br /><br />This is one of those movies that, when viewed with friends, is going to cause some extremely \"loud\" silences, especially when the nerd throws out his attempt at comic one-liners (including the line about French-kissing a meteor...? Did I hear that right? Perhaps not...)<br /><br />The original virtual reality girls get \"killed\", which means nothing, as they are not even real to begin with. Well, the other \"characters\" aren't, either, but that's beside the point. Haha.<br /><br />What's kind of funny is that the scene that graces the video case is some sort of skull-horror-alien looking thing (green filter added on top of that, to give it more of a...uh...green look), which is actually the android after he gets killed and ultimately has nothing to do with anything else afoot.<br /><br />Another odd deal I noticed. Whenever there is an explosion (at least on my cheap DVD copy), everything becomes highly pixelated. I don't mean a LITTLE pixelated, I mean HUGE blocks about 1/16th the size of the screen. Wow.", "label": "negative"}, {"sentence1": "Something very strange happens when you talk about Global Warming: science goes out the window and \"belief\" and \"consensus\" becomes the topic of discussion.<br /><br />It's because of that fact that I give a failing mark to Al Gore's documentary.<br /><br />Instead of promoting intelligent discussion, he kept the debate at the level of \"belief\" and \"consensus\".<br /><br />Of course, when you're trying to sell the world into spending trillions of dollars to \"stop Global Warming\" you may thing it's a problem to tell the scientific truth: we don't know how much of the current warming was caused by humans. Maybe none of it, maybe some of it, or maybe it has over-ceded the next Ice Age and we got really lucky not to have boiled the planet.<br /><br />But the fact remains that we don't know.<br /><br />so we're asked to \"believe\" in the \"consensus\". Never mind that any scientist that strays from the \"consensus\" is ostracized. Never mind that scientific inquiry is about straying from the consensus. Einstein didn't \"believe\" in the consensus, neither did Copernicus or Galileo.<br /><br />So why so much scorn placed on those very researchers who would advance the field by asking the tough questions? If Global Warming is so incontrovertible, surely a few people testing that theory can't be so threatening.<br /><br />What is going on here? That's the movie I was hoping Al Gore would have made. Istead, he chose to shore up his support with the true \"believers\" of the \"consensus\".<br /><br />Sad, really.", "label": "negative"}, {"sentence1": "Have you ever seen a movie made up entirely of long wide shots? No? Me, neither. Well, I've finally seen one in \"Spring in my Hometown,\" and I must confess, now I KNOW why people don't do this. The technique is \"arty,\" to be sure, but it's definitely NOT ripe for public consumption. The technique is heavily flawed simply because the viewer has no emotional attachment to the characters, and perhaps that might be the director's whole intentions. I don't know, I can't read minds, and I certainly don't know enough about the director to make a judgement.<br /><br />But one thing about this movie that IS painfully obvious is its ridiculous anti-American sentiments. As an American, I'm well aware of my country's participation in the Korean War, and I'm very well aware that we weren't always angels, but I'll be damn if I'll take this guy's version of how things happened. According to this blind fool, Americans were not only at the root of the war, we were the CAUSE of the war, and we almost singlehandedly destroyed the country. Whatever, Mister Director. And I suppose you'd still be making this film in COMMUNIST KOREA if we hadn't interfered, right? Talk about forgetting your history. This is almost akin to making the Nazis the \"good guys\" while turning the Allied forces into the \"bad guys.\" This movie is so historically naive and so factually inaccurate that it's almost embarrassing to watch. For a man who comes from a country that owes its very EXISTENCE to American interference, he sure comes off as high and mighty and judgemental.", "label": "negative"}, {"sentence1": "The 60s (1999) D: Mark Piznarski. Josh Hamilton, Julia Stiles, Jerry O'Connell, Jeremy Sisto, Jordana Brewster, Leonard Roberts, Bill Smitrovich, Annie Corley, Charles S. Dutton. NBC mini-series (later released to video/DVD as full length feature film) about the treacherous 1960s, as seen through the eyes of both a white family and a black family. The film's first half is driven by the excellent performance of Dutton as Reverend Willie Taylor and evenly spreads the storyline between the families. However, Dutton's character is killed halfway through and the black family is completely forgotten in a dull, incoherent, and downright awful 2nd half. RATING: 4 out of 10. Not rated (later rated PG-13 for video/DVD release).", "label": "negative"}, {"sentence1": "Despite its stereotypes, virtually 'no-name' cast and an obviously low budget I thought this film was alright; much better than I expected it to be. I was skeptical at first - the idea of a computer virus that can also infect people seemed a little ludicrous to me. But in the end, I thought the film handled the concept well (even if some scenes were a little clichéd).<br /><br />The cast was quite good, and the two leads seemed to take their roles very seriously. I couldn't help thinking, though, that Janine Turner is a bit of a Geena Davis look-a-like. Maybe it's just her face or the make-up, hair and clothes she had in this movie but it just kept nagging at the back of my mind the whole time.<br /><br />While it's not a 'must see' or a great film by any standard, 'Fatal Error' is an entertaining flick that will keep you watching until the end.", "label": "negative"}, {"sentence1": "\"John Hughes' son wrote a high school drama! Wow!\" I thought as I checked the flick's info here on IMDb, late on a Saturday night, having found myself watching the opening credits on BBC2.<br /><br />I've just finished watching it, and sadly it was downhill from there on. Arguably you can't spoil a film this poor, but I'll leave the spoilers out of this review... <br /><br />There's an awful lot of style over very little substance: unfortunately the style hasn't dated too well in the eight years since its release. As for the substance, the film tries to pose an interesting look at the nature of control in society through the microcosm of school-life; but beneath the shiny veneer, a remotely meaningful or relevant argument fails to materialise. Characters are painted in childishly broad strokes, falling into the kind of generic stereotypes the writer's father sought to question in Breakfast Club. <br /><br />Director Kyle Cooper does a decent job keeping the pace up (perhaps relying a little too much on montages of information, which soon becomes a tiresome device, but at least pushes the story along), but his efforts don't sufficiently detract from the poor script and bizarre casting (how anyone is supposed to side with 'Maddox', when Blake Shields gurns and glowers his way through the part, I just can't understand), not to mention the numerous gaping plot holes (I'm all for creative license, but when the \"bad guys\" know the identities of the \"good guys\" making their lives a misery, but fail to act in any way to stop them, you really have to wonder why this script didn't undergo another few re-drafts before production - did Daddy even read it?).<br /><br />I'm sure a younger audience might get some enjoyment from this film (and all power to them), but they're really better off sticking with Hughes Sr.'s high school output, and if the idea of school-time rebellion is what really appeals, the 1968 classic \"If...\" is a much more satisfying examination of the subject.", "label": "negative"}, {"sentence1": "I just saw Adam Had Four Sons for the first time and the thing that struck me was that I believe that the model used was Theodore Roosevelt and his four sons. They were approximately the same ages as the four boys in this film. Warner Baxter in his portrayal of Adam Stoddard talked about the same values and family tradition that you would have heard from our 26th president without some of the more boisterous aspects of TR's character. <br /><br />Like TR all of the Stoddard sons serve in World War I, in this case though the youngest only loses an eye instead of being killed. <br /><br />But what if a female minx gets into this all male household and disrupts things? That's Susan Hayward's job here. In one of her earliest prominent roles, Hayward is a flirtatious amoral girl who marries one son, has an affair with another, and starts making a play for the third. It's an early forerunner of the kind of a part that later brought her an Oscar in I Want to Live.<br /><br />I suppose that with as powerful a model of decorum as Theodore Roosevelt was and Warner Baxter portrays, everyone is afraid to tell Father what's going on. The sons and also their governess Ingrid Bergman. Here's where the plot gets a little silly. Bergman is introduced to us as a governess hired by Baxter and wife Fay Wray for their kids. Wray dies and Baxter suffers some financial reversals in business. Bergman has to be let go. She goes back to France and years later comes back to the family when the kids are grown up. <br /><br />I'm sorry, but I can't believe the kids need a governess now. Hayward is quite right when she confronts her that it wasn't the kids who brought her back. In the normal course of things, Bergman would have gotten on with her life. <br /><br />One of the previous reviewers said that a quarter to a third of the film I have was edited out. Possibly that could be the reason for the many plot holes we have.<br /><br />It's too bad that Ingrid and Susan could not have done another film together in the Fifties when Hayward was at her heights and Bergman had just made a comeback.<br /><br />Susan Hayward is the main reason to see Adam Had Four Sons. And I'm willing to believe that a good deal of Ingrid was left on the cutting room floor.", "label": "negative"}, {"sentence1": "The King Maker is a film about a series of real (citation needed) events that occurred during the Portuguese Occupation in Indochina.<br /><br />Although the costumes and art direction are commendable, the movie still fails to impress the viewer. The acting, in particular, was extremely poor. Some of the actors are trying hard to let tears down and the accents, both real and fake, are extremely irritating. The storyline was also too dumb and too stupid to be true and it seemed more like a history lesson. The movie couldn't even capture that sort of regal and century-old air and it looked more like a botched attempt to make an Asian version of Elizabeth.<br /><br />Final say? Costumes and art direction give the film a breath of fresh air, but the execution was extremely poor and the actors couldn't even give natural bursts of emotion. In short, the movie sounded more like hullabaloo than a script.", "label": "negative"}, {"sentence1": "Second-feature concerns a young woman in London desperate for a job, happy to accept live-in secretarial position with an elderly woman and her son. Thrillers about people being held in a house against their will always make me a little uneasy--I end up feeling like a prisoner too--but this rather classy B-film is neither lurid nor claustrophobic. It's far-fetched and unlikely, but not uninteresting, and our heroine (Nina Foch) is quick on her feet. Rehashing this in 1986 (as \"Dead Of Winter\") proved not to be wise, as the plot-elements are not of the modern-day. \"Julia Ross\" is extremely compact (too short at 65 minutes!) but it stays the course nicely until a too-rushed climax, which feels a little sloppy. *** from ****", "label": "positive"}, {"sentence1": "I haven't liked many TV shows post 1990, but THAT 70S SHOW is great. Never seeing it during it's first run, thinking a gimmicky period piece, I was wrong! I started watching in reruns and the more I watched, the more I liked! Now, it is the only show premiering post-1990 that I watch regularly.<br /><br />Although THAT 70S SHOW mimics some of the styles, attitudes, music, and tastes of the 70s, it does not mire itself in that decade by going overboard with the references and look of the 70s. It contains so much funny, witty, biting dialogue that is delivered with confidence and certainty by its main cast that it overcomes any 70s clichés by just being humorous. The humor is what keeps the show eternally watchable.<br /><br />Although a hilarious sitcom, no matter what time period, the uniqueness of mocking the 70s does work in its favor as it gives the show a signature identity. But its the focus on universal issues (family problems, teen angst, marital issues, peer pressure), dealing with all of them with comic aplomb, that gives the show a mass appeal.<br /><br />The show's center is one Eric Forman (played to absolute comic perfection by future superstar Topher Grace). Eric is a super-skinny, geeky-looking, non-athletic teen and still comes off as super-cool due to Grace's brilliant self-deprecation of the character. Eric has 5 friends Donna, Hyde, Kelso, Jackie, and Fez (played respectively in hilarious fashion by Laura Prepon, Danny Masterson, Ashton Kutcher, Mila Kunis, and Wilmer Valderama). We get to see life in Point Place, Wisconsin through the eyes of these 6 teens and boy do we get a lot to see! Donna, a forward-thinking feminist, is the object of Eric's affection and these 2 have the core relationship of the show. They become a couple pretty soon after the show starts and they are NEVER a boring couple. Most of the shows eps end with them having a meaningful conversation about them and their future and it works as a great insightful bookend, which works as a perfect counter to the prior hilarity. Hyde is Eric's best friend and soon moves in with the Formans when his mother abandons him; Hyde is the mellow, zen, cool one of the group and just sits back, observes, and makes fun of his fellow friends with easygoing aplomb. Kelso is the dumb one of the group and Kutcher plays it the absolute hilt, displaying amazing physical comedy as well as telling some of the most absurdly hilarious ideas and stories ever! Jackie, who starts out as Kelso's girlfriend, is a verbose, self-absorbed debutante cheerleader and is at first only accepted as part of the group b/c of Kelso, but she manages to ingratiate herself to the point where they all HAVE to accept her! And finally, Fez! Fez is the foreign exchange student from some unknown country (we never know exactly where) and he is a scene-stealer! \"I said good day!\" \"You son of a b*tch!\" Valderama is only sporting a foreign accent here as he hasn't one in reality and he is always in character and creates one of the most unique characters I have ever seen. His scene-stealing moments often help make the show for me.<br /><br />The show constantly takes us into the minds and thoughts of these characters through engaging fantasy scenes of how they would like or imagine things to be. The gang repeatedly gets into trouble (most of it on purpose). They constantly play gags on the Point Place residents as well as each other. They hang out most of the time in Eric's basement plotting, pontificating, or just plain playing around.<br /><br />Also figuring prominently in the show are Eric's parents, the menacing, commie-hating Red and the lovable, happy-go-lucky Kitty (played memorably by Kurtwood Smith and Debra Jo Rupp). These 2 adults give the show a much-needed mature point-of-view and constantly berate and advise the 6 ne'er do-wells. Red and Kitty are ably supported by Donna's parents, the buffoonish Bob (played wonderfully for the full run by Don Stark) and blonde bimbo daft Midge (the super-sexy Tanya Roberts, who was on the show for about half it's run). Additionally, for 3 full seasons, Eric's sister from hell Laurie (played brilliantly by the wickedly sexy Farrah-Fawcett lookalike Lisa Robin Kelly) was a major refreshing relief to counter the shenanigans of the main 6 and to be the thorn in Eric and her parents' sides! Kelly came back as a guest character for a few Season 5 eps. But, unfortunately, Kelly's personal problems led to her being replaced by a terrible new actress in Season 6. The newbie didn't last, thankfully, and was gone after a few Season 6 eps!<br /><br />Sadly, at the end of Season 7, Topher Grace (Eric) and early in Season 8, Ashton Kutcher (Kelso) left the show and it never recovered as Season 8 turned out to be it's last. Grace and Kutcher returned for the series finale, though, giving the show a satisfying end. <br /><br />A lot of great supporting and cameo characters would help keep the show fresh through added nostalgia and humor. Top notch supporting players were eternally high Leo (played to the hilt by Tommy Chong), Pastor Dave, Roy (the terrific comic Jim Gaffigan), Big Rhonda, Mitch, Earl, etc. They also got legends Marion Ross (HAPPY DAYS) and Betty White (THE MARY TYLER MOORE SHOW) to play Red and Kitty's mothers, respectively. Many celebrity cameos from the 70s made appearances as well, from Shirley Jones (PARTRIDGE FAMILY) to Pamela Sue Martin (NANCY DREW) to Charo to Ted Nugent to K.I.S.S! It goes on and on!<br /><br />With great nostalgic 70s homages and references, hilarious dialogue and delivery and a nonsensical, take-no-prisoners style of comedic storytelling, THAT 70S SHOW is a television classic!", "label": "positive"}, {"sentence1": "Seriously, I mean very seriously, when I first started watching the show I thought it was good. But the plots just got worse. The storyline were either too boring or predictable. George isn't always funny, he sometimes acts stupid. His jokes are overdone. His mom is the silliest character of the show. How can a mother treat her own son that way, okay if it was the daughter in law, but this was her own son. I give this show a 4/10 just because the first few shows were a little funny. The actors Constance Marie and Masiela Lusha do a great job. Don't know how these shows get to play for so long. <br /><br />If you're really bored like I was and have nothing else to watch, I'd suggest you watch this.", "label": "negative"}, {"sentence1": "I think that that creator(s) of this film's concept deserves a lot more accolades than they probably ever received. It isn't an Oscar caliber film of course, but, at least for me, this film has left a lasting impression since I first saw it back in 1984 (in the theatre). <br /><br />I don't think this is (and hope it isn't) a spoiler, but: imagine acting on your impulses. Doing the first thought that pops into your head, saying the first words on your lips... No restraint, no conscious, nothing holding you back from saying or doing the things that, as intelligent adults, we know we shouldn't actually say or do. If anything, this film only scratches the surface - It doesn't go as far as it could go. <br /><br />In a time when Hollywood seems obsessed with remaking older \"classics\" to try and cash in on today, wouldn't it be nice to see them remake an older film of modest success, for the sake of taking it to the next level? A bit further, or even to explore what the original crew didn't, wouldn't or couldn't deal with 20 years ago? <br /><br />That's just my opinion anyway. :o)", "label": "positive"}, {"sentence1": "Unbelievably bad acting, a no good, unclear story and flashy images and slow-motions where they are needed the least: Adrenaline is everything a movie should not be.<br /><br />Georgina Verbaan (a so-and-so dutch soap actress who hasn't attended her English classes) plays rich girl Freya, who has the habit of 'thrill-seeking'. Which basicly is doing dangerous stunts, break stuff and annoy people. And not in a fun Jackass way. Then there's Dracko (Rivas). He kinda leads the bunch but has other illegal activities on the side. Then there's Freya's dad (Lockyer), who plays a dubious role as well. And, in the end, we got Jason (debutant Fyall), the boyfriend of Freya.<br /><br />One day, Freya gets disappeared and everybody seems involved but we, the viewer really don't care as nobody of the cast is either likable or believable, and the story doesn't make any sense.<br /><br />Why was this even made? 2/10.", "label": "negative"}, {"sentence1": "Dietrich Bonhoeffer's writings have had a profound influence on my life as a Christian, and I eagerly anticipated watching this movie and finding out more about his life. Words can hardly express my disappointment. This movie was disjointed...it gave no background about his life, no historical context, and nothing about his great writings (except a brief, passing reference to \"The Cost of Discipleship\" by a colleague at the beginning of the movie.) Instead, we see him enjoying jazz (apparently in the States) and chilling out with his friends before he decides to go back to Germany. Apparently to show his human side. OK, I'm ready for the dramatic part. The part where he stands up for his faith. Instead of emphasizing that, we get a very badly acted romance with a 17-year-old schoolgirl. Whether or not that actually took place, it should not have been a major portion of the movie. Now...still waiting for the dramatic part, or some narration explaining what his writings were all about...or SOMETHING to make us know a little bit of the greatness of this man. drum-roll.....waiting..... ....waiting.....ZIP. Nada. This is the kind of movie that gives \"Christian Films\" a bad name. All they had to do was set up a structure for the movie to follow, with some background...even some voice-overs, or flashbacks to him preaching from his works...some narrative about who he was and where he had been. But no...this is what we got. Hardly fitting for a hero of the Faith.", "label": "negative"}, {"sentence1": "This has to be one of the most sincere and touching boy-meets-girl movies ever made. While \"Rebel Without a Cause\" and \"Say Anything\" deliver nice portrayals, this movies strips down useless subplots and Hollywood divergences. This movie focuses purely on watching the budding of a beautiful romance. You never doubt for a second that the film will lead towards the romantic pairing of these two people. You almost immediately sense the synergy and the chemistry between Jesse and Celine, and it is simply pure joy to watch them find it. This movie is mostly all dialogue -based. But, every conversation between these too is greatly intriguing. What makes this pairing so romantic is how real it is. How in all that conversation, while often having no real bearing on anything critical, you can sense the nuances as these two become more fond and trusting of each other. This is exactly they way you would dream that you meet that special someone. And what makes it so true is that it is not even too fantastic to believe. This could be what would happen if you had been confident enough to strike up a conversation with that person you noticed somewhere random. And what puts the icing on this film is the magnificent backdrop of Vienna in which this film takes place. It just adds to the feeling of romantic nirvana that the film suggests. And no matter how many times I watch this film, I don't think I will ever tire of that.", "label": "positive"}, {"sentence1": "OK, first of all, ignore the last person' review. They admit to falling asleep through it so it's no wonder they didn't understand what was going on!!! As thriller/horrors go, this film ain't too bad, it is certainly very watchable. Right from the opening scenes you get a general idea exactly what is going to be the cause of all the craziness that follows, and come the end you are proved right with everything being made clear.<br /><br />I enjoyed this movie, it was quite eerie at times and as old films go it was passable. Great to watch late at night! I give it a generous 7 out of 10.", "label": "positive"}, {"sentence1": "This show is quick-witted, colorful, dark yet fun, hip and still somehow clean. The cast, including an awesome rotation of special guests (i.e. Molly Shannon, Paul Rubens, The-Stapler-Guy-From-Office-Space) is electric. It's got murder, romance, family, AND zombies without ever coming off as cartoony... Somehow. You really connect with these characters. The whole production is an unlikely magic act that left me, something of a skeptic if I do say so myself, totally engrossed and coming back for more every Wednesday night. I just re-read this and it sounds a little like somebody paid me to write it. It really is that good. I just heard a rumor that it was being canceled so I thought I'd send off a flare of good will. This is one of those shows that goes under the radar because the network suits can't figure out how to make it sexy and sell cars with it. Do yourself a huge favor, if you haven't already, and enjoy this gem while it lasts. OK so one more thing. This show is clever. What that means is that every armchair critic/\"writer\" in Hollywood is gonna insert a stick up their youknowwhat before they sit down to watch it, defending themselves with an \"I could've written that\" type speech to absolutely nobody in their lonely renovated Hollywood hotel room. In other words: the internet. This is a general interest/anonymous website. Before you give your Wednesday TV hour to Dirty Sexy Money or Next Hot Model reruns or whatever other out and out tripe these internet \"critics\" aren't commenting on, give my fave' show a spin. It's fun. Good, unpretentious fun.", "label": "positive"}, {"sentence1": "A sequel to Angels With Dirty Faces in name only, The Angels Wash Their Faces suffers somewhat from the usual shenanigans of the Dead End Kids. As a matter of fact, with the presence of the Dead End Kids and Ann Sheridan this should have been treated as an actual sequel to Angels With Dirty Faces, at least for continuity's sake.<br /><br />Speaking of Ann Sheridan, she is the one true shining light of this movie. To paraphrase a cliché, Ann Sheridan could read from a phone book for two hours and I would buy the DVD!<br /><br />Another virtue of this movie is the chemistry between Ann Sheridan and Ronald Reagan. Unfortunately , this aspect of the film is kept too far in the background. For a better example of the Sheridan-Reagan duo I would recommend Juke Girl or Kings Row.", "label": "positive"}, {"sentence1": "This movie has it all. Sight gags, subtle jokes, play on words and verses. It is about a rag tag group of boys from different ethnic and social classes that come together to defeat a common enemy. If you watch this more than once, you will find you are quoting it like Animal House (and yes I love Animal House also). I put in the top 15 funniest movies. The Major at a boys military academy is paranoid that every kid is bad and wants to cause trouble (in this movie he is right). He is sadistic, uncaring, cruel and has to be taken down. The group of boys that do not get along at first, end up teaming together to survive and get rid of the Major with a wacky plan only Mad Magazine could of wrote. A must see - you will love it!", "label": "positive"}, {"sentence1": "Story of a good-for-nothing poet and a sidekick singer who puts his words to music. Director Danny Boyle has lost none of his predilection for raking in the gutter of humanity for characters but he has lost, in this film, the edge for creating inspiring and funny films. Strumpet is painful to watch and barely justified by the fact that it was made for TV.", "label": "negative"}, {"sentence1": "The only reason I give this movie 8/10 stars, and not 10, is because 1) Sinatra is awful and 2) the love interest of Kelly's character leaves much to be desired, (IMHO). Do love that Dean Stockwell, Quantum Leap - Al, is the little boy. The dance sequence with Jerry Mouse is one of the most entertaining and amazing dance sequences I have ever seen. Tom and Jerry is still a personal favorite of mine and my daughter's. I'm 28 and she's 4, so while the character is less iconic than Mickey, he is still a favorite of many children and adults today. Kelly is as always captivating, his eyes full of fun and excitement. In every movie I have ever seen him in, he always steals the show. One of the best dancers of the 20th century. It is no wonder Paula Abdul \"sampled\" Kelly's moves. I would also list Gene Kelly as one of the most beautiful people of the 20th century. If you were to watch only one part, don't miss Kelly's dance with Jerry Mouse. You will NOT be disappointed.", "label": "positive"}]