[{"sentence1": "Based on the personal experiences of director John Singleton's time at the University of Southern California,comes Higher Learning. A film centered on the racial politics that occur at modern day colleges.<br /><br />There are three main characters to which the film bases its foundation around for its story: Malik Williams, an carefree lowbrow athlete who is an African American male. Kristin Conner, a sheltered soft white girl, and Remy, a unsophisticated unconnected white male. All three are overcome by the sudden realities that college life is not as good as it is advertised as all three go through disappointment by being unprepared (Malik), by being naive (Kristin), and by being unwanted (Remy).<br /><br />One good thing about the film is that it does show that modern American colleges are just high schools writ large. The colleges are not places to build character , develop potential, or enhance personal advancement, but they are institutions used to gather all sorts of students in a one-size-fits-all atmosphere. It is an experience that usually is built for failure for most students. It would have been good if the film built it story about this travesty rather than racial politics.<br /><br />But it didn't and that's where the films falls apart. Singleton ,it seems, had a pretty bad experience at Southern California. Through this film he lets it all hang out. There is no need to beat around the bush here. Singleton lets the heroes and the villains of this piece be easily seen.<br /><br />The black characters in the film are pretty much seen as the heroes here while all the whites in the film are seen as the villains, save for Kristin, who was raped by a fellow white student.<br /><br />Who can understand the inconsistencies of this film? Black gang members who come to the aid of a white girl after she points out to them who supposedly raped her? The ease that the black gang members have at the university while a bunch of skin heads meet in a dark small dorm planning violence? <br /><br />The performances of Omar Epps (Malik) and Kristy Swanson (Kristin) are disappointing. They do seem like the third choices for the roles that they played in this movie (Tupac Shakur and Drew Barrymore were supposed to play Malik and Kristin but were unavailable). O'Shea Jackson aka Ice Cube ,Busta Rhymes, and Regina King were all irritating in their respective roles. And Laurence Fishburne was woefully miscast here as the history professor. Only Michael Rappaport did well in this film and he did considering that his character ,of the three main characters, changed the most in the film.<br /><br />John Singleton wanted to take on the matter of race and inequality in American college life with this film. And he did so quite badly. It was sort like killing a fly with a shotgun. Life is far more complex than it seems and people are alike all over and he should know this. Higher Learning is proof that he did not understand this at all. Seeing the film ,then and now, would only confuse, disappoint and enrage the same public he would wish to speak to. Not to mention it would not entertain them in the slightest.", "label": "negative"}, {"sentence1": "It is finally coming out. The first season will be available March 2007. It is currently airing on ABC Family from 4-5 pm eastern time Monday through Friday. The last episode will air on December 19th at 4:30. I missed it the first 100 times around. I wish I could buy the whole series right now. Who does she pick? I have to write 10 lines in order to reply to the first comment. What am I going to say. La da da de de. La da da de de nope only up to 8 how do I get to 9 almost almost awww 9 now I need 10 - 1, 2, 3, 4, 5, 6, 7, I missed counted this is only number 8. Punky Brewster is pretty awesome too. Almost to 10 almost awwwwww.", "label": "positive"}, {"sentence1": "The original show was so much better. They should have left on a good note. This movie killed the whole idea. It was boring, over-dramatic, and the funny parts were too far in between to make up the slack. This movie really seemed like it was trying way too hard to be serious, and that was definitely not what I was wanting from this sequel. Not to mention, that for a long time it was just depressing about the same thing over and over again. So, sorry, Tyler Perry, but try harder next time. This movie is just kinda dull, and not that funny either. Sorry. 4/10 stars is it.<br /><br />Jay Addison", "label": "negative"}, {"sentence1": "There are some things I will never understand; why underwear comes in packs of threes when clearly thats not enough is an example. Similarly, I will never understand this film, and that is brilliant. If you approach this film expecting an actual movie, you might as well be approaching Satan expecting a hug; although that may well be possible if you greet this film's Satanic figures. Take Pitch for instance; the most ineffectual, camp, unhellish portrayal of a devil since Freddy Mercury and Wayne Sleep joined forces to create a ten foot Satan costume from red body paint and horns covered with condoms. However, it does create some of the most hilarious moments of any film ever. Seriously, this is no understatement. The same can be applied to every other character, bar the little girl who acts so sickly innocent she's probably overcompensating for some serious crime she's part of. Then again, if Santa's inter-space recon station is real, there is no chance she could have avoided him this long. Put simply, if you haven't seen this movie, you cannot consider yourself a serious buff. The achingly funny characterisation, acting, concept, and almost-under-the-radar racism makes this a must see above any film to date (if you're after pure laughter that is).", "label": "positive"}, {"sentence1": "If you have seen very less films, this might be a big one for you. If you have seen lot of films, this is a joke. The acting of real heroes is portrayed very badly. Not to mention, there are songs, there are lot of flashbacks, and most importantly, the fighting scenes are stupidily performed. New characters, good direction, would have done a better job, but since it contains all the bollywood heros/heroines, you can predict whats going to happen next. You do not feel sad when something happens, the emotions they protray is terrible, mainly because we have seen this actor in 1000 other hindi movies. It suppose to be a realistic movie, but it fails to show. There are times you wondering, you have thousands of army vehical filled with soldiers moving and the pakistanis are bombing at them and none of their bomb hits them. Are the pakis really bad at aiming or the director made them look stupid? There were only a few characters acting that was very good, but as far it is concerned with plot, action, it is poorly directed. This movie could have been short if they took out songs, flashbacks, stick to the point.", "label": "negative"}, {"sentence1": "I had two reasons for watching this swashbuckler when it aired on Danish television yesterday. First of all, I wanted to see Gina Lollobrigida - and here I wasn't disappointed. She looked gorgeous. Second of all, through reading about the film I had gotten the impression that it featured absurd humor not unlike that which can be found in Philippe de Broca's films. On this account, however, I was sadly disappointed. I found the jokes predictable (apart from a few witty remarks on the topic of war) and the characters completely one-dimensional. Also, the action scenes were done in a strangely mechanical and uninspired fashion, with no sense of drama at all. I kept watching until the end, but I got bored very quickly and just sat there, waiting for the scenes with Lollobrigida.", "label": "negative"}, {"sentence1": "Oh god, what a horrible, horrible film. Meant to be a comment on the state of society, it's just a reflection of the worst of the worst in reality TV. Interstitials hosted by Jason Jones and Don McKellar are the most obnoxious part, written in a tone that is perhaps meant to be reflexive and insightful. Rather, these moments are mind numbing as they speak to the camera with dialogue written by someone with a love for insulting, condescending speech that shoves the \"meaning\" of the film down the viewer's throat.<br /><br />Also, a point to would-be filmmakers: Long takes and quiet scenes do not equal art. Neither do extreme angles or logic stretched to the point of absurdity.<br /><br />If anyone out there is interested in watching this film, please don't. Seriously. Please. You have better things to do.", "label": "negative"}, {"sentence1": "Glacier Fox is one of the most heartrending and wonderfully photographed wildlife films ever made.<br /><br />The film makes you care about each member of this fox family, from the blind cub to the strongest - their adventures are at times hilarious and also tragic. Set against an inhospitable countryside, the audience's hearts warm to the family members.<br /><br />The music score and lyrics tell the story intercut with narration about what is happening in general terms.<br /><br />Man remains one of the biggest predators, but we are left in no doubt that the foxes are capable of living, not just surviving beyond human endeavours.", "label": "positive"}, {"sentence1": "This movie (and yes, it's a movie - it was shot as a two-parter, but the two parts together come down to slightly more than 2 hours) is one of the unsung masterpieces of world cinema. A very well-mannered, and yet at the same time absolutely savage denunciation of the Soviet regime and the type of person who flourished under it, the film is a faithful adaptation of the long-banned eponymous book by Mikhail Bulgakov. The sets are flawless, and the director made the brilliant decision to film in monochrome sepia, adding a feel of authenticity where a late-80s washed-out color incarnation would have all but ruined the film. I won't say much about the plot, which deserves to be discovered by the viewer himself, but the performances are true Oscar material; special mentions go out to E. Evstigneev, who plays the old professor with such presence, gravitas and kind wisdom that with barely a word or a gesture, he ends up stealing every scene he's in. The second, of course, is Creature/Sharikov, who, played to horrifying perfection by V. Tolokonnikov, is by far more frightening a character than Hannibal Lecter, because not only does he exist in real life - entire countries have been ran by men like him throughout history, with all that ensues.<br /><br />While it's a socio political allegory, it is worth mentioning that the movie is also brimming with humor, albeit dark - there are many outright comedies which haven't made me laugh as much as this film. What's more, when laughing at this movie, the feeling is not only one of hilarity but of understanding and agreement, which is always a plus.<br /><br />There is hardly a complaint I have with this movie - the only slight flaw is the tone of intellectual/bourgeois snobbery I caught at times from the \"enlightened\" characters. But that's a minor quibble.<br /><br />Sadly, this film appears to have been bypassed by Western licensing companies. It's a crying shame that one of the all-round best movies out there is languishing unrestored and untranslated (which shouldn't be incredibly hard - though all the cultural references and the revolutionary terminology will necessarily fade in translation, the film's main themes should be accessible to all). While we're waiting with our fingers crossed for the Criterion edition, I'm considering creating English subtitles myself. Will see how that works out.", "label": "positive"}, {"sentence1": "I first saw this when it was picked as a suggestion from my TiVo system. I like Danny Elfman and thought it might be interesting. On top of that, I'm a fan of Max Fleischer's work, and this started out with the look and feel of his 30s cartoon. With both of those, I thought it would hold my interest. I was wrong. Just a few minutes in, and I had the fast forward button down. I ran through it in about 15 minutes, and thought that was it.<br /><br />Afterwards, I read some of the other reviews here and figured I didn't give it enough of a chance. I recorded it again and watched it through. There's 75 minutes of my life I'm not getting back.<br /><br />I can't believe there aren't more bad reviews. Personally, I think it's because it's hard to get to the 10 line comment minimum. How many ways are there to say this is a waste of time?<br /><br />The movie comes across as though it was made by a few junior high kids ready to outrage the world and thinking they can with breasts, profanity, and puke jokes. The characters are flat. The parody of \"Swinging the Alphabet\" is lame, essentially cobbling the tune, getting through A - E, hitting the obvious profanity a \"F\", and then having no idea where to go. The trip through the intestines to the expected landing doesn't work the first time, let alone the following ones. <br /><br />Across the board, the entire movie is what you would expect from someone trying to \"out-South Park\" Stone and Parker without the ability to determine what is and isn't funny. This might be amusing if you're high. Otherwise, it's not.", "label": "negative"}, {"sentence1": "This is probably the fastest-paced and most action-packed of the German Edgar Wallace \"krimi\" series, a cross between the Dr. Mabuse films of yore and 60's pop thrillers like Batman and the Man from UNCLE. It reintroduces the outrageous villain from an earlier film who dons a stylish monk's habit and breaks the necks of victims with the curl of a deadly whip. Set at a posh girls' school filled with lecherous middle-aged professors, and with the cops fondling their hot-to-trot secretaries at every opportunity, it certainly is a throwback to those wonderfully politically-incorrect times. There's a definite link to a later Wallace-based film, the excellent giallo \"Whatever Happened to Solange?\", which also concerns female students being corrupted by (and corrupting?) their elders. Quite appropriate to the monk theme, the master-mind villain uses booby-trapped bibles here to deal some of the death blows, and also maintains a reptile-replete dungeon to amuse his captive audiences. <br /><br />Alfred Vohrer was always the most playful and visually flamboyant of the series directors, and here the lurid colour cinematography is the real star of the show. The Monk appears in a raving scarlet cowl and robe, tastefully setting off the lustrous white whip, while appearing against purplish-night backgrounds. There's also a voyeur-friendly turquoise swimming pool which looks great both as a glowing milieu for the nubile students and as a shadowy backdrop for one of the murder scenes. The trademark \"kicker\" of hiding the \"Ende\" card somewhere in the set of the last scene is also quite memorable here. And there's a fine brassy and twangy score for retro-music fans.<br /><br />Fans of the series will definitely miss the flippant Eddie Arent character in these later films. Instead, the chief inspector Sir John takes on the role of buffoon, convinced that he has mastered criminal psychology after taking a few night courses. Unfortunately, Klaus Kinski had also gone on to bigger and better things. The krimis had lost some of their offbeat subversive charm by this point, and now worked on a much more blatant pop-culture level, which will make this one quite accessible to uninitiated viewers.", "label": "positive"}, {"sentence1": "This movie is rated a classic on sentiment not on any quality of movie-making. It moves from the unlikely to the unbelievable, from the unrealistic to the ludicrous.<br /><br />The unbelievable plot revolves around an attempt by two British soldiers and a Hindu gofer to rescue a third soldier who has been captured by insurgent Indians. In the later scene we see a full regiment with drum and bagpipes marching into an ambush. In the British army, a sergeant does not order up a rescue attempt, and if you get past that, he does not attempt it with only one other soldier and an Indian servant when there is a full regiment on hand. The Indian insurgents are so incredibly inept it is laughable...there are hundreds of them but they can't hold their prisoner or kill the two rescuers, of course not. At one point we see the British soldiers throwing blocks of stone down from the battlements at the insurgents, who are scattered around the mountainside in ambush...one would have to have an eggplant for a brain to think this would do any damage. After Cary Grant as the rescued prisoner is shot, he lies on the floor looking around at the water boy...hardly the actions of someone who has been shot in the back. The water boy bravely blows a bugle (which comes from nowhere) to sound the alarm...this he does by standing up high on a wall so he can be seen and shot by the bad guys, and we shed a tear as he keeps trying to sound more notes as he is repeatedly shot and the bugle call breaks up into feeble squawks...instead of blowing the bugle while hiding behind cover as anybody with half a brain would do. This scene has deservedly been parodied in comedy sketches. If they wanted to make a Buster Keaton comedy, they should have hired Keaton and done it better.", "label": "negative"}, {"sentence1": "We toss around the term \"superstar\" way too lightly these days, but here's one guy that truly deserves it.<br /><br />I was glued to the set this entire show. The song selection was perfect -- it only contained the songs I actually wanted to hear and cut in with documentary footage during the weaker new songs. I loved that the band was just a five guys on stage in a very minimalist environment. (With songs of this strength, you don't need a circus to be entertained).<br /><br />The shots of the crowd were amazing, too. How many performers can affect the original Beatles fans (now in their 50's and beyond), get young kids to jump up at the opening lines of \"Can't Buy Me Love\" and impact everyone in between? <br /><br />While watching, I also realized that in the wake of John Lennon's tragic death, Paul McCartney instantly became an afterthought. Paul not only lost John and George (no matter what their final relations were, it must be hard to lose someone with whom you changed the world), but he also lost his wife Linda and never really seemed to garner the acknowledgment Lennon's murder received. I agree that Lennon's murder was horrible, but only now did I realize that Paul was sort of forgotten in the aftermath. I was very happy that he's found love again in Heather.<br /><br />As for those complaining about the audio/video quality, I had no complaints whatsoever; both were crystal clear on my set. I think these same people will complain about the quality of DVD when the next format comes out; they'll never be satisfied.<br /><br />My only regret was not buying a ticket to this show when I had the chance. Thanks to this video I was able to enjoy it.<br /><br />When people remember John Lennon, they will first remember his murder and then his music. I now have a new appreciation for Paul McCartney, because, if nothing else, he will be remembered for his music first. And let's hope another lunatic won't change this, because the McCartney catalog is pretty good.", "label": "positive"}, {"sentence1": "All in all a good film and better for the fact that had the film not been made the story might remain hidden to the masses. Brosnan does a good job as the native American with a hidden past and the photography is stunning. To some, this may be too whimsical, to others boring - for me it is a gentle, well-told tale and perfect for family viewing. Now that's not something you get a lot of recently.", "label": "positive"}, {"sentence1": "This movie is funny and painful at the same time. The \"Cinemagic\" almost gave me a seizure. Despite what they imply, \"Cinemagic\" is not some innovative technical procedure. It was \"developed\" as the result of an accident, and they used it because it disguised the fact that their \"monsters\" were so stupid-looking. I also don't think it's a coincidence that the writer is Sid \"Pink\".<br /><br />This movie is good for a laugh, if you are really looking for a movie made in 9 days on 200,000 dollars. It is entertaining; at least I can say that about it. The bat/rat/spider is the highlight.", "label": "negative"}, {"sentence1": "OK, this movie is stupid. I mean that in a good way though.It was stupid on purpose, and was one of the better \"stupid\" movies I've seen. The jokes and gags are purposefully bad, but delivered in a way that it struck all the right notes with me. The supporting characters were pretty shallow and mediocre. There is a pretty weak plot, but it works just fine.<br /><br />Elvira's character is the focus here.She is lovable and adorable.Cassandra Petersen has a world of acting talent that just glows in this movie.On top of that acting talent she had physical attributes which were frankly, stunning. Few men could disagree with that. The parts that show off her figure were also some of the funnier scenes in the movie.<br /><br />I had a smile ear to ear from the first scene to the last.<br /><br />Highly recommended to fans of comedy, and to fans of beautiful women. I wish they had made a dozen more Elvia movies.", "label": "positive"}, {"sentence1": "I love this film and it is such a wonderful example of a family jeopardy, a romantic love story, and a very sad story plot. Everything was just so perfect and excellent about this film. It was such a great mixture of actors and actresses and with some laughs and a lot of cries this film deserves to get plenty of awards. With the mention of beautiful scenario, and although I would relate this film to The Notebook and The Family Stone, it was sort of much more cunning, sad, and brilliant than those films. The Evening tells of a love story between an old woman dreaming back to her younger years, and her two daughters stay by her side while she is not well. The story dating back is so strongly told and wonderful I was sitting on the edge of my seat. You really get to know all the characters and by the end, I was wanting to watch it all over again. This is a amazingly sad and vividly acted and plotted movie that is really one of a kind and should be seen by all for how wonderful it really is. All the performances are astonishing and the film captures your attention from the very beginning and never lets go. I loved it, and am so glad that I watched it for it was truly an astonishing film...", "label": "positive"}, {"sentence1": "Gloria Victor and Dolores Reed in space girl costumes.<br /><br />I love 50 sci fi, I even love cheesy 50s sci fi, but this film is really, really bad. And not in a MST3K kinda way.<br /><br />Virtually unwatchable as a couple of bozos do their best \"hip cat\" impression of Abott & Costello.<br /><br />Chessecake can usually save cheesy sci fi, such as in \"Cat Women On The Moon\" but it can't in this case. This film requires a mute button and fast forward feature.<br /><br />That said, I could watch Gloria and Dolores walk around the space ship for about an hour or so.", "label": "negative"}, {"sentence1": "This movie is bufoonery! and I loved it! The \"dragon lord\" (Jacky Chan) and his buddy, \"cowboy\", totally made the movie fun, meaningful, and just plain silly. The movie is a rare blend of a good vs. evil fight and (somehow) the wonders and fun that is growing up. Long Shao Ye takes the viewer through the daily activities of the young \"dragon lord\" (so named because he is the son of a wealthy family) and \"cowboy\", which include implementing clever, elaborate ways to escape studying (with the help of the entire household, including the tutor), competing in rather boyish (and idiotically interesting) ways to gain the affection of a local girl, competing in \"soccer\" (you will see what i mean) and the list goes on. Somehow they find themselves in the midst of a fight to save the a shipment of valuable antiques and the lives of several people.<br /><br />The movie has its serious moments. But they do not depress, but rather inspire. The playfulness of the boys are not lost in this exchange, but is actually employed against evil. What I really loved about this movie is how it ends. Not the typical confrontation (which in itself was awesome), but well, you'll see. Let me just say it truly captures the spirit of the movie.<br /><br />silly, witty, meaningful, and nostalgic. great movie.", "label": "positive"}, {"sentence1": "I saw the trailer for this film a few months prior to its release, and MAN, did it look scary, Especially how this film was based on a real life phenomenon. I was incredibly interested, and thought that this could finally be a decent horror/thriller film after years if crap. Well you know how movie trailers make a film look better than it is: maybe by showing all of the creepy parts or by overdramaticizing certain elements. The advertisements for the movie did both, which lead to my ultimate disappointment.<br /><br />By no means is this \"the most disturbing movie in years\". Hell, I doubt it was the most disturbing movie of that week's release. This movie takes the whole \"based off of fact\" thing too far.<br /><br />This movie wasn't complete crap. I must admit, it held my interest and Micheal Keaton was believable as a man searching for answers by supernatural means. Other than that, though, this film is one big cliché. After John's wife dies, he learns about EVP, which transmits the voices of the dead into everyday electronic appliances. He all of the sudden receives messages from his wife! My God! It's not just his wife reaching him, it's other dead people. Gee, imagine that. A movie about helping dead people. Come on, give me a break! The clichés don't stop there. There's also the obligatory clock-stopping-at-the-same-exact-time-every-night trick and three evil spirits that menace our hero. Not only was the movie cliché, it WASN'T SCARY. The film literally had two jump scenes, and those two scenes are almost identical. The ending is horrible, as it leaves the door WIDE OPEN for a sequel. There's also an ending message with a message saying how only 1 out of X voices heard through EVP are threatening, with a nice happy tune playing. Way to break the mood, you guys. Jeez! In the end, if you want another forgettable horror film, see White Noise. The only reasons I could possibly think anyone would watch this film for is that either that the person is a Keaton fan or that they are interested in EVP. Sure, the EVP aspects may be slightly interesting, but I don't like my movie concepts to be shoved down my throat and blown up in my face. This film tries to be scary, original, and disturbing, but it's just the opposite. You know you have a lame movie when the commercials use the ghosts to talk about there film. \"I WILL SEE THIS FILM NO MORE.\"", "label": "negative"}, {"sentence1": "Six for the price of one! So it is a bonanza time for Cinegoers. Isn't it? Here it is not one, not two but all SIX-love stories, an ensemble cast of top stars of bollywood, plus all stories in the genre of your favorite top directors Johar, Bhansali, Chopra et al. You will get to see every damn type of love story that you enjoyed or rather tolerated for years now. So no big deal for you. Do you need anything more than this? No sir, thank you. Why sir? Enough is enough. Please spare us. They signed every top star that they manage to sign, whether required or not, so they end up making a circus of stars, believe it or not. Too crowded Every thing depicted here is exactly how it is prescribed in bollywood textbook of romances. Plus you have to justify the length given to each story, as each has stars. Therefore, it is too long-three hours plus. The gags are filmy. Characters are filmy. Problems, Barriers, situations, resolution \u0085 yes you guessed it right, again\u0085. filmy-tried and tested. Same hundreds of dancers dancing in colorful costumes in background. Why they have no other work to do? All couples are sugary-sweet, fairy tale type, Picture perfect. All are good looking. Each story beginning in a perfect way and therefore should ends also in that impossible perfect manner? Too haphazard. You can't connect to a single story. Here you have everything that you already seen a million times. Bloody fake, unreal, escapist abnormal stories considered normal for more than hundred years since evolution of this Indian cinema. What a mockery of sensibilities of today's audience? Yes it could have worked as a parody if he just paid tribute to love-stories of yesteryear but alas even that thing is not explored. At least, Director Nikhil Advani should have attempted one unconventional, offbeat love story but then what will happen to the tradition of living up to the mark of commercial bollwood potboiler brigade? Oh! Somebody has to carry on, no. Imagine on one hand audience finds it difficult to sit through one such love story and here we have six times the pain. I mean six damn stories. I mean double the fun of chopra's Mohabbatein (Year 2000) In this age and time, get something real, guys. We are now desperate to see some not so colorful people and not so bright stories Oh, What have you said just now- come on, that is entertainment. My advice, please don't waste your time henceforth reading such reviews. Go instead, have some more such entertainment! Thank you.", "label": "negative"}, {"sentence1": "What can I add that the previous comments haven't already said. This is a great film and the Light Sabre duel Star Wars tribute has to be seen to be believed!! There are moments of genius throughout this movie, if you can, SEE IT NOW! Thanks again to Rick Baker who gave me this movie many years ago!", "label": "positive"}, {"sentence1": "Full marks for the content of this film, as a Brit I was not aware that there was segregation in the US Navy during WWII. A very brave attempt to bring this fact to the world. However, the movie is pathetic, direction is non existent, the acting is wooden and the script is just one cliché after another. I can honestly say that this is one of the worst movies I have ever seen. I sat and cringed from the start until the end at the very poor way that this had been put together. This could have been a great movie, the story for many of us outside of the US was new, unique and also interesting. The sad fact of the matter is the way that it was put together. It is unfortunate that a true story like this, which could have changed people's attitudes, has been squandered on a low budget, badly directed movie. I only hope that some time in the future, one of the major studios will take this theme and do it justice.", "label": "negative"}, {"sentence1": "To put it simply, I enjoyed this film. The reason for my interest & enjoyment was not related to anything other than the subject matter itself. I had heard tales from my mother and grandmother about how Northern England working class life and attitudes used to be (as experienced by them)and this is an interesting depiction that seems to faithfully represent what they told me. In particular, the paternalistic but overbearing father who \"knows\" what is best for his family along with his stubborness when this paradigm is challenged. (Not much has changed there then!!)<br /><br />People who have seen the play will probably be disappointed with the film because the story does not easily transfer across the different media. In a sense however, the film is an historical document and I personally enjoyed it, if only because of the way it conveyed a social phenomenon.", "label": "positive"}, {"sentence1": "I think this show is definitely the greatest show. Jessica Alba does such a great job in it. Michael Weatherly also does an awesome job, as well as the rest of the cast. The show is very intriguing and they have wonderful storylines and their stunts are amazing. It's like watching a 1-hour movie. It's definitely worth watching.", "label": "positive"}, {"sentence1": "Wow, this movie was absolutely brilliant. I really don't know why everyone says it has a slow pace. I thought the pace was perfect. The movie is about Michael Sullivan played by Tom Hanks with perfection who is a sort of hit-man/ killer working for John Rooney (Paul Newman). He disslikes this job but does it because Rooney payed for his house and helps him financially. He had nothing and Mr. Rooney gave him everything. But, his children are unaware that this is his job, and when one witnesses a cold blooded murder by him, he is placed in an awkward position. And when an atrocity occurs, he leaves with his son and is bent on revenge. They rob abanks and much more and build a bond. They're the perfect team. Hanks does a great job as always as well as Jude Law who plays his creepy role to perfection. This drama is highly recommended as it shows a beautiful story and greatly shows how the 1930s were.", "label": "positive"}, {"sentence1": "I am currently doing film studies at A.S level and \"this is not a love song\" is a film we watched and in my opinion it is a film with a very simple storyline but a complex back-story. If you scratch the surface you will find a thriller-chase film of two men running through the countryside from farmers, after committing a murder:-\"sounds quite exiting\".<br /><br />However you need to dig deeper to uncover the true feeling of the true genre. As it is suggested, it is a love story between two homosexual lovers, filled with trust, deceit and betrayal. We are not told about this \"love\" directly through the film but the events that happen through out, for example the way Heaton acts towards Spike almost screams this untouched love affair in our faces.<br /><br />Overall this film is a good example of why British films should not be dismissed as \"rubbish\" just because they are done on a low budget.<br /><br />A Good film with an intricate story line, however it is definitely an acquired taste and is possibly not suitable for the average fan of Hollywood blockbusters.", "label": "positive"}, {"sentence1": "This is a bit of a first for me, the first time I have ever been disappointed in a Tim Burton film. POTA isn't a bad film (great sets, costumes and the odd great performance) but it could have been made by any off-the-shelf hollywood director. The pacing was very odd, the last third was just spent waiting for the film to end, by myself and the cast. Tim Roth was excellent, probably the only pleasure in the film. Come back Tim.", "label": "negative"}, {"sentence1": "I was so eager to see this one of my favorite TV shows.I saw Universal trademark followed with a newly acquainted title and theme song which still impress me.Computer animation on some scenery like a solid title name\"The Jetsons\" or a dimension view of a spaceship approaching an amusement park and more made this version splendid and fantastic.Shortly after that till the end...I couldn't believe my eyes!!!!How lucky I was that I could forget all I had seen.Just songs by Tiffany and its theme song in new arrangement were in my head.Anyway,I wish to see this space-aged family (also The Flintstones and Yogi Bear) in all graphic computer design as Toy story or Bug's life.The best style for Hanna-Barbera's in my opinion.", "label": "negative"}, {"sentence1": "All of those who voted less than 5 are obviously not fans of clean, tongue-in-cheek humor. Keaton is brilliant in this - as in most of his work. This is not a blockbuster, bigger-than-life affair. This is campy, slapstick humor played out by some of Hollywood's best (and very versatile) actors. Piscopo was equally on the mark as the top dog wannabee, once.<br /><br />If you want to see the funniest attempt at not really cussing ever filmed, you gotta see Dimitri do his piece as Morone.<br /><br />I gave it a 7.", "label": "positive"}, {"sentence1": "Having seen men Behind the Sun I guess I hoped for an evolution in style & technique to match the larger scale of this movie. I was also quite interested to see someone make a hard-hitting fact-based fictionalised account of what happened during this most notorious of Japanese atrocities, but this is not it. This plays like a bottom-to-mid tier European Nazi exploitation movie from the 70s - e.g. SS Experiment Camp etc (perhaps more like Deported Women of the Special Section actually). Granted it has a greater scope and more people running around, but it resorts to the same cheap and cheerless device of lots of hapless non-actors limply falling over to the sound of ridiculously fake gunshots, spiced up with the occasional poorly executed 'shock' sequence. The admittedly horrible documentary footage is roughly spliced in between scenes so hackneyed that even these real images are robbed of much of their power. Watch channel 4's 'The Holocaust' (aired recently (still running?), as of 1 No 2006) for a genuinely disturbing documentary on the evils of war (featuring excellent in-context use of actual footage). This is the type of treatment the horror of Nanjing deserves, not this hackneyed exploitation garbage (a better executed exploitation movie minus the disrespectful use of stock footage would have been fine, but again this is not even a very good exploitation movie). Rating: 3 (5 as exploitation, 1 as a treatment of the subject).", "label": "negative"}, {"sentence1": "Salvage: 4 out of 10. Groundhog Day meets a Christian Coalition horror film. Okay maybe it's not that bad. But it is close.<br /><br />Claire (played by Alicia Silverstonesque Lauren Currie Lewis) is stalked and possibly killed by a serial killer (Chris Ferry who is quite menacing and brutal). I say possibly because she wakes up and it was all a dream\u0085.. Or was it? (Cue music)<br /><br />The basic problem with the film is that these fifteen minutes of plot (Done quite well the first time) is repeated over and over again. And since Claire wakes up every time and every scene is clearly a dream or alternate reality I just stopped caring what happened to Claire and started wondering what lame twist at the end was going to pull this together.<br /><br />I was rooting for a séance (which honestly would have made more sense) but instead got one of those too obvious by half surprise endings (Think the Village or Below) Yup the film collapses faster than Donnie Darko's directors cut. All the great twist endings in horror movies The Sixth Sense, the original Invasion of the Body Snatchers, Happy Birthday to Me worked because the audience wasn't expecting a left field explanation. (Heck even the canoe ending in the original Friday the 13th was worth a jolt)<br /><br />Salvage on the other hand screams twist ending with every scene change. Other nagging faults is the one note piano soundtrack (Though the featured songs were decent) the obvious time padding (Claire doing the dishes, Claire's mother's subplots), the way Claire says \"hello is anyone there\" every time she thinks there is a serial killer around.<br /><br />Also some of the secondary acting roles (In particular Claire's mother played by Maureen Olander who resembles a Mary Kay zombie) shows the first time actor low budget roots.<br /><br />Both too clever by half and not nearly clever enough Salvage keeps your interest if only to see how they are going to fix this mess. Problem is they really don't.", "label": "negative"}]