[{"sentence1": "Now, I'm one to watch movies that got poor reviews, and say, \"Hmm... this isn't so bad!\" I loved The Cable Guy, and thought that My Big Fat Independent Movie was great. Keep in mind, I really didn't start watching this with high hopes, but I figured that maybe... just maybe... it would be bad in a kind of way I could laugh at it. I was wrong. At no point at all during my suffering through this \"film\" (And I use that term sparingly) was I even close to being mildly entertained. To start, Shaq makes Quentin Tarantino look like Marlon Brando when it comes to acting. I hate rap music, but as far as I could tell, an Amish priest would probably make a better rapper than him. The main character is simply annoying, and not a character that it's easy to like. Quite frankly, I would rather eat a greasy turd out of a Harlequin fetus' bloody sores than watch this again.", "label": "negative"}, {"sentence1": "This is a story of a Jewish dysfunctional family. The parents have divorced and mom remains back east in the house. The father, Murray Abromowitz, moves with his children to California, and moves around Beverly Hills so that his children can get the best education possible.<br /><br />Things really become funny when Marisa Tomei, Murray's niece, comes to lives with the group.<br /><br />The film deals with the various adventures of the family complicated by the drug scene of the affluent neighborhood.<br /><br />Jessica Walter costars as a woman who wants Murray to move in with her since she wants a companion.<br /><br />Carl Reiner and Rita Moreno come in towards the end. They play Murray's brother and sister-in-law respectively; they're also the parents of Tomei. In front of the children, Reiner lets loose reminding Murray that he has been paying the bills for them all along.<br /><br />The film ends on a sour note as the embarrassed family moves out of their fancy digs and take to riding around Beverly Hills in their car. I guess the film is promoting independence and some good old self-esteem.", "label": "negative"}, {"sentence1": "Not sure if this counts as a spoiler or not, so beware:<br /><br />Just a small but crucial thing to watch for, an intriguing possibility: the boys steal a green Citroen at one point, for a joy ride, and return it to the owner having done purposeful and vengeful hidden damage to the car, hoping that the owner will crash. Is it the very same car they steal much later from the picnicking family? We know the original owner sold it. They drive off at the end on a dangerous road, one which I understand has been closed to all but pedestrians for the last ten years. A whole new slant to the end of the film.<br /><br />On another matter, this film could have been called \"Scent of a Woman\". I don't recall another film, certainly not American, that treats the scent of a woman in such a frank and open manner, much like the \"nose\" of a fine Bordeaux.", "label": "positive"}, {"sentence1": "First things first, the female lead is too gorgeous to be missed. Now actress Wang Zu Xian, the one who played Xiao Qian in the movie, is 42 years old and well aged. It's always good to review these glorious times when seeing old-school HongKong productions like this.<br /><br />The movie is one of the most influential titles made in 1980s. The art set decoration and other aesthetic facets are all mesmerizing. More fantastically the movie had a total black humorous undertone in it. It feels like a horror movie but ultimately it's not scaring, but only fun.<br /><br />I had the experience of translating the second script of \"A Chinese Ghotst Story\", and I thought that script was a decent write. However when I saw the movie, I firstly was disappointed in seeing the movie different from the script, like in a smaller scale and involving more comic roles. However, it turned out to be better executed in terms of being entertaining.<br /><br />If you have seen the Lord of the Rings, you will notice the similarities in this movie to LOTR. The climax is like a mirror of Miranda Otto fighting with the Ring Witch. It's definitely a laugh-out-loud. Bravo!", "label": "positive"}, {"sentence1": "If you ever hear these three words uttered to you...\"Joe Don Baker\", be afraid...<br /><br />Final Justice is the low budget action movie based on a sheriff in a Texas town named Geronimo (pronounced as Heronimo). He's an ugly, slimy, rude character who is on the hunt for a criminal in Malta who killed his partner in Texas. His partner actually slumps down twice in the movie. Very bad editing. Joe Don Baker (Geronimo) ends up in jail like 4 or 5 times in this movie, making the plot go nowhere fast. Plus, he shoots everybody like he's in the wild west. I guess nobody told him it was the 20th century. A woman cop is assigned to show him around Malta (who looks like Elaine from Seinfeld) and she is the only one who can put up with the redneck. She must be insane!<br /><br />The strippers in the bar are the most entertaining characters in this movie. Their dancing is shown throughout the film and I began to bond with the sleazy women. Well, at least it was better than watching Geronimo try to dumb his way out of something. The ending is flawed and somewhat predictable, and I was happy it was finally over. You'll never forget that last line of Joe Don Baker from the movie.<br /><br />It's so hard to imagine how he was in THREE Bond movies...very weird! Anyway, if you're up for a laugh, then see this one on MST3K sometime. Also, I've heard his other bad movie (among many), \"Mitchell\" MST3K version is being released on DVD by Rhino. I can't wait to see that!", "label": "negative"}, {"sentence1": "With a cast list like this one, I expected far better. Venessa Redgrave spent the majority of the movie lying in bed. The best actresses in the world cannot make anything very interesting when their acting is limited to lying down and falling asleep throughout the entire movie. The plot summary says that a secret is revealed to the daughters as their mother comes closer to death. The thing is, she never tells her daughters anything except cryptic advice to be happy. All the relationships in the movie are underdeveloped. I also felt that the back and forth between the past and present was unnecessary. It seemed as if the idea was stolen either from the book the Da Vinci Code in which the device was used to increase suspense, or from The Notebook in which they used the device to create the never ending romance of the story's main characters. Either way it was a cheap device in this movie because it didn't work to create anything. It was a way to attempt suspense in a movie that has none. I left wondering why good movies can't be written for women. It really was a disappointment.", "label": "negative"}, {"sentence1": "as a habit i always like to read through the 'hated it' reviews of any given movie. especially one that i'd want to comment on. and it's not so much a point-counterpoint sorta deal; i just like to see what people say on the flipside.<br /><br />however, i do want to address one thing. many people that hated it called it, to paraphrase, 'beautiful, but shallow,' some even going so far as to say that norm's desire yet inability to help his brother was a mundane plot, at best.<br /><br />i'd like to disagree.<br /><br />as a brother of a sibling who has a similar dysfunction, i can relate. daily, you see them abuse themselves, knowing only that their current path will inevitably lead them to self-destruction. and it's not about the specifics of what they did when; how or why paul decided to take up gambling and associating with questionable folks; it's really more how they are wired. on one hand, they are veritable geniuses, and on the other, painfully self-destructive (it's a lot like people like howard hughes \u0097 the same forces which drive them are the same forces which tear them apart) and all the while you see this, you know this, and what's worse, you realize you can't do a damn thing about it.<br /><br />for norman maclean, a river runs through it was probably a way to find an answer to why the tragedy had to occur, and who was to blame. in the end, no one is, and often, there is no why. but it takes a great deal of personal anguish to truly come to this realization. sometimes it takes a lifetime. and sometimes it never comes at all.", "label": "positive"}, {"sentence1": "Pathetic. This is what happens when director comes to work just because someone is paying him to. <br /><br />The intentions were good, great locations and settings for a film of epic proportions. But the performance, damn! I swear, in some shots you can see extras on the background staring in the camera, or looking at the actors because no one told them what they should do when they hear \"Action!\". The battle scenes are so bad you wonder - are these people for real? They could've done more damage just by hugging each other. In the slow-mo scenes you can see people on battle field walking around or just standing, waving their hands. <br /><br />Only action in the foreground is somehow emphasized. But for what? The story is so illogical and discontinuous, it seems like random situations in chronological order, sometimes not even that. The dialogs are dumb, the love plot is more embarrassing and ridiculous than in Hong Kong action movies. <br /><br />With a budget of 40 million, and you can see every dollar invested on the screen, in best case scenario, the final result of all this enormous effort is a shiny round laser disk in the thin cover placed on the shelf in video store.", "label": "negative"}, {"sentence1": "While not as famous as some of their other collaborations (such as THE BLACK CAT and THE BODY SNATCHER), this is a dandy little horror film even though the casting decisions were a bit odd. Boris Karloff plays Dr. Janos Rukh, a weird scientist who lives in the Carpathian mountains--near where the Dracula character's home town. Bela Lugosi plays Dr. Benet--whose nationality was never discussed though the name certainly sounds French. I really think it would have made sense to have the two switch roles, as the Carpathian role seems tailor made for Lugosi--especially with his accent. However, despite this unusual twist, the two still did excellent jobs. Karloff's was definitely the lead role, but Lugosi acquitted himself well as a relatively normal person--something he didn't play very often in films!! It seems that Dr. Rukh is a bit of a pariah, as other scientists (especially Benet) think his theories are bizarre and nonsensical. However, over the course of the film, Rukh turns out to be right and Benet is especially generous in his new praise for Rukh. But, unfortunately, the wonderful new element that Rukh discovered has the nasty side effect of turning him into a crazy killing machine (don't you hate it when that happens?). While this could have just been a simple nice scientist turned mad story, the plot was well constructed, the characters nicely developed and the mad Rukh was NOT a one-dimensional killer, but complex and interesting.<br /><br />This film is bound to be enjoyed by anyone except for people who hate old horror films. You can really tell that Universal Pictures pulled out all the stops and made a bigger-budget film instead of the cheap quickies both Lugosi and Karloff unfortunately gravitated in later years. Good stuff.", "label": "positive"}, {"sentence1": "Let me start off by saying that after watching this episode for the first time on DVD at 10 o'clock P.M. one night, I could not fall asleep until about 3:00 A.M.<br /><br />This brief review may contain spoilers.<br /><br />I'm a long-time fan of The Sopranos and I can safely say this is the best episode I've seen. I'm not saying everyone should feel this way, but I do. This episode is identical to the weekend I spent with my family, watching over my own father, comatose in the ICU before he passed.<br /><br />The episode begins with Tony in an alternate reality: he is a salesman who's identity has been mistaken for that of a man named Kevin Finnerty.<br /><br />By the time ten minutes had gone by, I knew either Tony was dreaming, or I was watching some other show. It wasn't like the normal Sopranos and I loved it.<br /><br />Option 1 is confirmed when Anthony (or \"Kevin\") looks into the sky at a \"helicopter spotlight\" and we see prodding through it, a doctor with a flashlight. We see this only for a moment and the sequence plays out until we go back to real life in a situation similar to the one I just stated.<br /><br />Tony has come out of the coma for only a moment. His boys take A.J. home and Carmella, overcome by stress, breaks down in the hallway: a signature moment in the episode.<br /><br />For the remainder of the episode, we cut in between the real world: the family dealing with the potential negative outcome of this coma, and Tony's alternate reality, which parallels what's going on both in his mind and in the real world around him.<br /><br />Then comes the stellar point in the episode: after A.J. finishes telling his mother he's flunked school, she walks in to see Meadow sitting at Anthony's side.<br /><br />She approaches Tony, and utters the best line of the episode: \"Anthony, can you hear us?\" In Tony's world, he enters a dark hotel room and turns on a light. He takes off his shoes and goes to the phone. He tries to dial, but he cannot--as if he were trying to say something back to Carmella, but couldn't physically bring himself to do so. Not yet.<br /><br />He sits down and looks out his window. A shimmering light that has reoccurred throughout the episode now seems to call to him from the other side of the city.<br /><br />\"When It's Cold I'd Like To Die\" by Moby marries perfectly with these last images and helps in creating an emotional roller-coaster of an episode.<br /><br />10 out of 10.<br /><br />P.S.: Watch the next episode. You find out what the light is. It's wonderful.", "label": "positive"}, {"sentence1": "Why is this show so popular? It's beyond me why people like it. I think it's one of the worst sitcoms out there. <br /><br />Because it's so popular, I've tried more than once to watch it and I can't make it through an entire episode.<br /><br />For one thing, the acting is horrible. Everybody is overacting to the point where it's annoying to watch. They talk in unnatural voices, use unnatural tones, and have unnatural body language. I've seen better acting in a kindergarten school play.<br /><br />For another thing, it's NOT FUNNY. The plots are dull. They're not creative, intelligent, or FUNNY. Shouldn't a sitcom be funny?? Why am I not laughing?<br /><br />Lastly, what is seventies about this? It's about as authentic to the seventies as \"Happy Days\" was to the fifties.<br /><br />OH and what is up with Ashton Kutcher? Who cast this untalented dweeb? And now he's making movies?? Oh, save us all!<br /><br />If people think this is quality television, it worries me.", "label": "negative"}, {"sentence1": "I was quite a fan of the series as a child and after that it has always remained in my mind as one of those memorable cartoons that made a difference in the early 80s compared to previous animated series (Heidi, Barbapapa, Il Etait une Fois l'Homme..., most of which I love). I find that other similar Japanese cartoons of this kind released later can't match Mazinger Z, as they started to boringly repeat the same pattern.<br /><br />That very thing, the novelty, may be one of the best features of Mazinger Z. Another good point is its inventiveness, with so many extravagant monsters, strange devices and bizarre characters; actually, we were eager to see each new installment to find out what kind of new fiend or evil machine was awaiting us!", "label": "positive"}, {"sentence1": "The writers and producers of this little outing have plummeted new depths of depravity. Did writer's block set in so badly, OR had ideas dried up so much, that they were forced to include a disgusting scene where a young woman defecates in the back seat of a van, and then promptly throws the excrement at the car behind (mind you at least this summarises what this film is worth). We had already been treated to one of the other women urinating over one of her friends at gunpoint, as well as numerous episodes of graphic vomiting; once would have sufficed... we got the message! This really is taking toilet humour to another level! Had the script and acting been better then I could have easily forgotten that I was watching a film shot entirely on low budget video. This was a fairly original storyline, with a clever (the only) piece of direction in that we only ever got to take the viewpoint from inside of the van; thus making it feel much more real. We never got to see inside any other locations, such as the store or the field where several of the women disappeared, and this could have added much needed tension.<br /><br />The script was dire. Lines like: 'I don't feel too good... I want to go home' after one of the girls has been pursued by a psychopath; subjected to rape by a screwdriver and shot at, seem a little undercooked.<br /><br />The acting was diabolical (apart from the maniac). Did all the main 5 actresses in this learn acting by taking a correspondence course during a long postal strike! The sound was so bad that I had to watch the entire film with the subtitles on.<br /><br />The director seemed to have an easy job in this. It seems that the only direction he must have given was: 'Scream girls'.<br /><br />AND AS FOR THE SCREAMING...... If you watch this please be sure to have some paracetamol at the ready!", "label": "negative"}, {"sentence1": "The film was okay, quite entertaining. The cast was pretty good, and I'll second what the comment before me mentioned - Glenn Quinn was outstanding and he alone is reason enough to watch this movie. He played the selfish \"evil\" friend and manager of the band brilliantly!<br /><br />There are a lot of songs performed by \"Beyond Gravity\" in this film, but this doesn't really come as a surprise considering the film is a VH1 production. However, if the soft rock/ pop music isn't to someone's liking one might as well flash forward those scenes.<br /><br />The plot of a band trying to make it to the top in L.A. but having to overcome many obstacles on the way isn't too original, but quite entertaining, with some surprising plot turns here and there.", "label": "positive"}, {"sentence1": "Purple Rain... what else can i say, the title speaks for itself. But i think all the actors were well picked. The movie had a great story. I loved it! Ever since i watched that movie, i've been stuck in the eighties, and I'm only 13! My favorite part of the movie was when his father died and he was picking up all of his music compositions, and the Apollonia was sitting on the stairwell with his earing in her hand. Critics say that its a drama but i think its more of a romance. Murphy Brown also did a great job in the movie, he actually acted like himself. I'm so glad I've seen this movie. The song Purple Rain, beautifully sung, was so heartfelt. I cried more than once.", "label": "positive"}, {"sentence1": "We see a body of dead girl in a morgue with the coroner trying to close the eyes of the girl, but whatever he tries they won't stay open. After this we move into the future and we follow a group of former school friends who hide a terrible secret, but suddenly they start getting picked off one by one in many grisly ways. Through flashbacks we learn of this awful suicide of a shy girl who was trying to be one of the group, but she was shut out by them because they dug up her past and found out some weird occurrences. So, is she back from the grave seeking revenge? <br /><br />Oh what a great and always spooky story! Well, that's what I hoping I could say. And 'hoping' was as good as it got. This is an forgettable, so-so supernatural horror flick that I actually watched before, but I went in thinking it was my first viewing. So to my surprise it hit me when I started picking up on certain things, but like I said it's quite a forgettable mix that it felt like a first viewing again. \"Nightmare' is just another type of it's field that adds a 'few' changes to the gruel. Oh, please give me something that's a bit more fresh. It doesn't have to be entirely original, but this is one formulaic and at times quite tired J-horror flick. Even though it strings along the usual ghost story involving you guessed right\u0085 an evil looking, vengeful chick spirit.<br /><br />But in spite of my negativity of it being the same old, same old story and jolts. This one kind of entertains when its being grisly and popping in some creepy visuals. The deaths are vividly displayed with bite and some originality. While, the gloomy atmosphere alienates the audience with it's murky lighting. The first scene involving the spirit terrorising one of the girls is one blood-curdling experience, but really when it's not trying to shock you. I found it rather coma inducing and I thought about getting some shut-eye. That might be harsh, but it just didn't go anywhere of any interest between those shock moments. You could say that because the supposed mystery is really not much of one, the unsure story is just simply flat and the characters are a self-centred bunch that you don't really care what happens to them. The disjointed story should have focused more on the spirit than that of these bland characters who have one unconvincing group relationship. It just overplayed its cards by becoming overly muddled and taking too long to get going that when it comes to the climax it's just plain ludicrous. The film's haunting ending is a high point, though.<br /><br />The film looks fine, although it could have done without the snazzy, quick fire editing and the music score was a bit overbearing in playing up the mood. The performances tread a fine line, but Gyu-ri Kim is strong in the lead role.<br /><br />It's nothing new and it shamelessly steals ideas, but if you can look past that it delivers some nasty thrills. Although, I found the handling of it rather lethargic, despite the odd effective chills. A standard effort all round I guess, but still it's equally missable.", "label": "negative"}]