[{"sentence1": "OK this movie was made for one reason and one reason only TO MAKE MONEY!!The producers obviously didn't care about killing a classic horror movie. I knew this movie would suck as soon as it was going to be a pg-13 how many pg-13 slashers movies have turned out to be good? Thats like asking how many women have been on the moon? The answer is NONE!! Prom night 1980 was of cource no masterpiece but it certainly deserves to be recognised as a movie that stays true to its genre and deosnt try to be anything more than that.<br /><br />My problem with Prom night 2008 is the way that it handles the killer and i have 3 major problems with him.....................<br /><br />1)The way he escapes, he was locked up in a mental institute and he escapes through a air conditioning vent!! WHAT THE HELL? why would they have an air conditioning vent in the patients room? Do they want him to be comfortable during his stay or something? 2)His intentions are somewhat uncertain the killer want all of the main victims family and friends dead so he can have her all to his self, he says he loves her but the next minute he trys to kill her, so does he want to kill her, love her or just plain rape her?? 3) The killer is too good, how did he develop all of his skills? He used to be a teacher, so in this one scene where he kills the main victims boyfriend while hes basically on top of her asleep and she doesn't notice, it all silly 2 stars out of 10 terrible,silly,stupid attempt at a horror movie", "label": "negative"}, {"sentence1": "By no means my favourite Austen novel, and Paltrow is by no means my favourite actress, but I found the film almost totally delightful. Paltrow does a good job, and Cummings, Stevenson and the one who plays 'Miss Bates' are all absolutely terrific. The period detail is not alienating; the feel of the movie is just right, in fact. But the real 'find' is Jeremy Northam as Mr Knightley. There could not be more perfect casting, IMO. I hated Mr K in the novel, but found him wonderfully human and humane in the film. Northam's good looks and smiling eyes are no hindrance to enjoyment, either! Highly recommended. AnaR", "label": "positive"}, {"sentence1": "ba ba ba boring...... this is next to battlefield earth in science fiction slumberness. genie francis (aka general hospital's laura) has a small role as a reporter and that in itself should tell you that this movie must be bad.... there is ben kingsley (an academy award winning actor) in this stinker and a few others decent actors. You have to wonder what possessed them to decide to do this awful movie. The music dramatically goes up and down like it's a major dramatic story. Even if you pay attention the plot is impossible to follow. The effects are mediocre as well and seem really dated. All of the actors speak in a monotone voice and have no realism to their dialogue. I could go on and on on how this is a bad movie. At least with Battlefield Earth it's so bad it's funny but this is just b o r i n g. Avoid unless you want to be lulled to sleep.", "label": "negative"}, {"sentence1": "I went to see this movie twice within a week and can only sum it up in one word (which I normally don't use lightly): Wonderful! In my view, the best movie ever made. Who deserves Oscars and other awards if not this Swedish crew who have created cinematic perfection in the last scenes of the film, when everything that is said (and left unsaid) throughout the story is drawn together? Just as the character of Daniel Dareus evokes so many sentiments and long repressed feelings within the people around him, the movie does the same to its viewers: You walk out with your head abuzz and your heart feeling full. Great stuff! Next time you ask yourself \"what is the meaning of life\", perhaps think about how you feel after a sumptuous experience like As it is in Heaven: Happy, content, fulfilled. To say it with Virginia Woolf's Mrs Dalloway: \"Such moments are enough\".", "label": "positive"}, {"sentence1": "Truly amazing film, the concept as a possible prophetic vision of the future is frightening. A world vastly overpopulated, unbearable heat due to the damaged ozone layer, and all our natural resources spent. In this nightmarish degenerate society we have the great Charlton Heston as a likable film noirish style detective trying to fathom the truth behind a murder, opposite the film noir legend Edward G Robinson turning in a fine last performance.<br /><br />One of the images that will always stay with me from this film, is the masses of people that populate the stairwells and the way in which Thorne (Heston) has to hop through them every time he uses them.<br /><br />The movie's use of music is note worthy too, although it contains no score in the usual sense, The opening theme is good, and the subsequent snatches of music we here in Simonson's apartment, and especially the Beethoven pieces in the euthanasia clinic are outstandingly atmospheric.", "label": "positive"}, {"sentence1": "I think everyone was quite disappointed with this sci-fi flick. For one thing, it was directed by Tim Burton. Another thing, it's a remake of what is supposed to be a classic. I found it boring, gross, and ridiculous. If you've seen it, you know what I mean. Just about everyone at Imdb say it's crap and boy, are they right! If you haven't, avoid it. It's a snorer. 1 out of 10.", "label": "negative"}, {"sentence1": "This was just plain terrible. I read this book for school, i made As on all of the tests, and to see it like this! My teacher forced me and 20 other people to watch it, and it was worse than Leonard Part 6, Plan 9 from Outer Space, and Hudson Hawk put together. The thing that made this film so terrible was enough reasons to want to kill yourself over. First of all, it was made on Hallmark. Second, the acting was terrible. Third, it was like completely different from the book. Literally, it was so bad I asked myself to be excused. Basically, I would rather watch Basic Instinct 2 than watch this. Take my advice, don't watch this film. No one would want to watch this. It was horrible. HORRIBLE!", "label": "negative"}, {"sentence1": "This was the first of Panahi's films that I have seen, I saw it at Melbourne film festival. I was totally absorbed by the different characters that he creates and how differently they react and behave compared to Aussie kids and yet on other levels how similarly. I think perhaps if more people could see movies like this, they could see people as individuals and avoid racism that can often be fueled by the fear of the unknown. There are the obvious large political differences between Oz culture and Iranian culture, but I found the more subtle differences between the characters, that this film fleshes out so successfully on screen, extremely fascinating. There are idiosyncrasies in the characters that seem to me, so unique. I found it made the characters compelling viewing.", "label": "positive"}]