[{"sentence1": "The above seemed a much more appropriate title when me and my suicidal underlings decided to watch this masterpiece of modern bullshit <br /><br />Erotic,Scary, Suspenseful, Well thought out, these are all the things this film fails to be.<br /><br />It is however incredibly funny, the slow sound effects and bad dubbing add to this to make one of the greatest comedies I have seen in recent years. And yet this film doesn't even try to be funny and that is one of the movies grand achievements, it becomes a comedy without even attempting to amuse.<br /><br />Throughout the film an old guy who looks amazingly like Santa Claus goes around ploughing over zombies and smashing vampires into the ground. This made me fail to believe the films title, if this was vampires vs zombies why were the vampires and zombies not fighting? Oh well whatever, besides there were more flaws to this rental than the title. Such as this one; there has been a virus sweeping through America creating zombie like beings who go around acting a lot like your average tourist. And yet there's only four zombies in the entire film. Another problem is besides one shop everywhere is deserted. Surely you'd see zombies roaming about in the woods or in the background a bit. In fact I believe they just drove around in a circle of forest over and over again since they didn't have a high enough budget to film in a wider location, that or the director didn't want to waste his precious time filming in different areas of wood he was to busy sitting in a trailer jerking off to be bothered with such trivial matters.<br /><br />In fact the director had so much fun doing this that he didn't have enough time to hire a big enough cast or even an editor. And so he told the eight members of the cast to dress up as different people and try not to act inconspicuous, whilst I assume he changed his name and began randomly snipping at the film reels \"editing isn't a hard job anyway right?\" The only reason this \"movie\" found it's way into our bag was because somehow we got it confused with Freddy vs Jason, strange how these things happen isn't it. And the only way we made it though the night was by strapping gas masks on and bolting them to our skulls to avoid the stink of this nauseating mess.<br /><br />Oh yes we did laugh at the end, but I'm sure one does that a lot when he has lost his sanity...................", "label": "negative"}, {"sentence1": "When this play was first shown by the BBC over 30 years ago, it would have been something quite different for the time. So therefor some people would have found it quite scary, and may well have been impressed with the special effects?<br /><br />Looking at the play in this day and age, It doesn't seem to be all that scary anymore, even the special effects can leave a lot to be desired.<br /><br />Would a train really be allowed to pass a RED LIGHT into a dark tunnel? I don't think so......but if you watch this play again, you will observe that the first train that enters the tunnel, rushes straight through the RED LIGHT! (maybe that's how it was in dickens time)?<br /><br />You will also notice that the footpath that leads down to the Signal Box is very steep and in a poor state. Surely there would have been a series of proper steps with handrails for the Signalman to climb up or down into the cutting. (i can't help but notice things like that)<br /><br />I will not take anything away from the acting, both Denholm Elliott (signalman) and Bernard Lloyd (the traveller) gave wonderful performances.<br /><br />I am not at all sure what is going on......I mean was the ghost the traveller, or what??? Does anyone really fully understand this rather confusing story??? (well maybe i am the only one that don't)???<br /><br />To sum up.....<br /><br />The play has a wonderful atmosphere throughout, with great character. It suffers from not being that scary these days, and a little if not very confusing in places, and has some rather unusual signalling practises....<br /><br />Thanks for reading my review.", "label": "negative"}, {"sentence1": "Having just finished Cronicles of the Heroic Knight mere minutes ago I find myself extremely please but questions still loom over me. While it would appear that the first 7 episodes or so are actually a retelling of the events of the first Record of Lodoss War the truth is that they really aren't. It would appear that the creator of CotHK had a different vision as to how the original ended (and that may be the reason that the first 7 episodes occur) but I do not find that to be the case. CotHK does say it starts 5 years after the War of Heros which Parn was a part of. I think the director made the first 5 episodes seem so much like a recap of the original just to give the viewer a small reminder and an introduction to characters and their deeds done because they appear much less after the series kicks into Spark's story. Now, once the series does kick into Spark's portion we find ourselves kicked up another 10 years (15 years now since the War of Heros). Spark and his crew do, in some cases, resemble Parn and his crew once the journey kicks into gear, especially the love story that brews between Spark and Neese. I also thought several times throughout CotHK that I threw in the original series and if it wasn't for Spark's long blue hair I know I would've pressed stop more than once to make sure the right disc was in. By no means do I consider these major set backs however, the writers did a fine job in crafting believable characters and a remarkable storyline. The only thing that makes me hurt is that Ashram and Wagnard return. Ummmm... how??? Don't get me wrong both are great villains even though Ashram's only villainous trait is that he supports the Marmo. Perhaps I missed something during the coarse of the series that explained that part. As far as sequels go though, I highly recommend CotHK. I place both CotHK and, even more so, the original Record of Lodoss War far above the Lord of the Rings trilogy. Both of these are more epic than anything I've ever seen or read. I highly recommend this.", "label": "positive"}, {"sentence1": "I just viewed Detention last night and i liked what i saw. It was a cool fun movie.Dolph looked superbly cool on the Bike.He also looked good in this movie as compared to his other recent movies.He is now in a pretty good shape.The story was ok and the other actors were also passable.I wouldn't call this movie his best but its still a good movie.<br /><br />But it also had its share of Problems. The first one was the way bullets were flying everywhere and even when they were being fired at point blank range they missed the target.They should've had shown the ppl escaping the bullets in a better way. Another problem which i had was the way the students were swearing. I dont know in which school the students can swear in front of their teacher and even in the classroom. The third problem was that the bad guys were very few in numbers. There should've been more bad guys. Last problem was definately the fact that the set looked cheesy , but that was due to the small budget. Overall the movie was a good Movie.I enjoyed it.I would recommend others to watch it. P.S. Now u r a DEAD beat cop. (Some One-liners were also cool)<br /><br />", "label": "positive"}, {"sentence1": "This film is a joke and Quinton should be ashamed of himself, trying to pass this off as a Modesty Blaise Film. If you are having trouble sleeping then all means rent this film. The stick figure they call a actress who is suppose to be Modesty Blaise has got to be the most boring person on this planet. Maybe she could be used as a hat stand in the back ground of a real film.seventy-five minutes of nothing thank you who ever invented the fast forward button. If you see this film if you can call it that coming your way RUN. I can't help but think what 3rd world country could of used the money wasted of this crap. this film is boring the actors are boring waste of colour a waste air they breath If you would like to see Mostey Blaise Film then watch the one they made in the 60's maybe that what the director should of done.", "label": "negative"}, {"sentence1": "Steve Biko was a black activist who tried to resist the white minority governed South Africa in much the same way as Gandhi tried to resist the British empire's colonialism in India. Richard Attenborough's film Cry Freedom is not about Biko or Apartheid as much as it is about Donald Woods, the white liberal newspaper editor who risked his life trying to tell Biko's story. The film has a jarring point of view switch after Biko dies in prison from tortuous behavior at the hands of South African \"police\". Woods, played by Kevin Kline, must choose whether to do the right thing and flee the country to publish books about Biko or allow his wife, played by Penelope Wilton, to pressure him into forgetting about the books. In that case, Biko dies in vain. What begins as a life-changing friendship between Biko and Woods degenerates into a standard by the numbers escape over the border yarn after Biko's death. Oscar-nominated Denzel Washington is good in only his fourth film as Biko, but something is wrong in a film that tries to depict the struggles of Apartheid by focusing more on the trials of a white family for more than half the film. Attenborough would have served his topic better by focusing on Biko's rise to prominence instead of beginning where Biko befriended Woods. Perhaps a black actor in a leading role in a 2 1/2 hour film wasn't exactly conducive to big box office, but the film was a tremendous box office flop anyway. Film politics aside, the film still entertains and sends a message or two, albeit, in PG-sanitized fashion. *** of 4 stars.", "label": "positive"}, {"sentence1": "A Scanner Darkly, Minority Report, Blade Runner, Sin City and Sky Captain and the World of Tomorrow \u0096 if you are a fan of any of these then this will be well worth checking out.<br /><br />French animation project 'Renaissance' took seven years to make on a shoestring budget and tonight I finally got to see it at a private screening for the International Film Festival in Stockholm. My spontaneous reaction is awe; my further reflection is 'huh, neat' and closer analysis regrettably gets a resounding 'meh'. It is a gorgeous science fiction triumph on the surface, but scratch it or even poke it a little and its unnecessarily complex plot becomes glaringly apparent, as do the flat characters. <br /><br />Nevertheless it is clear that the people at Onyx films have done something spectacular with the aforementioned surface. The visuals are staggering. They have used live action motion capture fitted into key-frame animation, with stark jet black and bright white contrasts and a heavily shadowed rotoscoped background. For those of you who are not down with the 'technical lingo', the film looks like a fully-animated Sin City. Its fluid, transparent, dark and stylized template is complemented by great lurid lightning. It's a vision. Yet much credit is also due to the crisp sound effects that take the form of humming futuristic weapons, suspenseful music, heavy raindrops and glass shards breaking. It's every tech-nerd's wet dream...<br /><br />The film zooms in on an eerily-lit, bleak, futurescape Paris in which a major corporation called 'Avalon' has begun to interweave in the lives of the citizens with surveillance (think the fluid transparent screens from Minority Report) and genetic engineering. The latter leads to a mysterious kidnapping of young researcher Ilona (voiced by the lovely Romola Garai). Cut to our hard-boiled cop-on-suspension and protagonist Karas (Daniel Craig) \u0096 a man who takes the law into his own hands \u0096 who is assigned the case of finding and retrieving Ilona. During this case, he is being aided by Illona's sister with whom he also begins a love affair. A very half-assed love affair, if I may say so.<br /><br />The world of Renaissance is remarkable. Director Christian Volckman takes a fair jab at melting the noir themes and the result is an urban jungle filled with cads, rats, femme fatales and lonely detectives that hide in the shadows of the seedy slum. The problem is that the creators undoubtedly felt the need to have extremely clear and spelled-out archetypes in the story, or the film would have been \"too surreal\" for mainstream audiences, owing to its lurid animation format. It follows then that we have a multitude of clichéd characters such as evil-laughing villains, sleazy crime bosses and butch tough-chicks who blow smoke every chance they get. It shoves noir in our faces, and it isn't necessary.<br /><br />What is worse is that the dialogue is a little contrived. It seems as though every line exists for the sole reason of propelling the plot. This is nothing fatal because the plot is so complex once it gets going that it needs some clear direction. Daniel Craig helps here too by bringing a no-nonsense attitude to his hard-edged cop character. At one point in Renaissance, he is seen in a vivid car-chase that surely is one of the most adrenaline-pumping and top notch sequences of the film. Unfortunately, the novelty of the sci-fi visuals have worn off post this car chase and 'Renassaince' could benefit from being slightly shorter. In summary, a very interesting but flawed futuristic comic book experience.<br /><br />7 out of 10", "label": "positive"}, {"sentence1": "A little girl's dead body is found stripped of all possible means of identification. When it is discovered that one leg is longer than the other, it is assumed to be the body of a couple's missing daughter. After this trauma, the couple separates and the mother becomes addicted to tranquilizers and leads a miserable existence. All of this changes when one day, many years later, she receives a phone call from her daughter! With the help of an ex-cop and a reporter, she sets out on a journey to determine if her daughter is indeed alive. \"Los Sin Nombre\" is a mess plot-wise, moves at an achingly slow pace, and is completely unscary. The saving grace is Emma Vilarasau, who does an outstanding job as the desperate mother. The best part of the movie is the ending, but I'm not sure it is worth enduring the rest of the film. Beware of the English subtitles on the recent R1 release--they aren't very accurate.", "label": "negative"}]