[{"sentence1": "It is not obvious from viewing this film (so I recommend viewers research the people who present their case in it) but this presentation on the realities of Islam, and its encouragement of violence and intolerance against all non-Muslims is lacking objectiveness, and also completely fails to factor in the human condition. It is one thing to document that the Koran says many things about how a devout Muslim is required to interact with non-Muslims, but any realist is able to realize that not every human who feels himself or herself to be a follower of Islam, will agree with and comply with all tenets of that faith and system. There is reason to call much about the presenters into question, such that viewers need to see the presentation with a healthy skepticism; don't swallow it all, hook, line, and sinker, without some thinking of your own.<br /><br />One specific, for instance, is researching the person Walid Shoebat; who claims to be a former Muslim who perpetrated an act of terrorism in Bethlehem. There are many wise people in the world who believe neither of these assertions. I am not nor have I ever been a Muslim. I have never read the Koran. I am not a Christian, nor a member of _any_ faith. But I am an intelligent and discerning human. While the film is quite disturbing, in its presentation of how SOME Muslims view their obligation to Islam; I remind you that there is more to Islam than the views of the fundamentalists. Just as their are fundamentalists and evangelical Christians, so, too, there are variations in the intensity of belief and obligation among Jews and Muslims.<br /><br />When you watch this film, you need to have the salt shaker on hand. One grain will not be enough, you'll need more. Please use your own mind and think for yourself, research what is presented, and evaluate the state of the world and how Islam fits within it based on more than what is said in 98 minutes of video. There is a common thread of political affiliation among those who put this film together, indicating a definite bias. Be your own brain.", "label": "negative"}, {"sentence1": "This is a very funny movie! I have no idea whether it translates well into other languages or not. However, I do think men all over the world can identify with \"Frank\" and his thoughts to some extent! These thoughts are hugely entertaining and women will also enjoy this movie I'm sure!<br /><br />All cast members perform well, and this film could have been a tremendous hit all over the world if it was made in England or the US. But for those of you who are fortunate enough to understand Swedish, you are in for a treat!<br /><br />Highly recommended.", "label": "positive"}, {"sentence1": "This will be a different kind of review. I've seen this movie twice on TV and would like to have a copy because it talks about Panama City and the beach in the winter time which is my favorite time to be there. It was the first movie I'd seen by Ashley Judd and she was great and I've enjoyed every other thing I've seen her in. Sundance's reaction made an impression on me too, as did the director, Victor Nunez, who has directed and written several movies about Florida. This movie speaks to me and I've seen nothing with which to compare it. The plot speaks less to me than the surroundings. Well, I told you it would be a different kind of review.", "label": "positive"}, {"sentence1": "I have been looking for this film for ages because it is quite rare to find as it was one of the video nasties. I finally found it on DVD at the end of last year it is a very low budget movie The story is set around amazon jungle tribes that are living in fear of the devil. Laura Crawford is a model who is kidnapped by a gang of thugs while she is working in South America. They take her into the jungle Laura is guarded by some ridiculous native who calls himself \"The Devil\" she has to go though all unpleasant things until they are happy. Maidens are Chained up. The devil demonstrates eating flesh in a horrible manner. Peter Weston, is the devil hunter, who goes into the jungle to try and rescue her,", "label": "negative"}, {"sentence1": "It's nice to see a film with real people with honest feelings. Sissy Spacek is so absolutely convincing as a simple, yet nice, daughter to Robert Farnsworth,<br /><br />who finally, in his last role, gets to show what a fine actor he was. It is hard to believe that this is a David Lynch film. It is slow and even, sweet and moving. One of the best unless you like car chases, sex scenes, and violence.", "label": "positive"}, {"sentence1": "I read somewhere that when Kay Francis refused to take a cut in pay, Warner Bros. retaliated by casting her in inferior projects for the remainder of her contract.<br /><br />She decided to take the money. But her career suffered accordingly.<br /><br />That might explain what she was doing in \"Comet Over Broadway.\" (Though it doesn't explain why Donald Crisp and Ian Hunter are in it, too.) \"Ludicrous\" is the word that others have used for the plot of this film, and that's right on target. The murder trial. Her seedy vaudeville career. Her success in London. Her final scene with her daughter. No part logically leads to the next part.<br /><br />Also, the sets and costumes looked like B-movie stuff. And her hair! Turner is showing lots and lots of her movies this month. Watch any OTHER one and you'll be doing yourself a favor.", "label": "negative"}, {"sentence1": "I searched out this one after seeing the hilarious and linguistically challenging \"Clueless\" (1995), perhaps Alicia Silverstone's best known effort from early in her film career. \"True Crime\" has Kevin Dillon, which should be helpful in improving most film projects. In fact everyone in the cast does a good job . The only disappointment I think the movie has for me is an awkward \"feel\" to some of the scenes, coming from the need to run a quite uncompromising, grown up theme as part of what in tone starts out as a schoolgirl adventure.<br /><br />Alicia Silverstone is pretty good in this one. She carries off well the naive enthusiasm and growing unease that affects Mary Giordano as she manoeuvres towards the truth behind the serial murders. I reckon her characterization of MG has some mileage in it too. The inference of the story line is that she goes on to a career in law enforcement. It could be really interesting for an older Silverstone to revisit Giordano at a time of crisis later in the officer's life. Just a thought!<br /><br />\"True Crime\" shows its director in a good light. Pat Verducci also has the writing credit. I don't know of any other film work PV has done. I can only wonder what happened after such a promising start.<br /><br />Like most productions, this one has a largely unknown supporting cast, although Bill Nunn (Detective Jerry Guinn) is hardly that. Over the past decade he seems to have been able to secure an impressive number of screen appearances. I recall seeing him recently in \"Carriers\" (1998), a made for TV presentation with a military theme. Bill Nunn played \"Captain Arends\". Fans of the classic US TV comedy show \"Who's the Boss\" may also have an interest in \"Carriers\" because the leading player is Judith Light, remembered with affection by many because of her lengthy involvement with the show.<br /><br />\"True Crime\" could easily not have worked, but it does OK. I think it is an entertaining story worth seeing.", "label": "positive"}, {"sentence1": "This movie isn't worth the film it was photographed on. The dialog is flat, filled with cliché overused lines and delivered by amateur actors who sound like their reading a script for the first time. The choppy, shaky, film style is a cheap imitation of the \"The Ring\" style visual effects. The characters do not even act like a normal person would. For example, the character who is looking for her twin sister at her home forces her way through the front door, creeps around the house all frightened and sobbing and she doesn't even once call out her sister's name to see if she is home. What? You would think she had just buried her sister instead of searching for her. Way too many flashbacks to her childhood. Too many unnecessary flashbacks is a typical sign of an amateur director. It is actually funny watching the numerous shots of the woman driving her car down the street, up the driveway, around this corner, over here, over there, oh a side view, now a front view. Enough already. You would think you are watching a TV commercial for the Solaris! Terrible movie. 0 out of 100. I really pity anybody who spent money making this film or to watch it.", "label": "negative"}]