[{"sentence1": "I first saw this back in the early 90s on UK TV, i did like it then but i missed the chance to tape it, many years passed but the film always stuck with me and i lost hope of seeing it TV again, the main thing that stuck with me was the end, the hole castle part really touched me, its easy to watch, has a great story, great music, the list goes on and on, its OK me saying how good it is but everyone will take there own best bits away with them once they have seen it, yes the animation is top notch and beautiful to watch, it does show its age in a very few parts but that has now become part of it beauty, i am so glad it has came out on DVD as it is one of my top 10 films of all time. Buy it or rent it just see it, best viewing is at night alone with drink and food in reach so you don't have to stop the film.<br /><br />Enjoy", "label": "positive"}, {"sentence1": "When Samantha Eggar (as Phyllis Dietrickson) answers the door of her house swathed in a towel, you realize that as competent an actress as Eggar may be, she doesn't have the hypnotic allure of Barbara Stanwyck. And it is not entirely Eggar's fault. In the original film, Wilder had Stanwyck not only appear in a towel, but she enters the scene on the second floor balcony of the house. And she doesn't \"come out\"; she appears, almost as if by magic. Walter Neff is staring up at her from below on the first floor. There is a reason for this. Stanwyck is much higher than Neff (Fred MacMurray) when they are first introduced. It is not just the towel. The towel adds to the seductive allure. Her pose is like a Greek Goddess overlooking her domain, and, in a strange way, you feel as if, from the start, she is actually controlling the entire situation. She has sexual, even magic, power. This person is no ordinary housewife. This person is a mystery with secrets hidden within.<br /><br />Back to 1973. The remake has Crenna knock on the front door. Stanwyck's stand-in, Eggar, answers the door with a towel around her. There is no \"appearance\". She simply opens the door. The alluring superiority that grabs the audience at the first appearance of Stanwyck in 1944 is entirely absent in 1973. She opens the door with a towel around her. It may be sexy in a Charlie's Angels sort of way, but it's not nearly as mysterious. The filmmakers of the remake seem to misunderstand Wilder's point. The script may have said \"Phyllis appears in towel\" so the filmmakers of the remake simply follow the instructions and include the required towel. The point is not the towel. The point is the enigmatic quality of Phyllis, and the potential power she wields. Wilder gave her a towel to add to her mystique. The filmmakers of the remake gave her a towel because that's what Wilder did. And in the choice of shot, lost all of Phyllis' mystique.<br /><br />Richard Crenna also seems miscast. He seems like he's \"acting\" and not really in the midst of the dilemma. Part of the problem is Crenna appears so much like a 70's actor. He can't get into the 1940's. When MacMurray first speaks into the microphone, sweat begins to drip from his face. No sweat on Crenna. And they also changed one of the crucial lines at the beginning. In the original, Neff says, \"I didn't get the money, and I didn't get the woman.\" In the 1973 version, Crenna says, \"I didn't get the money, and I didn't want the woman.\" Did the filmmakers completely misunderstand the entire point of the story? Or were they dumbing it down for a \"television\" audience?<br /><br />This made-for-TV movie is a by-the-numbers rendition. All the sharp edge of the original is lost. The only stand-out, maybe, is Lee J. Cobb in the role made famous by Edward G. Robinson. But he cannot save the loss of intensity of the original. This 1973 boring remake is a forgettable TV-movie made probably by the same people who did \"Gilligan's Island\". They might as well have tried to remake \"Citizen Kane\" or \"Gone with the Wind\". If mediocrity is the best one can hope for, what's the point? The 1944 classic is a Film with a capital \"F\". This made-for-TV remake deserves an \"F\" grade, or, maybe a \"D\" for dumb.", "label": "negative"}, {"sentence1": "Who in their right mind plays a lyrical song at the same time they are portraying an emotional scene between two people? When Flipper confronts his wronged wife in the dressing room, the song sung with lyrical content is as loud as the dialog, so one can hear neither, diluting any emotional impact the scene may have had. The scenes of Annabella getting beaten by her father with his fists, a lamp and then a belt was so cartoonish as to be absurd. This entire movie is a cartoon, the rampant prejudice against whites is literally astounding. The discussion by the black women after flipper's wife finds out he has cheated on her with a white woman - as if it were a discussion by an oxford debating team, is ridiculous. The rampant racism might be possible to endure, but the soundtrack and the sound mixing during this 'movie' is too much. It was a technically poorly made movie. There is no understanding of the basic craft of movie making, the sound track, the editing and the desperate attempt of great actors trying to keep this movie afloat. I actually felt sorry for Anthony Quinn, wondering why he had accepted a role in this flick - his appearance in this is painful. This is the first movie I have seen by this director and it will be my last.", "label": "negative"}, {"sentence1": "Patricia Hunter: Oh, professor, do you also make a habit of collecting coffins? Dr. Lorenz: Why, yes, in a manner of speaking. I find a coffin much more comfortable than a bed. <br /><br />Interesting Bela Lugosi (Glen or Glenda, Dracula) vehicle where he plays the mad scientist. I was especially creeped out when he appeared in the bedrooms of his guests when they were sleeping.<br /><br />Luana Walters (Girls in Prison) was really appealing as a sensual reporter, Patricia Hunter< who was to be a victim, but woman-power trumps evil scientist every time.<br /><br />2'11\" Angelo Rossitto and creepy Frank Moran , who liked to stoke the women's hair added to the film.<br /><br />Interesting look at a 40s horror film.", "label": "negative"}, {"sentence1": "A surprise thriller with more twists and double crosses than a doodle pad. A great cast mixing it up with an intriguing plot overseen by a Twin Peaks-ish influence in director Dahl. Nicholas Cage is a very underrated actor and shows a great portrayal of a man in a bind looking for the right thing to do. J.T. Walsh (RIP to a great actor) is always a wonderful villain, as is Dennis Hopper. It's such a shame he never made to a higher profile in the biz. I'm sure he has his followers, though. In all, this is a great film that shows you that you don't need big bangs or a commercial soundtrack to be an entertaining film.", "label": "positive"}, {"sentence1": "I saw the film at the Nashville Film Festival. It was beautifully done, from cinematography to the acting. It's the story of a father and son, and how they come to appreciate each other during a family crisis. Beautifully written with dialog that never rings false, the film showcases the acting talents of Paul Reiser and Peter Falk, among others in this outstanding cast. The film begins with the aging father (Peter Falk)is trying to figure out why his wife (Olympia Dukakis) has left him. The father presents himself, unannounced, on the doorstep of his son and daughter-in-law. The father and son take off the next day to look at some property and end up taking a classic road trip. They fish, play pool, watch a baseball game, get drunk, get involved in a barroom brawl, and dance with strange women. But more important, they each confront the unspoken tensions that can affect any family. It's the kind of film that touches the heart and makes one appreciate those who are closest to them.", "label": "positive"}, {"sentence1": "I am SURE there is some sort of IMDB cult that likes movies that MST3K made fun of. After seeing both this and \"Werewolf\" and reading dozens of comments about how underated they are, I became convinced that there is some conpiricy going on here. Alot of people are saying that people who hate it \"are only scared by gore\", \"Don't know good horror\" or stuff like that. Well, I don't really care for gore, but I do want SOMETHING to happen in a movie! Most of it is just the wife sitting and looking around! Or walking around the house/garden! A movie requires something to give it atmosphoere, you don't get it by just have pointless scenes were someone walks around and stares. Oh, and \"Makes you think\"? Yeah, I was thinking \"MOVE! YOU @#$0&%!!\" One of the worst horror movie I have ever scene! <br /><br />P.s. For the record, I am a big fan of the old style of horror, Dracula, Frankenstein, That kind of stuff.", "label": "negative"}, {"sentence1": "Until today I had never seen this film. Its was filmed on the sets of the Old Dark House and Frankenstein and concerns a small Bavarian village where supposedly giant bats are sucking the blood of the villagers.<br /><br />Frankly its a damn good movie that has atmosphere to spare and a cast that won't quit, Lionel Atwill, Dwight Frye, Faye Wray and Melvin Douglas playing a character named Brettschnieder which is of interest to me since that was my great grandmother's maiden name.<br /><br />This is a carefully modulated film that has suspense and witty one liners that slowly builds for its brief running time, only going astray when about ten minutes before the end they realized they had limited time to wrap everything up. From that point to the end its a straight run to the finish with very little of the fun that preceded it.<br /><br />Leonard Maltin and IMDb list a running time of 71 minutes and warn of shorter prints. The trouble is that IMDb and Maltin can be wrong, and in this case I think they are since a source I trust more says the full running time is 67 minutes (The Overlook Film Encyclopedia) Quibbling about this I know is insane but since most prints that are available tend to run around 60-63 minutes the amount of missing material is considerably less if its only 67 minutes long. Personally I think it won't matter that much since its at most five minutes and I doubt very much it will make or break the film.<br /><br />What ever the running time , if you like creaky old films, do, by all means do, watch this movie, its a great dark and stormy night film.", "label": "positive"}]