[{"sentence1": "Time paradoxes are the devil's snare for underemployed minds. They're fun to consider in a 'what if?' sort of way. Film makers and authors have dealt with this time and again in a host of films and television including 'Star Trek: First Contact', the 'Back to the Future' trilogy, 'Bill and Ted's Excellent Adventure', 'Groundhog Day' and the Stargate SG1 homage, 'Window of Opportunity'. Heinlein's 'All You Zombies' was written decades ago and yet it will still spin out people reading that short story for the first time.<br /><br />In the case of Terry Gilliam's excellent film, '12 Monkeys', it's hard to establish what may be continuity problems versus plot elements intended to make us re-think our conception of the film. Repeated viewings will drive us to different conclusions if we retain an open mind.<br /><br />Some, seeing the film for the first time, will regard Cole, played by Bruce Willis, as a schizophrenic. Most will see Cole as a man disturbed by what Adams describes as 'the continual wrenching of experience' visited upon him by time travel.<br /><br />Unlike other time travel stories, '12 Monkeys' is unclear as to whether future history can be changed by manipulating events in the past. Cole tells his psychiatrist, Railly (Madeleine Stowe), that time cannot be changed, but a phone call he makes from the airport is intercepted by scientists AFTER he has been sent back to 1996, in his own personal time-line.<br /><br />Even this could be construed as an event that had to happen in a single time-line universe, in order to ensure that the time-line is not altered...Cole has to die before the eyes of his younger self for fate to be realised. If that's the case, time is like a fluid, it always finds its own level or path, irrespective of the external forces working on it. It boggles the mind to dwell on this sort of thing too much.<br /><br />If you can change future events that then guide the actions of those with the power to send people back in time, as we see on board the plane at the end of the film, then that means the future CAN be changed by manipulating past events...or does it? The film has probably led to plenty of drunken brawls at bars frequented by physicists and mathematicians.<br /><br />Bonus material on the DVD makes for very interesting viewing. Gilliam was under more than normal pressure to bring the film in under budget, which is no particular surprise after the 'Munchausen' debacle and in light of his later attempt to film 'Don Quixote'. I would rate the 'making of' documentary as one of the more interesting I've seen. It certainly is no whitewash and accurately observes the difficulties and occasional conflict arising between the creative people involved. Gilliam's description of the film as his \"7½th\" release, on account of the film being written by writers other than himself - and therefore, not really 'his' film' - doesn't do the film itself justice.<br /><br />Brad Pitt's portrayal of Goines is curiously engaging, although his character is not especially sympathetic. Watch for his slightly wall-eyed look in one of the scenes from the asylum. It's disturbing and distracting.<br /><br />Probably a coincidence, the Louis Armstrong song 'What a Wonderful World' was used at the end of both '12 Monkeys' and the final episode of the TV series of 'The Hitchhiker's Guide to the Galaxy'. Both the film and the TV series also featured British actor Simon Jones.<br /><br />'12 Monkeys' is a science fiction story that will entertain in the same way that the mental stimulation of a game of chess may entertain. It's not a mindless recreation, that's for sure.", "label": "positive"}, {"sentence1": "I would perhaps give 6 or 7 to this propaganda film because it shows when and how a propaganda film becomes successful. If there are people who watch this piece and think that \"well then Jews must have done something to be treated the way they were treated in WW2\", then the movie is very cleverly made to conceal 'why's and 'how's as well as mix correct and false observations on how a people live. What more can a propaganda movie aim for? The part in which an American movie about the Rothschild family is included is re-used very shrewdly here, for instance. The question of why the Jew keeps his wealth away from the officer is never asked. No one mentions the system of taxation within that particular social strata.<br /><br />Besides, the level of excitement (or, the level of disgust) in the movie increases slowly and the solution-like end of the movie suits the aim and the musts of doing propaganda. The audience would leave in joy and gratefulness to the times that are coming up...well done.<br /><br />In the movie, there is a kind of simplicity that addresses the most basic emotional perception of the audience. The movie is kind of history today, so no need to fuss much about it actually. However, in this simplicity of words of ethnic degradation, a careful watcher can find relevance to today's cultural hatred, violence, decivilization as well as the problems of integration. Overall, fine trash.", "label": "negative"}, {"sentence1": "This is a movie that plays to everyone's emotions. We all want a second chance at things. Jim Morris got one, followed his heart and got a chance to live his dream. What a great message and what a great delivery by this movie.", "label": "positive"}, {"sentence1": "This movie appears to have been made by someone with some good ideas but who also never had made a movie before nor had they considered that a script should be edited or even funny. When I saw this film, I saw it for John Candy and assumed, incorrectly, that it would be hilarious. Instead, there was a stupid plot about mind control and so many flat, unfunny moments. And, to top it off, Candy delivered some of the crudest lines I had ever heard up to that time. So, despite a potentially funny cast and story idea, we are left with an amateurish and crude movie that will probably be too stupid for the average adult, though teens will probably find a few laughs. It's really a shame--it could have been so much better. I mean, with Eugene Levy, Joe Flaherty and John Candy it SHOULD have been wonderful.", "label": "negative"}, {"sentence1": "A very interesting entertainment, with the charm of the old movies. Tarzan faces the greatest perils without hesitation if the moment requires it, and we all enjoy with him his success.The most insteresting for me is a man without special powers facing the problems and beating them just with human skills (he was a great swimmer and had a great shout)", "label": "positive"}, {"sentence1": "I am from the Dallas/Fort Worth area and lived in Arlington for a few years. This movie was way off as far as making it look like Arlington. I saw mountains in the background of one scene! Texas doesn't have mountains. I guess that happens when a movie that is supposed to be in Texas is filmed in Canada. The accents are also really bad. They should have gotten actors from Texas to play the parts. There a lot of aspiring actors from Texas out in Hollywood. The movie is really sad though, because it is a true story. I pray that the killer is found and convicted. The one good thing is that bc of her death, we now have the Amber Alert to help find missing children quickly after they are abducted.", "label": "negative"}, {"sentence1": "I have seen my fair share of comedy and standup movies but this one is so original, so fresh, it will make you wonder why you always walked right pass it in the video store. Murphy has some pretty raunchy jokes but this is just too funny to pass. If only every movie could be this funny. it should be called \"107 minutes of the most incredible comedy\" Murphy is a comic genius in this film and will make you say \"this is the guy that did dr. doulittle!\" He talkes about the ice cream man, shoe throwing mothers, his aunt with a mustache, racism, and everything else you could possibly think of and the ones you couldnt. Please if you ever see one comedy in your life this is it, if only all movies could be Delirious.", "label": "positive"}, {"sentence1": "He pulled the guys guts out his butt! That's a spoof right?! No one really writes that it just happens like improv gone horribly wrong. I think any way. This movie must be a spoof because who would say they wrote that script otherwise. Can anyone imagine the entire cast sitting around as the director and writers go over the storyboard.<br /><br />Director says, \"next our inbreed villain uses his 24 inch machete to disembowel our token creepy neighbor. Get this, he is going to pull the guts out his bunghole\"<br /><br />\"Brilliant!\" the entire cast proclaims.<br /><br />No way can that happen, nobody writes that stupid! Gotta be a spoof.<br /><br />I loved the part where the skinny introspective gal beats the inbreed freak to death with the cast iron skillet she finds on the floor of the cave. I wasn't sure the inbreed cannibal types bothered to cook much. Maybe that explains why the skillet was lying on the floor in the dark at just the right time to kill the malformed hulk. Seems ironic that after the freaky guy had bested martial arts expert porn queens and a couple out doors type jocks he falls so easily to the frying pan of a skinny defenseless girl next door. <br /><br />What the heck is that Richard Greco guy doing in this? Did he fire his agent or something? <br /><br />Can anyone explain the ending to me please because I didn't get it either? I can't quite figure why the nice hero girl wanted to kill the funny lady who was making her some tea. Never mind I don't want to know.", "label": "negative"}, {"sentence1": "STAR RATING: ***** Unmissable **** Very Good *** Okay ** You Could Go Out For A Meal Instead * Avoid At All Costs <br /><br />Stuck-up career bitch Kate (Franka Potente) heads to the London underground to catch a train to take her to meet George Clooney. However, after a hectic working day, she dozes off and awakens to find herself alone in a deserted platform. As she races off on a situation taking her from one daunting encounter to the next, however, she learns of something far more malign and evil waiting for her out there.<br /><br />In a lot of ways, the British Film Industry is really becoming one on it's own, especially in the horror thriller department, with films such as Creep and the successful 28 Days Later (which this has strong echoes of in parts.) In terms of succeeding in what it set out to do, Creep does cleverly create (especially at the beginning) a scary sense of isolation and tense fear. At it's clever running time, it also (though inadvertently, I suspect) manages to pay homage to some of those pioneer high-concept horror films from the 70s that rely on shocks and fear through-out without really focusing too much on character development and such.<br /><br />Of it's weaknesses, some scenes are a little predictable, but these don't really succeed in making it less scary or effective in any way. I'm not sure if the ending was meant to make it come off as some sort of morality play and it's not exactly perfect, but it's certainly very effective and serves it's basic function very well. ***", "label": "positive"}, {"sentence1": "I approach films about talking animals with care. For every wonderful one like Babe, you get an equally poor one like the dreadful remake of Homeward Bound: The Incredible Journey. Or in the case of Cats & Dogs, you have a great idea for a film not living up to its potential. When I heard about Paulie, the premise of a wisecracking parrot didn't exactly fill me with confidence. But I found the film a pleasant surprise. And it manages to sneak its way into your heart without you realising.<br /><br />A Russian janitor, Misha Vilyenkov (Tony Shaloub) gets a job in a research laboratory. One day, he hears singing coming from the basement. And when he investigates, he finds a parrot in its cage singing its little heart out. Misha becomes fascinated with the bird, especially when it turns out the parrot can not only sing, it can talk. And not a few phrases either. Its a parrot you can actually make conversation with.<br /><br />The parrot is called Paulie (voiced by Jay Mohr), and recognises a fellow castaway in Misha. Wondering how this world to the wise bird ended up in a dusty basement, Misha convinces Paulie to tell him his life story. Which all began when he was a baby, and in the care of Marie, a five year old girl with a stutter. The two of them became birds of a feather (OK, bad pun!).<br /><br />When Marie's parents became concerned about her close friendship with a bird, they considered sending him away. And they finally did after Marie nearly injured herself in a fall after teaching Paulie to fly. Desperate to be reunited with her, Paulie begins a long journey across America, which includes a diverse number of new owners, flying great distances, and even ending up behind bars. Of a cage that is!<br /><br />Paulie was one of a number of talking animal films released by DreamWorks in the late 90s. And although it wasn't afforded the same recognition or box-office success of Babe, Paulie succeeds on quite a few levels, and is an occasional work of striking intelligence.<br /><br />Jay Mohr's stand-up style of acting is well suited to the part of Paulie. He never plays the part as too smug, even if he is a bit of a smart Aleck. Paulie's worldly, but he is also naive in his way.<br /><br />Because he's lived a rather sheltered life with Marie, when he's taken away, he has to fend for himself for the first time. And when he falls into the hands of different owners, they make promises to Paulie to reunite him with Marie, which he believes. Only for those promises to be broken time and again.<br /><br />Paulie is admittedly a little episodic. It follows the eclectic people Paulie ends up with, and how he slowly gets brought closer and closer to Marie. He first winds up in a pawn shop, where he is adopted by Ivy (Gena Rowlands), a kindly woman who teaches him the meaning of manners. She sympathises with Paulie's situation, and drives an RV across America to find Marie.<br /><br />Paulie is an occasionally very touching film. His scenes with Ivy are some of the best. Wonderful moments of Paulie perched on her shoulder singing Tom Jones numbers. The way she instills in him the need for hope is great, and some of the dialogue is quite well written and even thought-provoking: <br /><br />\"There are things in life you put off, because you think you're gonna do them later. But the real thing Ivy taught me is you gotta live like there may not be a later.\"<br /><br />The scene where Ivy passes away en route leaving Paulie all alone is a very heart-rending moment. And the sequence where he plucks up the courage to fly for the first time across the Grand Canyon, soaring majestically is such a beautifully composed scene it stays with you for hours after the film's over.<br /><br />Despite the occasional sad moment, there are plenty of laughs to be had. Paulie falls in with a group of performing parrots at a Spanish outdoor restaurant. The animatronic effects here are really excellent as four birds do a perfectly choreographed dance number. And Paulie even gets to have a romance. Which is dashed when he falls in with a petty thief (played by Mohr as well). That may be the only complaint I have. As soon as you get comfortable with one situation, the film then moves Paulie on to another.<br /><br />The scene where Paulie is taught to steal money from ATM machines is funny, but a little disturbing too. I'm amazed DreamWorks were granted the chance to include such a scene in a kids film. And Paulie's diamond robbery is very Mission Impossible. He's caught in the act, and shipped off to the lab for animal testing, where he's remained ever since.<br /><br />The story finally comes full circle at the lab, where Misha vows to help Paulie. Of course they do find Marie. But the final revelation is a scene of such shocking intensity, I was left numb for several minutes. Paulie may never get the longevity Babe has, but I believe its an equally brilliant film. The same laughs. The same flawless effects. And the same surprising intelligence.<br /><br />A minor gem.", "label": "positive"}, {"sentence1": "It used to be my thinking that movies required plots, or some other means of making you care at all about the story line or anything that is going on. This movie has showed me that you don't actually have to have anything like that.<br /><br />I could sum it up simply as that. But, IMDb wants me to have more lines. It was kind of pretty. not compelling in the slightest. The way the characters talk in the movie makes you think it should have taken place over a matter of days, but there is no passage of time and i'm pretty sure it all happens in an hour.<br /><br />If you are looking to entertain yourself, then buy a gallon of milk and see how fast you can drink it before throwing up. It would be a far better use of your time. Time that you will never get back. Jurassic Park 3 was pulled off better than this movie.", "label": "negative"}, {"sentence1": "I had high expectations of this movie (the title, translated, is \"How We Get Rid of the Others\"). After all, the concept is great: a near future in which the ruling elite has taken the consequence of the right-wing government's constant verbal and legislative persecution of so-called freeloaders and the left wing in general, and decided to just kill off everyone who cannot prove that they're contributing something to the establishment (the establishment being called \"the common good\", but actually meaning the interests of the ruling capitalist ideology).<br /><br />Very cool idea! Ideal for biting satire! Only, this movie completely blows its chance. The satire comes out only in a few scenes and performances of absurdity, but this satire is not sustained; it is neither sharp nor witty. And for an alleged comedy, the movie has nearly no funny scenes. The comedy, I assume, is supposed to be in the absurdity of the situations, but the situations are largely uncomfortable and over-serious, rather than evoking either laughter or thought.<br /><br />The script is rife with grave errors in disposition. The action should have focused on the political aspects and how wrong it would be to do such a thing, but instead oodles of time are spent on a young woman who was the one that wrote the new laws for fun, and who's trying to save everybody, by organizing a resistance that ships people to Africa. All this is beside the point! A movie like this should not pretend to be so serious! It's a satire! A political statement. But it doesn't even begin to actually address the problem it's supposed to be about. Maybe it was afraid of going too far? How cowardly. That's not art. It's not even real satire.<br /><br />Søren Pilmark, a very serious and by now one of Denmark's absolutely senior actors, was very good. He largely carried what little entertainment value the movie had. Everybody else: nothing special (well, perhaps except for Lene Poulsen, who did supply a convincing performance).<br /><br />In fact, a problem with most Danish movies is that the language never sounds natural. Neither the formulation nor the delivery. Why is it so difficult to make it sound right? Why must it be so stilted and artificial? I hope, when people look at these movies fifty years from now, they don't think that this was how people talked in general Danish society.<br /><br />3 out of 10.", "label": "negative"}, {"sentence1": "I f you thought Sam Mendes' first film, the much heralded American BEAUTY was a movie with style to spare, wait until you see his highly anticipated second effort, the unrelentingly grim 30's gangster melodrama ROAD TO PERDITION. Some critics have hailed this new movie as a worthy successor to THE GODFATHER, a rash judgment made by several reviewers taken with Mr. Mendes' extraordinary technical prowess. If the mechanics of movie making are what make a picture great, then yes, ROAD TO PERDITION is a distant cousin to THE GODFATHER in terms of what it achieves in cinematography, editing, music scoring and sound. What it doesn't have is a resonance that all great stories and some very rare movies have that stay with the viewer long after the experience of reading or seeing it is over. As with American BEAUTY, there is a cold, distancing feel to this movie, despite some very tense scenes involving paternal love, loyalty and betrayal.<br /><br />This story of a hit man (Tom Hanks) and his relationship to a surrogate father - figure who is also his boss, an elderly Irish mob leader (Paul Newman) , seems to have been culled from innumerable gangster movies of years past. The father /son motif that hangs over this picture is so heavy handed in its treatment that there is not much room for spontaneity ; the entire enterprise has been very carefully wrought , and nearly all the dialog is delivered with an air of great portent : this is obviously a gangster film , hence the requisite amount of violence and bloodshed , but the film is nearly devoid of any humor to speak of ; only in scenes involving a young boy driving a getaway car in a cunningly edited montage is there any sense of lightheartedness to leaven the pervasive sense of doom.<br /><br />That being said , I have nothing but the highest praise for the stunning look of this film ; indeed , it is not an overstatement to say that this is one of the most beautifully photographed and designed movies I have ever seen. Veteran cameraman Conrad Hall will very likely win another Oscar for his work here . The production 's sets and costumes are just as exemplary ; in fact , the entire film is a technical marvel. Mr. Mendes continues to astonish with his vivid use of color, and he and Mr. Hall again make very dramatic use of red blood splattered against pale colored walls , all the more effective and disconcerting due to the preponderance of blacks, blues and grays that dominate the movie's color scheme.<br /><br />If I have failed to duly note the acting , it is not because the actors do not purport themselves ably ; everyone in the film is top notch, with special mention going to the two malevolent bad guys : Daniel Craig is the classic \"man you love to hate\", the spoiled, impulsive son of Newman's gangster father ; and an almost unrecognizable Jude Law as an especially slimy miscreant who goes on pursuit of Hanks and his son and figures very importantly in the film's riveting second half. But acting in a movie this dazzling is bound to take a back seat to the photographic fireworks on display here. If a Rolls-Royce was a movie , I've no doubt it would look like ROAD TO PERDITION.", "label": "positive"}, {"sentence1": "As an adult I really did enjoy this one. I watched it with my 2 granddaughters and the 3 1/2 year old was fascinated and the 15 month old giggled at the mice.<br /><br />The music is fun and the animation is wonderful. This sequel does what Return to Neverland didn't accomplish. A good follow-up to the Cinderella story; but what becomes of Drusilla? Another sequel? I hope so!", "label": "positive"}, {"sentence1": "Not funny - how can anyone link this to Monty Python? That is absolutely ridiculous - there are no laughs. This is not funny. Over the top, but ugly, weird just for weird sake and it seems to me these people were on something all the time. Unfortunately something that did not make them funny.<br /><br />It should be given some points for effort etc. whatever. Actually it appears there is a laugh track - or is there one? Hummm.... Since there are barely any laughs that's a debatable question.<br /><br />Maybe I'm doing it injustice - maybe it's some sort of exercise. Some sort of art - in that case anything goes, never mind.<br /><br />But these guys playing women with high-pitched voices, turned-up noses. Come on !!! Not funny. <br /><br />There is only one heir apparent to Monty Pythons intellectual wit and that is Stephen Colbert, and maybe Jon Stewart.", "label": "negative"}, {"sentence1": "Honestly, I went to see the movie, not because of the actors, not because of the plot but because it was rated 17 here in Luxembourg and a movie has to be really brutal or pornographic to be put in this category. Believe me, being a movie-freak, I have seen quite a lot of brutal films in my lifetime (Ichi the killer, Irreversible, Hellraiser) but this movie was by far the most disturbing and brutal picture I have ever seen. <br /><br />The plot is plain stupid, the directing is awful, acting was mediocre even the music was a cheap copy of so-called \"Horror Soundtracks\". There isn't a single intelligent aspect in the whole movie, and some of the scenes are really hard to stand. (especially the scene, where you see the embryos in the glasses and hear the baby cries--horrible). I can't understand why the movie was rated 16 in Germany, where normally the criteria are real tough (e.g. kill-bill (brutal but it made fun of itself and had great allusions to Asian cinema and besides a magnificent directing) even a movie like state of grace is rated 18). No one can call this a Horror movie, because actually it was more about showing gore than about scaring the public (Showing the \"Creep's\" face in the middle of the movie was a very bad decision); for me (excuse my expression) it is just one insane director living out his disturbing fantasies. In some scenes you see violence, that has absolutely nothing to do with the plot nor does it explain anything. The plot has holes and flaws, the dialog is boring, honestly I can't mention a single positive aspect of the movie except for the British and Scottish accent.<br /><br />If I had something to say, I would ban this movie from the theaters, I fully understand why none of the big production companies invested their money in this crap.<br /><br />I'm looking forward to getting feedbacks to my thread and I'd be happy to discuss about one or the other topic.<br /><br />\"Livin' the dream baby, livin' the dream\" David Aames", "label": "negative"}]