[{"sentence1": "Steve Biko was a black activist who tried to resist the white minority governed South Africa in much the same way as Gandhi tried to resist the British empire's colonialism in India. Richard Attenborough's film Cry Freedom is not about Biko or Apartheid as much as it is about Donald Woods, the white liberal newspaper editor who risked his life trying to tell Biko's story. The film has a jarring point of view switch after Biko dies in prison from tortuous behavior at the hands of South African \"police\". Woods, played by Kevin Kline, must choose whether to do the right thing and flee the country to publish books about Biko or allow his wife, played by Penelope Wilton, to pressure him into forgetting about the books. In that case, Biko dies in vain. What begins as a life-changing friendship between Biko and Woods degenerates into a standard by the numbers escape over the border yarn after Biko's death. Oscar-nominated Denzel Washington is good in only his fourth film as Biko, but something is wrong in a film that tries to depict the struggles of Apartheid by focusing more on the trials of a white family for more than half the film. Attenborough would have served his topic better by focusing on Biko's rise to prominence instead of beginning where Biko befriended Woods. Perhaps a black actor in a leading role in a 2 1/2 hour film wasn't exactly conducive to big box office, but the film was a tremendous box office flop anyway. Film politics aside, the film still entertains and sends a message or two, albeit, in PG-sanitized fashion. *** of 4 stars.", "label": "positive"}, {"sentence1": "A little girl's dead body is found stripped of all possible means of identification. When it is discovered that one leg is longer than the other, it is assumed to be the body of a couple's missing daughter. After this trauma, the couple separates and the mother becomes addicted to tranquilizers and leads a miserable existence. All of this changes when one day, many years later, she receives a phone call from her daughter! With the help of an ex-cop and a reporter, she sets out on a journey to determine if her daughter is indeed alive. \"Los Sin Nombre\" is a mess plot-wise, moves at an achingly slow pace, and is completely unscary. The saving grace is Emma Vilarasau, who does an outstanding job as the desperate mother. The best part of the movie is the ending, but I'm not sure it is worth enduring the rest of the film. Beware of the English subtitles on the recent R1 release--they aren't very accurate.", "label": "negative"}, {"sentence1": "Well, maybe the PC version of this game was impressive. Maybe. I just finished playing the PS2 version and it's pretty much a complete mess.<br /><br />There are a couple elements that are okay or promising. I'll mention those first because it will be over quickly. First, the idea of a historical GTA-like game is a great one. The game Gun was a historical GTA-like game and unlike Mafia, Gun was excellent. I'd love to see a game set during Mafia's era done right. Next, the storyline is well written. The story makes sense, it has dramatic arcs, it uses an unusual device (with much of the game being a backstory) and it's interesting. Finally, some of the graphics--especially those used during cutscenes--are impressive. Mafia's designers seemed to focus on getting the graphics right in the places where GTA skimped on that effort, especially the characters. Unfortunately in many other areas, the graphics kinda stink, and I'd much rather have excellent gameplay than impressive-looking characters.<br /><br />The gameplay is what sinks this title so low. First off, the controls and camera absolutely suck. That has to be the first focus of any game developers. You can't release a game where the controls and/or camera suck. Number one, there's no reason that the player's character, Tom, can't have his full range of motion controlled by the left analog stick. Unless it's absolutely necessary, and it hardly ever is, I hate the set-up where the left stick moves the character in a \"strafing\" way and the character can only turn using the right analog stick. Here, it's not only unnecessary, it makes most of the simplest actions a challenge. For example, Tom has to climb on a couple missions. But the game is designed so poorly that you have to frustratingly keep manipulating both the right analog stick and the camera, and then press L1 every time you need to climb, or Tom will descend instead.<br /><br />Next, I've never seen a worse fighting system. The first problem is that you can't auto-aim or lock on to any targets. At one early point, the game seems to tell you that you can use L2 or R2 to lock on to targets, but that never worked. So to focus on any enemy, you have to struggle with the stupid right analog stick and try to keep adjusting both the character's orientation and the camera, which tends to drift to the wrong angle or make Tom disappear all the time. By that time, you're probably getting pummeled or shot to death.<br /><br />Next, if you're touching or almost touching an enemy--and that's certainly going to be the case for hand to hand combat or when using melee weapons, the fighting system--which primarily consists of tapping or holding R1, is completely useless. Enemies can pummel you almost in a bear hug, but you just can't move unless you back off. So close fighting tends to consist of you yanking on the left analog stick, yelling at the character to move away, which it won't do 50% of the time, then tapping R1 as much as you can before the enemy gets too close again and makes R1 useless. And if the enemy changes their angle to you in the meantime, you're also going to struggle with the right analog stick to get your character oriented in the right way and to get the camera in position so you can see anything. By that time, you're probably getting pummeled or shot again, and your only option will be to try to move the character away again. My fights often consisted of making Tom run circles around an area like a comedy film, hoping that I could gain enough time to struggle with the analog stick and get a couple shots in before being at the AI's mercy again. So much for realistic fighting.<br /><br />And the same problems and more exist when trying to fight with guns. If you're touching someone, half the time the controller just won't allow you to fire off a shot, yet they can still riddle you full of holes. Additionally, there's no auto-aim, and the aiming system is ridiculously sensitive, even with the sensitivity set to zero under Options. Gunfights tend to consist of you hopelessly trying to aim or move away while the enemy puts shot after shot into you. Luckily or not, damage seems to be recorded almost randomly. It can take one to ten shots or more to incapacitate any character, and there's no rhyme or reason to it. You can put five shots into an enemy's head and near point blank range and they'll still return fire and hurt you. Yet, the game designers seemed to care enough about realism than they built a recoil into your aiming system, so after shots with powerful enough guns, your aim will float off target, and you'll have to fight with it again.<br /><br />As for the celebrated graphics, except for the characters and textures that you're close to, they're actually pretty disappointing. The distance always seems mostly empty, and there are often expanses of flat colors and textures nearby when you're driving. The city wasn't very well designed. It's not varied enough, and there aren't many interesting things to see or do. The cars seem slow and they're difficult to control. They also all drive about the same. Some have mentioned the music, but that was also pretty nondescript. A much better job could have been done on that end. Also, as many others have mentioned, the load times are ridiculous and constant. They tend to be over a minute long, and they occur between and in the middle of everything--even races.<br /><br />Overall, the Mafia port to PS2, at least, seems to have been very rushed. The game feels and plays like an incomplete hack job.", "label": "negative"}, {"sentence1": "Mindless dribble about the second coming of Christ in the form of a hippie and albino looking Sandra Locke. You have no idea what's happening on the screen with the irritating theme song \"Suzanne\" being played over and over throughout the movie until when \"The Second Coming of Suzanne\" is over you already know it by hard no matter how hard you try to forget the whole thing.<br /><br />This off-the-wall armature movie maker Logan,Jared Martin, is out to make the movie of the century but is so rude and obnoxious that none in the banking world is willing to finance his project. Planning to go on his own Logan then spots this couple at a seaside café and is fascinated with the young woman Suzanne, Sandra Locke, who reminds him of someone he knew in another life: Jesus Christ.<br /><br />With Logan's assistant and all around gofer Clavius, Richard Dreyfuss,somehow getting a $740,000.00 loan from the bank to finance Logan's masterpiece he starts to work on Suzanne by flattering her about her talent as an actress in order to get her interested to be in his film. This leads to Suzanne not only leaving her boyfriend artist Simon, Paul Sand, but later Simon being so depressed and feeling all alone takes a gun to his mouth and blows his brains out.<br /><br />The movie also has two somewhat unrelated sub-plots in it that has to do with a young autistic girl Dorothy, Kari Avalos, who's cured of her autism by Suzanne after everyone else, at the psychiatric hospital that she was committed to,failed. It's not really known what exactly Suzanne was doing at the hospital but she seemed to be some kind of orderly or volunteer there; was this supposed to show us in the audience that she, like Jesus, could miraculously heal the sick?<br /><br />There's also this newspaper columnist and big time businessman tycoon Jackson Sinclair, Gene Barry, who seems to be either going through a very difficult mid-life crisis or has seen a biblical-like vision that changed his life forever. Sinclair had been searching for the meaning of life as well as what it's all about all through the movie and wanted to know why there's all this suffering in the world, like this movie that he's in, and seemed to have found the answer when he first laid his eyes on Suzanne. Sinclair also got some sense knocked into his head when his private chauffeur David, Mark Rasmusser, who's gotten sick and tired of his weird and crazy hallucinations almost running him off a cliff in a kamikaze like drive along the Pacific Coast.<br /><br />The movie \"The Second Coming of Suzanne\" goes on with a number of unrelated sequences, probably to fill or pad in some time by it's director and film editor, and then goes to it's final scene in a Christ-like crucification on a hill as Logan has all the cameras rolling. It turns out that the crazed Logan got so carried away with his masterpiece as he tried to replicate, on the helpless and tied up Suzanne, the actual crucification of Jesus Christ some 2,000 years ago.<br /><br />Hard to sit through and almost impossible to follow \"The Second Coming of Suzanne\" puts you through the same kind torture that Suzanne is put through by Logan and the makers of the film. The movie tries to be arty but that's just an excuse to cover up it's brainless and non-existent storyline and even worse the terrible and amateurish acting by everyone in it.", "label": "negative"}, {"sentence1": "The above seemed a much more appropriate title when me and my suicidal underlings decided to watch this masterpiece of modern bullshit <br /><br />Erotic,Scary, Suspenseful, Well thought out, these are all the things this film fails to be.<br /><br />It is however incredibly funny, the slow sound effects and bad dubbing add to this to make one of the greatest comedies I have seen in recent years. And yet this film doesn't even try to be funny and that is one of the movies grand achievements, it becomes a comedy without even attempting to amuse.<br /><br />Throughout the film an old guy who looks amazingly like Santa Claus goes around ploughing over zombies and smashing vampires into the ground. This made me fail to believe the films title, if this was vampires vs zombies why were the vampires and zombies not fighting? Oh well whatever, besides there were more flaws to this rental than the title. Such as this one; there has been a virus sweeping through America creating zombie like beings who go around acting a lot like your average tourist. And yet there's only four zombies in the entire film. Another problem is besides one shop everywhere is deserted. Surely you'd see zombies roaming about in the woods or in the background a bit. In fact I believe they just drove around in a circle of forest over and over again since they didn't have a high enough budget to film in a wider location, that or the director didn't want to waste his precious time filming in different areas of wood he was to busy sitting in a trailer jerking off to be bothered with such trivial matters.<br /><br />In fact the director had so much fun doing this that he didn't have enough time to hire a big enough cast or even an editor. And so he told the eight members of the cast to dress up as different people and try not to act inconspicuous, whilst I assume he changed his name and began randomly snipping at the film reels \"editing isn't a hard job anyway right?\" The only reason this \"movie\" found it's way into our bag was because somehow we got it confused with Freddy vs Jason, strange how these things happen isn't it. And the only way we made it though the night was by strapping gas masks on and bolting them to our skulls to avoid the stink of this nauseating mess.<br /><br />Oh yes we did laugh at the end, but I'm sure one does that a lot when he has lost his sanity...................", "label": "negative"}, {"sentence1": "Dear Readers,<br /><br />With High Expectations, Human Beings leave Earth to begin a new life in Space Colonies. However, The Allied Forces of the United Earth Sphere Alliance gain great military control over the colonies and soon seize one colony after another in the name of Justice and Peace...<br /><br />The year is After Colony 195. Operation Meteor. In a move to counter the Alliance's tyranny, Rebel Forces from several colonies send new arsenals to Earth disguised as Shooting Stars...<br /><br />However...The Alliance forces catch on...<br /><br />Gundam Wing is the most popular and most successful of the entire Gundam Series. With cutting-edge Anime animation, stunning action, amazing Mobile Suits, Breathtaking scripts, and some of the most unforgettable characters in Anime History.<br /><br />I'll try to explain the plot of Gundam Wing as best as possible. Earth has now colonized space, but the UESA forces have forcibly occupied them along with the help of the mysterious Elite Force OZ and their shadowy leaders, Treize Kushrenada and the Romefeller Foundation. Five pilots are sent to Earth piloting Mobile Suits with extraordinary power known as the Gundams. Pursued by the Mysterious Lieutenant Zechs Merquise, Treize's second-in-command, a young teenager named Relena, and the Alliance military, the Gundam pilots unleash hell upon Earth for the Freedom of the Colonies while all the while, a plot most sinister architected by Treize begins to start.<br /><br />Signed, The Constant DVD Collector", "label": "positive"}, {"sentence1": "Level One, Horror.<br /><br />When I saw this film for the first time at 10, I knew it would give me nightmares. It did. Surprisingly, as I recall, it was the sound as much as the sight of the monster that caused them.<br /><br />Level Two, Psychoanalytic Theory.<br /><br />Later as an adult, I saw the story for what it was: What if the savage, unrestrained instincts we all repress became manifest.<br /><br />Level Three, Pure Science Fiction.<br /><br />The best way plausibly to realize the plot's \"What if\" is through the science fiction genre. This is pure science fiction, not the \"cowboys in space\" that passes for the genre today.<br /><br />After 43 years, Forbidden Planet remains the greatest of all science fiction films. If planning a remake, SKG or Lucas, Watch Out!", "label": "positive"}, {"sentence1": "While I can't deny that his movies are often entertaining, I have always personally felt that Martin Scorsese is just a little overrated in his abilities. His use of flashy stylistics in a good number of his movies seems to scream \"Look at me, aren't I an imaginative director?\". His best film that I have seen is the one with the least added flourishes, the superlative \"Raging Bull\".<br /><br />For this remake it appears it was business as usual, though. The dull film stock to convey a 1950's setting was so bland as to be a distraction in itself. The melodramatic close-ups combined with the sub-par imitation of the classic \"Psycho\" score are more likely to provoke smirks of derision than a sense of atmospheric terror. The score for \"Psycho\" was brilliantly unnerving, this 'homage' just sounds shrill and annoying. Even the cast, who can be decent at times, deliver histrionic performances that just scream 'caricature'; the notable exception to this being an intelligent turn by Lewis as the impressionable teenage daughter of the Bowden family.<br /><br />The worst acting offender here is surprisingly De Niro. Sure, he looks suitably menacing but as soon as he opens his mouth that aura just drains away. Now I'm no expert on American accents, me originally coming from near Manchester in England an' all, but surely he could've come up with a more convincing Southern drawl than that? Being the gifted physical actor he is, he almost overcomes this fatal flaw, but not quite. It was disconcerting for me, as a De Niro fan, to be wishing he was off screen, rather than rapt at his performance.<br /><br />(POSSIBLE SPOILERS.)<br /><br />The over-the-top style of the whole movie extends to the ridiculously overblown finale. When will Scorsese learn that underplaying the situation can sometimes build tension just as effectively as giving the viewer a visual and sonic bombardment? I also thought that he was too respected a reputation to resort to the 'killer-not-dead-yet' cheap trick that less talented individuals might employ.<br /><br />All in all, a thoroughly ridiculous 'thriller'. Scorsese and De Niro have done MUCH better work together.", "label": "negative"}, {"sentence1": "Wow, I can't believe people consider this a 'good' movie. Now, I have seen much worse, but there are much more romantic/funny comedies with John Cusack.<br /><br />This is a mediocre film at best. While the acting wasn't terrible, but not great, for a romantic comedy, there was little passion, little romance. There were many loose ends that don't show up or are not addressed. Unfortunately, the main characters do come off as complete cowards. They don't know themselves well enough to realize that they don't love the people they are engaged to. How do we know they aren't in love? By the utter lack of remorse both characters have for leaving their finances. I can think of few things more romantic than the continual escape from commitment that these two show.<br /><br />The movie doesn't even end with a wedding scene, more than likely both will get cold feet and drop each other like hot potatoes once a commitment is nearing. This movie is really about two people who can't commit to anything, unlike Cusack's previous characters, who were more than willing to make a deep commitment (Loyd in Say Anything, Martin in Grosse Pointe Blank, etc.).<br /><br />The greatest failure of this movie was the complete lack of any twists turns, or anything of interest. When the movie ended, I felt like they had failed to include a climax to the story, which basically fits the whole movie: boring. No suspense about whether the two will end up together, no joy when they do, no consequences to their actions.<br /><br />It is sad that people are so blind to the shoddiness of this movie, that they simply rebuke any criticism with 'Everyone is too Cynical!'. Criticism of this movie is not cynicism, simply unbiased examination. There are many other better romantic comedies, even ones with Grace Kelly, or Eva Marie Saint.<br /><br />If you think this movie is great, try these movies, you hearts will explode: The Princess Bride, Say Anything, Grosse Pointe Blank, High Fidelity, Keeping the Faith, Charade, Rear Window, North by Northwest, or There's Something About Mary (which is a good examination of idealized romance vs. today's society).", "label": "negative"}, {"sentence1": "What surprised me most about this film was the sheer audience it attracted. Similar films such as Anita and Me have never caused as much hype as this film has, though I think that's probably because of the mention of 'Beckham' in the title more than anything else.<br /><br />It's a brilliant film putting across a brilliant message - you can do anything if you're determined enough, and put your mind to it, which is such a positive message to anyone watching this film.<br /><br />I think this is one of Keira Knightley's better films, and I think she's a brilliant actress, and was excellent for the role. Parminder Nagra was brilliant too. Sadly, I can't say this for Jonathan Rhys-Meyers, because I don't think that he was that much of a good actor, and to be honest, his eyes were a little scary.<br /><br />All in all, a brilliant film, and a brilliant story", "label": "positive"}, {"sentence1": "When this play was first shown by the BBC over 30 years ago, it would have been something quite different for the time. So therefor some people would have found it quite scary, and may well have been impressed with the special effects?<br /><br />Looking at the play in this day and age, It doesn't seem to be all that scary anymore, even the special effects can leave a lot to be desired.<br /><br />Would a train really be allowed to pass a RED LIGHT into a dark tunnel? I don't think so......but if you watch this play again, you will observe that the first train that enters the tunnel, rushes straight through the RED LIGHT! (maybe that's how it was in dickens time)?<br /><br />You will also notice that the footpath that leads down to the Signal Box is very steep and in a poor state. Surely there would have been a series of proper steps with handrails for the Signalman to climb up or down into the cutting. (i can't help but notice things like that)<br /><br />I will not take anything away from the acting, both Denholm Elliott (signalman) and Bernard Lloyd (the traveller) gave wonderful performances.<br /><br />I am not at all sure what is going on......I mean was the ghost the traveller, or what??? Does anyone really fully understand this rather confusing story??? (well maybe i am the only one that don't)???<br /><br />To sum up.....<br /><br />The play has a wonderful atmosphere throughout, with great character. It suffers from not being that scary these days, and a little if not very confusing in places, and has some rather unusual signalling practises....<br /><br />Thanks for reading my review.", "label": "negative"}, {"sentence1": "Having just finished Cronicles of the Heroic Knight mere minutes ago I find myself extremely please but questions still loom over me. While it would appear that the first 7 episodes or so are actually a retelling of the events of the first Record of Lodoss War the truth is that they really aren't. It would appear that the creator of CotHK had a different vision as to how the original ended (and that may be the reason that the first 7 episodes occur) but I do not find that to be the case. CotHK does say it starts 5 years after the War of Heros which Parn was a part of. I think the director made the first 5 episodes seem so much like a recap of the original just to give the viewer a small reminder and an introduction to characters and their deeds done because they appear much less after the series kicks into Spark's story. Now, once the series does kick into Spark's portion we find ourselves kicked up another 10 years (15 years now since the War of Heros). Spark and his crew do, in some cases, resemble Parn and his crew once the journey kicks into gear, especially the love story that brews between Spark and Neese. I also thought several times throughout CotHK that I threw in the original series and if it wasn't for Spark's long blue hair I know I would've pressed stop more than once to make sure the right disc was in. By no means do I consider these major set backs however, the writers did a fine job in crafting believable characters and a remarkable storyline. The only thing that makes me hurt is that Ashram and Wagnard return. Ummmm... how??? Don't get me wrong both are great villains even though Ashram's only villainous trait is that he supports the Marmo. Perhaps I missed something during the coarse of the series that explained that part. As far as sequels go though, I highly recommend CotHK. I place both CotHK and, even more so, the original Record of Lodoss War far above the Lord of the Rings trilogy. Both of these are more epic than anything I've ever seen or read. I highly recommend this.", "label": "positive"}, {"sentence1": "This film is a joke and Quinton should be ashamed of himself, trying to pass this off as a Modesty Blaise Film. If you are having trouble sleeping then all means rent this film. The stick figure they call a actress who is suppose to be Modesty Blaise has got to be the most boring person on this planet. Maybe she could be used as a hat stand in the back ground of a real film.seventy-five minutes of nothing thank you who ever invented the fast forward button. If you see this film if you can call it that coming your way RUN. I can't help but think what 3rd world country could of used the money wasted of this crap. this film is boring the actors are boring waste of colour a waste air they breath If you would like to see Mostey Blaise Film then watch the one they made in the 60's maybe that what the director should of done.", "label": "negative"}, {"sentence1": "WWE was in need of a saviour as Wrestlemania 14 rolled around. The departure of Bret Hart and subsequent evaporation of the Hart Foundation had left the Vile D-Generation X stable unchallenged in the WWE. Their despicable leader Shawn Michaels had stolen the title from Hart thanks to the interference of Vince McMahon and, with help from his cohorts Triple H and Chyna had systematically taken out anyone who challenged his supremacy. But at the Royal Rumble a new contender had emerged. Stone Cold Steve Austin. Hated by McMahonagement, Austin had DX worried. So worried in fact that they'd enlisted the help of \"The Baddest Man on the Planet\" Mike Tyson as a special enforcer. Austin would have the odds firmly against him in his title match with Shawn Michaels.<br /><br />But first, there was an undercard to get through which kicked off with the Legion of Doom winning a forgettable 15 team battle Royal to become NO.1 contenders for the tag titles. I'd actually forgotten this match existed until I rewatched the PPV. No very good and really highlighted the lack of depth in the tag division at that period in time.<br /><br />Next match saw the Light Heavyweight title defended by Champion Taka Michonoku against Aguila. The WWE had established the Light Heavyweight Title to compete with the strong Cruiserweight Division in WCW. It was not successful and this was the only time the title was ever defended at Wrestlemania. Short match, going about five minutes, and in fact too short for much to be achieved. What little they did was exciting and this was a nice little match which saw Taka retaining his title.<br /><br />OK, our next match saw DX member Triple H defending the WWE European title, which he'd won in farcical fashion from Shawn Michaels on RAW in December and hadn't defended on PPV, against Owen Hart, the Sole Survivor. Triple H got a big entrance with the DX band there to perform his theme song. Chyna accompanied Triple H to ringside, but was then handcuffed to WWE Commissioner Sgt Slaughter. Triple H and Owen have a nice little match, before Chyna interfered causing a low blow on Hart which leads to Triple H retaining the title. Good match, could have been great had it gone slightly longer.<br /><br />But of course we wouldn't want to take time away from our next match which saw real life husband and wife Marc Mero and Sable defeat Goldust and Luna Vachon in the first mixed tag match at Wrestlemania in 8 years. And, in all honesty, it wasn't worth the wait. While not terrible, the match was in no way memorable either. This was the nearing the end of Mero's only run in the WWE and the main purpose was to continue the disintegration of his relationship with Sable.<br /><br />Next up we saw Ken Shamrock flip out and cost himself the Intercontinental Championship as he destroyed IC Champion The Rock, but then refused to let go of his ankle lock submission hold, resulting in the referee reversing his decision. This was a short match, but decent for what it was.<br /><br />Next saw the first good match of the night as WWE Tag Team Champions the New Age Outlaws lost their titles to Cactus Jack and Chainsaw Charlie in a fun dumpster match. The decision was overturned the following night as Cactus and chainsaw had thrown the Outlaws into a dumpster backstage, rather than the one being used in the match, but this was still a fun match.<br /><br />NOw it was time for the highly anticipated first ever meeting between Kane and his brother the Undertaker. Kane had cost Undertaker the WWE Championship at the Royal Rumble and then \"killed\" him when he helped Shawn Michaels lock Undertaker in a casket and set him on fire as revenge for the Undertaker burning down their parents house and leaving him horribly disfigured years before. This was a decent match and told a nice story as the Underataker absorbed everything Kane could throw at him and then knocked him out with three tombstones to end the match.<br /><br />This left only the main event which saw WWE Champion face Steve Austin with Mike Tyson as the guest enforcer. Michaels had suffered a debilitating back injury in his match with the Undertaker at the Royal Rumble and was remarkable in this match despite his physical limitations. Triple H and Chyna were banished to the back in the early going after interfering from the outside. The match ended with Austin ducking an attempt at Sweet Chin Music and hitting the Stone Cold Stunner with the ref down. TYson then came into the ring to count the three, celebrating the win with Austin and then knocking out Michaels after the match. It turned out Tyson and Austin were together and the cat had been playing with the mouse all along.<br /><br />That was the final PPV match for Shawn Michaels for four and a half years. It helped establish Austin as the biggest star in the wrestling business and the mainstream publicity garnered by Tyson's appearance proved a crucial turning point in the WWE's battle with WCW. Austin would go on to become the biggest star in WWE History, and along with the Rock, Mick Foley, the Undertaker and Triple H lead the WWE through the period where they would gain their highest level of cultural relevance. And it all started here at Wrestlemania 14.", "label": "positive"}, {"sentence1": "A Scanner Darkly, Minority Report, Blade Runner, Sin City and Sky Captain and the World of Tomorrow \u0096 if you are a fan of any of these then this will be well worth checking out.<br /><br />French animation project 'Renaissance' took seven years to make on a shoestring budget and tonight I finally got to see it at a private screening for the International Film Festival in Stockholm. My spontaneous reaction is awe; my further reflection is 'huh, neat' and closer analysis regrettably gets a resounding 'meh'. It is a gorgeous science fiction triumph on the surface, but scratch it or even poke it a little and its unnecessarily complex plot becomes glaringly apparent, as do the flat characters. <br /><br />Nevertheless it is clear that the people at Onyx films have done something spectacular with the aforementioned surface. The visuals are staggering. They have used live action motion capture fitted into key-frame animation, with stark jet black and bright white contrasts and a heavily shadowed rotoscoped background. For those of you who are not down with the 'technical lingo', the film looks like a fully-animated Sin City. Its fluid, transparent, dark and stylized template is complemented by great lurid lightning. It's a vision. Yet much credit is also due to the crisp sound effects that take the form of humming futuristic weapons, suspenseful music, heavy raindrops and glass shards breaking. It's every tech-nerd's wet dream...<br /><br />The film zooms in on an eerily-lit, bleak, futurescape Paris in which a major corporation called 'Avalon' has begun to interweave in the lives of the citizens with surveillance (think the fluid transparent screens from Minority Report) and genetic engineering. The latter leads to a mysterious kidnapping of young researcher Ilona (voiced by the lovely Romola Garai). Cut to our hard-boiled cop-on-suspension and protagonist Karas (Daniel Craig) \u0096 a man who takes the law into his own hands \u0096 who is assigned the case of finding and retrieving Ilona. During this case, he is being aided by Illona's sister with whom he also begins a love affair. A very half-assed love affair, if I may say so.<br /><br />The world of Renaissance is remarkable. Director Christian Volckman takes a fair jab at melting the noir themes and the result is an urban jungle filled with cads, rats, femme fatales and lonely detectives that hide in the shadows of the seedy slum. The problem is that the creators undoubtedly felt the need to have extremely clear and spelled-out archetypes in the story, or the film would have been \"too surreal\" for mainstream audiences, owing to its lurid animation format. It follows then that we have a multitude of clichéd characters such as evil-laughing villains, sleazy crime bosses and butch tough-chicks who blow smoke every chance they get. It shoves noir in our faces, and it isn't necessary.<br /><br />What is worse is that the dialogue is a little contrived. It seems as though every line exists for the sole reason of propelling the plot. This is nothing fatal because the plot is so complex once it gets going that it needs some clear direction. Daniel Craig helps here too by bringing a no-nonsense attitude to his hard-edged cop character. At one point in Renaissance, he is seen in a vivid car-chase that surely is one of the most adrenaline-pumping and top notch sequences of the film. Unfortunately, the novelty of the sci-fi visuals have worn off post this car chase and 'Renassaince' could benefit from being slightly shorter. In summary, a very interesting but flawed futuristic comic book experience.<br /><br />7 out of 10", "label": "positive"}, {"sentence1": "I just viewed Detention last night and i liked what i saw. It was a cool fun movie.Dolph looked superbly cool on the Bike.He also looked good in this movie as compared to his other recent movies.He is now in a pretty good shape.The story was ok and the other actors were also passable.I wouldn't call this movie his best but its still a good movie.<br /><br />But it also had its share of Problems. The first one was the way bullets were flying everywhere and even when they were being fired at point blank range they missed the target.They should've had shown the ppl escaping the bullets in a better way. Another problem which i had was the way the students were swearing. I dont know in which school the students can swear in front of their teacher and even in the classroom. The third problem was that the bad guys were very few in numbers. There should've been more bad guys. Last problem was definately the fact that the set looked cheesy , but that was due to the small budget. Overall the movie was a good Movie.I enjoyed it.I would recommend others to watch it. P.S. Now u r a DEAD beat cop. (Some One-liners were also cool)<br /><br />", "label": "positive"}]