[{"sentence1": "This is the best version (so far) that you will see and the most true to the Bronte work. Dalton is a little tough to imagine as Rochester who Jane Eyre declared \"not handsome\". But his acting overcomes this and Zelah Clark, pretty as she is, is also a complete and believable Jane Eyre. This production is a lengthy watch but well worth it. Nearly direct quotes from the book are in the script and if you want the very first true 'romance' in literature, this is the way to see it. I own every copy of this movie and have read and re-read the original. The filming may seem a little dated now but there will never be another like this.", "label": "positive"}, {"sentence1": "The psychology of this movie is really weird to try and figure out. Its often billed as an anti-RPG movie, but its really not that simple. Here are come apparent contradictions that make me wonder just what (if anything) they're trying to say about gaming.<br /><br />They laboriously introduce all the characters home lives by way of introduction, all of them having parents who are divorced, alcoholic, and totally out of touch with their lives except for the times they're harshly pressuring them to succeed. Tom Hanks is arguably the worst off, having just failed out of another school and still dealing with a brother who disappeared and may be dead. <br /><br />Its mentioned a couple of times that they play the game to work through problems in their real lives. And sure enough, at the end, when they go to see Robbie (Hanks), they're all happy and well-adjusted, embarking on their adult careers, problems solved, games put away (Daniel doesn't even want to design computer games any more), and even Robbie's mother, who's been constantly drunk and dissatisfied, is suddenly the Happy Homemaker, looking fresh and bright and arranging flowers. <br /><br />Sure, JJ suddenly (and quite cheerfully it seems) decides to commit suicide, but the reason seems to be entirely because he's a lonely boy genius who can't get a date, and not because his character dies, as in the famous Jack Chick tract (which happens afterward anyways, and it almost seems like he does it on purpose so he can end Daniels game and get everyone to come play his. In fact, the prospect of live-action role playing in the caverns seems to be the only thing that saves him from killing himself!) And in what may be the coolest tableau scene in the whole movie, Kate, looking very fetching in chain mail, looks right at the camera and says something like, \"The scariest monsters are the ones in our own minds.\" <br /><br />The biggest fantasy element in this movie is the two muggers passing up the rich couple so they can rob the dirty, homeless-looking guy of his magic beans. The recurring theme (a \"The Way We Were\" for the 80s)might have been poignant at the end, but as a way to kick off a movie is downright depressing and seems out of place. And for one final mystery, our hero, wearing full Pardu regalia, has a psychotic break, becomes his character completely and embarks on his quest, so of course the first thing he does is change into 20-century street clothes. <br /><br />So maybe the movie's irrational, but I guess its dealing with an irrational topic. In those days a circle of kids with dice and pencils was regarded as tainted and possibly possessed, and you could go insane if they spoke their mumbo-jumbo at you. The anti-game paranoia is pretty much summed up in the first scene, where the reporter asks the cop whats going on, the cop says a kids lost in the tunnels and there's a chance Mazes and Monsters is somehow involved. The reporter admits to being vaguely familiar with the game (although he allows his own children to play it), then turns to the camera and reels off a polished spiel that blames the game for everything and admits no possibility of another explanation. In the end, its no masterpiece, but interesting as made-for-TV movies go.", "label": "negative"}, {"sentence1": "As with that film we follow the implausible if always engaging adventures of the 2 lead characters. But whilst C + J eschew sex for a girly trip back into childhood, this pair revel in their carnality even to the point of exploring homoeroticism. Most of the sex they acquire from grudging or unwilling partners and yet, despite their deeply un-PC behaviour, everyone emerges smiling. Like C + G, through it all they remain innocents at heart, rebels against the quotidien, the bourgeois, the restrictive. As someone else has commented, I wouldn't want to know these 2 and it's a minor miracle that their trip brings scenes of mostly comedy and very little tragedy (and what there is of that cannot be laid at their door) and thus for that reason, it left me beguiled but with a sweet taste in the mouth. Dare I say that only the French can get away with films like this. And that is part of their genius.", "label": "positive"}, {"sentence1": "If you want to make a movie like this, have the threat be real. Don't surround your patsy with a bunch of Bonzos. There is no credibility here. The plot is dull and unbelievable. The acting is even worse. I thought that I was watching Arthur Lake (Dagwood) who is one of the worst actors in history, when I saw the main character. Oh well, at some point he has to face the music and get fighting mad. I don't care. Do you? There are all these long scenes set in this austere office (the furniture made out of cardboard or masonite). People talk and smoke and don't do anything. Most of the action happens in a five minute sequence. After that, it's over. Don't bother.", "label": "negative"}, {"sentence1": "Although John Woo's hard Boiled is my number 1 favorite movie. But i have to say police story is my number 2 favorite movie. I say this because the stunts, the fights and the action my favorite part of the movie is when Jackie Chan jumps off the rail at the top of the esculator at the mall grabs on to a pole surrounded with Chrismas lights and slid down the pole fell through a skylight and finally land on his back on the hard marble floor. OUCH! Buy it at amazon.com for 14:98. (Or something in 14 dollars.)VHS new line home video. any questions or comments please feel free to reply. (i'm only 14 but i know where you can find any movie ever made.) if you looking everywhere for a movie and can't find it please reply to me. Thank you and good night!", "label": "positive"}, {"sentence1": "this has by far been one of the most beautiful portraits of a person that I've ever seen on screen. Andy Goldsworthy is a kind of man that is upon extinction. he views the earth and nature with such admiration and respect that it's primitive in a good sense. his purity, honesty and kindness breathes clearly as you watch him work in such simplistic yet full of life momentary pieces of art. I was amazed how patiently he created his pieces and how patiently he accepted their end. sometimes prematurely, but his Scottish sense of humor covers his disappointments brilliantly. the film is shoot elegantly and contains the same flow that Goldsworthy's art has. it combines nature and art in a minimal way as it is in itself. Fred Frith's score is organic enough that it blends everything together without interfering with it naturalistic sound. this is overall a great piece of work in every aspect. it has no boundaries as far as age goes.", "label": "positive"}, {"sentence1": "I find it rather useless to comment on this \"movie\" for the simplest reason that it has nothing to comment upon.It's similar to a rotten egg which has nothing good to show to the world excerpt for the fact that it is rotten as other endless number of eggs have been before it. But since a comment is mandatory for such a grandiose insignificance ... <br /><br />Filth is definitely the proper word to describe this movie created in the same manner as any other Romanian \"movie\" directed by Lucian Pintilie who insists to depict the so called \"Romanian reality\" following the Communist era (1990 to present days).<br /><br />Under no circumstances recommended for people outside Romania as for the others (who lately find amateurish camera, lack of plot, lack of directorial / actors's quality etc, noise etc. as being trendy and even art-like) : watch & enjoy this \"movie\" (as I know you will) but do the other well intentioned IMDb members a favor, don't write an online review for it will misguide, irritate and in the end waste their time.<br /><br />On the other hand this movie (among others) has some value whatsoever, an educational one for it sets the example for : \"How NOT to make a movie.\"", "label": "negative"}, {"sentence1": "Spirit of a murdered high school geek animates a scarecrow which then takes revenge on everyone.<br /><br />This movie really annoyed me. It has a great looking monster, has some good low budget effects, some atmosphere but manages to short circuit the good stuff with bad. Half way in I started to fast forward and then step through the chapters on the DVD.<br /><br />The problems with this movie are many. First off the cast looks about thirty and yet they are suppose to be in high school. You don't believe anything from the get go as a result. The scarecrow, while looking great isn't much beyond that. He says stupid one liners and moves in a manner more designed to be funny then scary. Is this a comedy or a horror movie? Its a problem that goes beyond the one liners to much of the dialog and set up. It seems more send up of every cliché than heartfelt horror film. I some how expect that the film was made for a very narrow audience in mind, horror fans who want to mock the genre rather than embrace it.<br /><br />Despite the good looking monster this is a film to avoid. Even if you pick it up in the bargain bin for under five bucks, you're paying too much.<br /><br />Avoid.", "label": "negative"}]