[{"sentence1": "Although a tear jerker it is definitely a \"feel good\" movie. All the actors were excellent and Will Smith as always, does the job and does it well. I could go on but pick any ten of the \"10\" ratings and they've said it as well and likely better than I could. <br /><br />BUT, since I must include at least 10 lines to post a comment I will say that Rosario Dawson was largely unknown to me as a viewer. Her performance was most enjoyable and I look forward to seeing her perform in many films to come.<br /><br />AND, this film demonstrates that Will Smith has nothing further to prove in terms of his ability as an actor.", "label": "positive"}, {"sentence1": "This movie isn't worth the film it was photographed on. The dialog is flat, filled with cliché overused lines and delivered by amateur actors who sound like their reading a script for the first time. The choppy, shaky, film style is a cheap imitation of the \"The Ring\" style visual effects. The characters do not even act like a normal person would. For example, the character who is looking for her twin sister at her home forces her way through the front door, creeps around the house all frightened and sobbing and she doesn't even once call out her sister's name to see if she is home. What? You would think she had just buried her sister instead of searching for her. Way too many flashbacks to her childhood. Too many unnecessary flashbacks is a typical sign of an amateur director. It is actually funny watching the numerous shots of the woman driving her car down the street, up the driveway, around this corner, over here, over there, oh a side view, now a front view. Enough already. You would think you are watching a TV commercial for the Solaris! Terrible movie. 0 out of 100. I really pity anybody who spent money making this film or to watch it.", "label": "negative"}, {"sentence1": "It is not obvious from viewing this film (so I recommend viewers research the people who present their case in it) but this presentation on the realities of Islam, and its encouragement of violence and intolerance against all non-Muslims is lacking objectiveness, and also completely fails to factor in the human condition. It is one thing to document that the Koran says many things about how a devout Muslim is required to interact with non-Muslims, but any realist is able to realize that not every human who feels himself or herself to be a follower of Islam, will agree with and comply with all tenets of that faith and system. There is reason to call much about the presenters into question, such that viewers need to see the presentation with a healthy skepticism; don't swallow it all, hook, line, and sinker, without some thinking of your own.<br /><br />One specific, for instance, is researching the person Walid Shoebat; who claims to be a former Muslim who perpetrated an act of terrorism in Bethlehem. There are many wise people in the world who believe neither of these assertions. I am not nor have I ever been a Muslim. I have never read the Koran. I am not a Christian, nor a member of _any_ faith. But I am an intelligent and discerning human. While the film is quite disturbing, in its presentation of how SOME Muslims view their obligation to Islam; I remind you that there is more to Islam than the views of the fundamentalists. Just as their are fundamentalists and evangelical Christians, so, too, there are variations in the intensity of belief and obligation among Jews and Muslims.<br /><br />When you watch this film, you need to have the salt shaker on hand. One grain will not be enough, you'll need more. Please use your own mind and think for yourself, research what is presented, and evaluate the state of the world and how Islam fits within it based on more than what is said in 98 minutes of video. There is a common thread of political affiliation among those who put this film together, indicating a definite bias. Be your own brain.", "label": "negative"}, {"sentence1": "I read somewhere that when Kay Francis refused to take a cut in pay, Warner Bros. retaliated by casting her in inferior projects for the remainder of her contract.<br /><br />She decided to take the money. But her career suffered accordingly.<br /><br />That might explain what she was doing in \"Comet Over Broadway.\" (Though it doesn't explain why Donald Crisp and Ian Hunter are in it, too.) \"Ludicrous\" is the word that others have used for the plot of this film, and that's right on target. The murder trial. Her seedy vaudeville career. Her success in London. Her final scene with her daughter. No part logically leads to the next part.<br /><br />Also, the sets and costumes looked like B-movie stuff. And her hair! Turner is showing lots and lots of her movies this month. Watch any OTHER one and you'll be doing yourself a favor.", "label": "negative"}, {"sentence1": "This German documentary, in English, is about a Scottish environmental sculptor named Andy Goldsworthy. He makes art from objects he finds in nature. For example, early in the film we see him taking sections of icicles and \"gluing\" them together with a little moisture into a serpentine shape that seems to repeatedly go through a vertical rock.<br /><br />Of course, the icicles melt, but that transience is a part of most of Goldsworthy's work. He goes to a site and gets a feeling for it, deciding intuitively what to make that day. He talks of having a \"dialog\" with the rocks and other materials that he works with, attempting to work *with* rather than against them. It might be stones, or flowers, or leaves, or sticks. The sculpture might last for minutes or years, or might not even last long enough to be completed and photographed. The work seems to be more of a process than a goal.<br /><br />The film, and the work, is beautiful, inspiring, and thought provoking. It moves pretty slowly, which is appropriate for the material, but you should be sure to go when you have had a good night's sleep. But do go if you have the opportunity.<br /><br />Search the web for some other pages about Andy Goldsworthy or to read about his local sculpture at Stanford University. There are also several books available with photographs of his sculptures.<br /><br />My thoughts: Skip reading this part if you want to find what this film means to you completely independently. I recall a couple of ideas that occurred to me while watching the film which I thought I would share for those of you still reading. First, the transitory nature of much of Andy Goldsworthy's work reminded me of the natural ebb and flow of human life. We're born, we live, and eventually we die. That's natural, and that's also naturally a part of Goldsworthy's art.<br /><br />The other thought was to be awestruck with the way that Goldsworthy has managed to integrate his passion and his work so thoroughly into his life. Most of us have work which is tolerated at best, a life which we hardly notice living, and passions which we really mean to spend more time on, if we even remember what they are. Andy Goldsworthy has managed to create an amalgam of all of these aspects of his life that looks like it works very well, and is nourishing for him and those around him. Wow.<br /><br />Seen on 8/28/2002.", "label": "positive"}, {"sentence1": "I thought King Solomon's Mines was beautifully done. My only reservation was Alison Doody. Her acting was superb but her makeup and hair was not of the period, and always seemed to make her look out of place next to the other actors. I thought Patrick Swayze was an excellent choice for Alan Quatermain. It was nice seeing a seasoned, rugged looking actor in this role after sitting through movie after movie with the fair haired, fair skinned actors like Val Kilmer, Brad Pitt, etc. He was an excellent choice and I enjoyed every minute of this movie. This version cannot be compared with the 1950's version with Stewart Grainger. It was a big screen movie and not a made for TV movie. I thought both Quatermains were believable but the two medias have to be kept separated. I am looking forward to seeing this once more, and I hope Patrick Swayze will again look to these type of roles.", "label": "positive"}, {"sentence1": "definitely needed a little work in season 2. Such as the Virus between Max and Logan, and Ames White along with his ancient, super cult. During season two, however, the only thing that kept me watching was to see if Max and Logan would ever get rid of the nasty virus infecting Max. Very good drama in season two. But of course like all TV shows, if there's something a little wrong with it, the broadcasting company takes it off the air. I was seriously hoping for a third and final season. Season 2 leaves you hanging, unless you read the books by Max Allan Collins, then you will know what happens.<br /><br />Dark Angel should be put back on the air for one more season even though it might cost a lot just to get all the original actors again. since Jessica Alba's carrier sky rocketed after the show. If that would be the case, then there should be a movie to complete it. just like the show Firefly, which of course FOX canceled as well.", "label": "positive"}, {"sentence1": "It's nice to see a film with real people with honest feelings. Sissy Spacek is so absolutely convincing as a simple, yet nice, daughter to Robert Farnsworth,<br /><br />who finally, in his last role, gets to show what a fine actor he was. It is hard to believe that this is a David Lynch film. It is slow and even, sweet and moving. One of the best unless you like car chases, sex scenes, and violence.", "label": "positive"}, {"sentence1": "When the US entered World War I, the government forced Hollywood to churn out propaganda films. THE LITTLE American is probably the best of the lot because it stars Mary Pickford.<br /><br />Pickford plays a young woman torn between two men: Jack Holt (German) and Raymond Hatton (French), but her decision is delayed because of the war as both men enlist.<br /><br />When the ship Pickford is sailing on is sunk by the Germans (think Lusitania) because it is carrying munitions, Pickford has a great scene as she stands on the lifeboat and yells at the German commander. Later on, of course, she runs into both Holt and Hatton when she is being held as a war prisoner at a château.<br /><br />Director Cecil B. DeMille provides one truly great scene in this film as Pickford and Holt are wandering through a bombed-out village. They pass a destroyed church of which only one wall remains standing. Against the wall is a very large crucifix. As they stand and watch, the wall collapses but the Jesus figure remains, suspended in mid air. It's a very surreal moment in a film that is otherwise very straightforward and un-artsy.<br /><br />Pickford is, as always, a pleasure to watch. She was always a very natural actress who avoided the arm-waving histrionics many other actors of the day used. She's also very very pretty. Holt is very good here in a leading-man role. Hatton is OK. Among the list of name actors in \"extra\" parts are Wallace Beery, Ramon Novarro, Colleen Moore, Ben Alexander, Hobart Bosworth, Norman Kerry, Walter Long, James Neill, and Edythe Chapman.<br /><br />Not a great film, but interesting to see US propaganda at work.", "label": "positive"}, {"sentence1": "This movie is very very very poor. I have seen better movies. <br /><br />There was a bit of tension but not much to make you jump out of your chair. It begins slowly with the building of tension. Which is not a success. At least if you ask me. Though at some points or moments I must say it was a bit funny when people got shot and how they went down.<br /><br />They should had made it something like Scary Movie, then it might be a better movie. Because I watched only pieces of the movie by skipping scenes and it got to boring through out the movie. I must say that i felt sleepy watching this movie so I sure can say it is not worth it.<br /><br />Don't waste time on even thinking to do something with this movie besides leaving it where it already is. Somewhere very dusty..", "label": "negative"}, {"sentence1": "I have been looking for this film for ages because it is quite rare to find as it was one of the video nasties. I finally found it on DVD at the end of last year it is a very low budget movie The story is set around amazon jungle tribes that are living in fear of the devil. Laura Crawford is a model who is kidnapped by a gang of thugs while she is working in South America. They take her into the jungle Laura is guarded by some ridiculous native who calls himself \"The Devil\" she has to go though all unpleasant things until they are happy. Maidens are Chained up. The devil demonstrates eating flesh in a horrible manner. Peter Weston, is the devil hunter, who goes into the jungle to try and rescue her,", "label": "negative"}, {"sentence1": "The fact that this movie made it all the way to the rentalrack in Norway is bizarre. This movie is just awful. This image quality is just one teeny bit better than you get of a mobile phone and the plot is soooo bad. The main character is just plain annoying and the rest just suck. Every person affiliated with this movie should be ashamed. The fact that the people that made this movie put their name on this is extraordinary. And the distributors; did they even see it!? This is probably the worst movie I have ever seen. To label this a comedy is an insult to mankind. I urge you not to support this movie by buying or renting it.", "label": "negative"}, {"sentence1": "After seeing \"Driven\" on a plane flight to America 3 years ago I truly believed I had seen the worst film ever created, and I could relax safe in the knowledge I would never have to suffer that much in front of a screen ever again. Unfortunately as I found out last night this was not the case. Revolver is so monstrously bad I am actually thinking about recommending friends to go and see it, just so I don't feel like I'm the only one stupid enough for being conned into watching this. Its really quite amazing how much this film falls completely on its face with the constant, and I mean CONSTANT voice overs of the main characters, with totally inane pretentious nonsense! I was actually getting angry in the cinema listening to Andre Benjamin's utterly relentless droning for what seemed like half the film, whilst all the time thinking - what would Turkish have done to this complete joke of gangster/con man, whatever he's supposed to be, when he made his \"offer\"? I'll tell you what. He would have told him to f**k off, blown his head away, and watch with utter disdain as his equally inept partner waddles away as fast as his chubby little legs would carry him. I mean what are we supposed to believe is going through Jake's head when they offer him their \"solution\" to his problem? They're con men, therefore they must obviously also have the skill to cure incurable blood diseases! I mean ffs. Doesn't he start to wonder why his symptoms aren't getting worse? Doesn't the penny drop on the third day what is happening instead of Richie subjecting the audience to a painfully patronising phone call from Avi to Jake to let him know he's been conned. <br /><br />Anyway, I can add a small positive note to the film by moving on to the dry humour if provides, thankfully of a similar standard to his previous films\u0085\u0085. bulls**t! This film doesn't try anything as smart as redeeming itself through some well timed amusing lines, oh no. It somehow managed to be so disastrously unfunny I genuinely didn't hear so much as a titter from a completely packed cinema \u0096 and anyone who knows the UGC in Sheffield knows how full a main screen can get, and not 1 person so much as smiled. Maybe he never wanted the film to be funny, and fair enough you can still make good gangster films without comedy, but what was he planning on hanging this film on may I ask? The unnecessarily baffling plot!?? I sincerely hope not!<br /><br />By far the most satisfying moment I went through last night was hearing the very loud sighing coming from ALL directions of the audience as everyone desperately prayed for the film to end. It was also really quite amusing watching just how fast patrons were fighting and dashing for the exits after they realised it was over, and they were free from their torment!<br /><br />I'll round this off (I've got to finish, writing this is making me angry again) by elaborating on the \"end\". I mean sh**t! The ending\u0085.. no, sorry I can't, your just going to have to go and see it. It can't be put in words, it just can't, and after you've seen it you'll know why. Uuhhhhh \u0096 shudders \u0096", "label": "negative"}, {"sentence1": "This movie had mediocrity, laziness, and thoughtlessness written all over it. If you are going to do a movie about vampires that has been done thousands of times already, then you better do a damn good job. I'll be the first to say that this movie just did not cut it. Some scary/horror movies just fail to break the mold of the \"lets do something forbidden and forsaken for the sake of fun because all the stories are just lies\" cliché. This one, sadly, was no different, and like all scary movies, once you venture down that road there is no going back.<br /><br />And the ending? How do the heroes do the same job over and over throughout the movie, but then mysteriously they get wrapped up in the moment and cannot do the job in the end? The ending was very anti-climatic and spelled part 3 which I will never watch. Terrible movie.", "label": "negative"}, {"sentence1": "This film was hard to get a hold of, and when I eventually saw it the disappointment was overwhelming. I mean, this is one of the great stories of the twentieth century: an unknown man takes advantage of the unsuspecting airline industry and GETS AWAY with millions in ransom without hurting anyone or bungling the attempt. With all of this built-in interest, how could anyone make such a lackluster, talk-laden flick of this true-life event. While Williams is always interesting, the screenwriters assumed that the D.B. Cooper persona was stereotypically heroic like a movie star, s what we get is a type-without any engaging details or insights into the mind of a person daring enough and clever enough to have pulled it off. Harrold practically steals the movie with her spunk and pure beauty, but the real letdown was in the handling of the plot and the lame direction. Shame on this film for even existing.", "label": "negative"}, {"sentence1": "It was simple and yet so nice. I think the whole sense of sex segregation in society, which can be bitter, was shown very delicately. It had a bitter kind of hummer in it. The fact that most of the actors were not professionals, made the movie more tangible and more realistic. There was a \"documentary\" side to the movie too. The best scenes were those that all the girls, banned from watching, were listening passionately to the soldier, who is supposed to keep an eye on them, broadcasting the game. If you are an Iranian, the familiar cheering and dancing in the streets after a game won, fills you up with National pride!! If you are not Iranian, you'll still love it all the same!", "label": "positive"}, {"sentence1": "Georgia Rule has got to be one of - if not the worst movie I have ever seen in my life. The whole movie has a very surreal feel that made me gasp, \"what?\" out loud at least 7-10 times throughout its grueling two hour course.<br /><br />Advertised in its trailer as a movie about three generations of women - Jane Fonda as the matriarch, Felicity Huffman as her daughter, and Lindsay Lohan as the rebellious, over- sexed, scantily clad grand-daughter, the viewer thinks this will be a cliché, light, chick-flick about growing up and coming together as a family.<br /><br />Talk about false advertisement at it worst.<br /><br />After many shots of animals doing \"funny\" things in the background of \"pivotal\" scenes and not to mention a whole five minutes focusing on an old woman who comes into a doctor's office weekly to have her diaper changed, or the fact that this movie is actually about Lindsay Lohan's character being sexually abused by her step-father, Georgia Rule creates its own genre of cinema : The ungrounded, horribly acted, inappropriate comedy dealing with extremely serious issues in the most awkward, surreal, strange way. If Garry Marshall wanted this movie to be a drama/comedy, then he should have watched The Royal Tenenbaums. Sideways. Junebug. And so on. And so on.<br /><br />The only way I feel I can get a reader to understand the horrific genre that Georgia Rule falls under is to create a hypothetical situation. Say that the movie, The 40 Year Old Virgin, was about the main character being celibate because he was sexually molested as a child. But instead of having the movie take a more dramatic turn, belly laughs and comedy would ensue, with all of the characters' reactions being that of fake, lifeless, human beings pretending to care. <br /><br />Throw in a yellow parakeet, Dermot Mulroney as the flattest, most non-dimensional character that could have been cut completely out of this poorly written script, along with a male character who throws away all of his religious beliefs and morals to be with a trashy, too-tanned girl who shares none of the same interests as he, as well as an an unnecessary car chase scene, unreal moments of characters trying to relate to each other, and you've got Georgia Rule.<br /><br />I found this movie to be an insult to any of those people out there who are struggling filmmakers, screenwriters, actors, editors, etc..who have a lot more talent and aren't getting noticed.<br /><br />Don't see this movie : my rule. <br /><br />And if you must, get sufficiently drunk before hand.", "label": "negative"}, {"sentence1": "\"So there's this bride, you see, and she gets crushed to death by this statue that falls on her on the day of her wedding. Then, get this, a year later, her former fiancé falls in love with a beautiful psychic\u0085 and then, that beautiful psychic gets haunted by the ghost of the disgruntled dead bride who wants to keep her from stealing her boyfriend\u0085he he\u0085it'll be hilarious!.\" Polite chuckling.<br /><br />This, I like to envision, is how Jeff Lowell, the man who dreamed up \"Over Her Dead Body,\" presented his concept to the studio execs over there at New Line Cinema. The big mystery is how those very same corporate bigwigs could then turn right around and green light the project, allowing Lowell to direct the film as well as write the screenplay.<br /><br />For if you think that no movie could ever possibly be as bad as this original premise sounds, then clearly you have another think coming. The only way in which it might have worked is if the writer had simply gone crazy with it and turned it into a no-holds-barred satirical farce. Instead, wanting to ensure that he delivered a fuzzy, inoffensive and warmhearted romantic comedy, Lowell engages in boring half-measures every step of the way, tamping down the absurdity in favor of drab conventionality. Indeed, \"Over Her Dead Body\" is so thoroughly inept and unfunny that it's hard to know where exactly Lowell thought he was going with it. Virtually every set-up, joke and sight gag in the film is flat-footed and poorly executed, with even the actors themselves seemingly aware of their predicament. How else to explain the halfhearted, lifeless performances of Paul Rudd, Eva Langoria Parker, Lake Bell and Jason Biggs in their various roles? <br /><br />I choose not to blame the actors, some of whom have proved their talents in better vehicles in the past (that is particularly the case with Rudd). But Lowell and those studio execs sure have some 'splainin' to do.", "label": "negative"}, {"sentence1": "I searched out this one after seeing the hilarious and linguistically challenging \"Clueless\" (1995), perhaps Alicia Silverstone's best known effort from early in her film career. \"True Crime\" has Kevin Dillon, which should be helpful in improving most film projects. In fact everyone in the cast does a good job . The only disappointment I think the movie has for me is an awkward \"feel\" to some of the scenes, coming from the need to run a quite uncompromising, grown up theme as part of what in tone starts out as a schoolgirl adventure.<br /><br />Alicia Silverstone is pretty good in this one. She carries off well the naive enthusiasm and growing unease that affects Mary Giordano as she manoeuvres towards the truth behind the serial murders. I reckon her characterization of MG has some mileage in it too. The inference of the story line is that she goes on to a career in law enforcement. It could be really interesting for an older Silverstone to revisit Giordano at a time of crisis later in the officer's life. Just a thought!<br /><br />\"True Crime\" shows its director in a good light. Pat Verducci also has the writing credit. I don't know of any other film work PV has done. I can only wonder what happened after such a promising start.<br /><br />Like most productions, this one has a largely unknown supporting cast, although Bill Nunn (Detective Jerry Guinn) is hardly that. Over the past decade he seems to have been able to secure an impressive number of screen appearances. I recall seeing him recently in \"Carriers\" (1998), a made for TV presentation with a military theme. Bill Nunn played \"Captain Arends\". Fans of the classic US TV comedy show \"Who's the Boss\" may also have an interest in \"Carriers\" because the leading player is Judith Light, remembered with affection by many because of her lengthy involvement with the show.<br /><br />\"True Crime\" could easily not have worked, but it does OK. I think it is an entertaining story worth seeing.", "label": "positive"}, {"sentence1": "Wow! Wow! Wow! I have never seen a non-preachy documentary on globalization until I saw MARDI GRAS: MADE IN CHINA. This film has zero narration and combines verite footage with sensitive interviews with four teenage workers in China who live inside a factory compound. They play with toys, jump rope, and dance. Yet, the majority of their days and nights consist of work, work, and work -- but the footage of their work is illuminating and mesmerizing to watch. The owner of the factory in China is amazingly open, so much so that he hits home the effects of globalization while he \"punishes\" the workers. Astutely following Mardi Gras beads from China to the Carnival, the film reveals how the local is connected to the global through humor and interesting, compelling footage from both cultures. One of the most interesting parts in this film is the cross cultural introduction of factory workers and Mardi Gras revelers to each other through pictures. Here, the film comes full circle and shows how images can be a point of communication and transformation. The film is never preachy, is not guilt driven, and allows everyone's point of view to be present. At the end, we -- the viewers -- make up our own conclusions about the complexity of the film, and globalization.", "label": "positive"}, {"sentence1": "Definitely one of the lesser of the Astaire/Rogers musicals. It's just very poorly plotted and paced. It only runs a few minutes longer than Swing Time, for example, but it feels a heck of a lot longer. This is partly due to the secondary romance between Randolph Scott and Harriet Hilliard. Scott is rarely ever interesting. I like Hilliard. She's sweet, and I love at least one of her songs, \"But Where Are You?\" (\"Get Thee Behind Me Satan\", her other number, is a weak leftover from Top Hat, thankfully cut from that masterpiece). Follow the Fleet would actually be a bad film if not for at least three brilliant dance sequences between Astaire and Rogers. The dancing contest vies for the top spot of any of their numbers. The dance is just fantastic. \"I'm Putting All My Eggs in One Basket\" presents the two rehearsing a dance that they don't quite have perfected yet. Its imperfections make it all the more perfect. And \"Let's Face the Music and Dance\" is easily one of Irving Berlin's best songs. So the film is well worth watching for its great moments.", "label": "positive"}, {"sentence1": "Hello, this little film is interesting especially for an artist, film-maker or music creator or a visual artist, for:<br /><br />One can feel and examine David's touch/style straight out of a short piece of relative simplicity.<br /><br />You can see the rhythmic spacing of the shots, the pans and the sound elements. <br /><br />Even as simple film, this creation is multy-layer. For example, there are some sounds that drone all along, while others appear (though subtle), at certain points to support certain shots.<br /><br />One can see also several types of pans: some go up and down in a gentle back-forth way. There is diagonal pan. Zooms also go back and forth sometimes.<br /><br />The lightning and the composition/disposition of elements in the space is, as usual and obviously, work of a painer/artist. This can be felt even in this crappy room. This is to say: one can make exquisite art already by the simple art of placing the look/view and composing the scene. Then comes the forcelines of the visuals: like digonales, parallels, etc. The light's degradées and the colours, although without too much research for textures as in big productions, are fine too. This is an artist's sketch of a sort...<br /><br />All this is not calculated but done with inner feeling and this feel gives the David's touch/feel to it, as with any true artist.", "label": "positive"}, {"sentence1": "If you haven't seen this, it's terrible. It is pure trash. I saw this about 17 years ago, and I'm still screwed up from it.", "label": "negative"}, {"sentence1": "This is a very funny movie! I have no idea whether it translates well into other languages or not. However, I do think men all over the world can identify with \"Frank\" and his thoughts to some extent! These thoughts are hugely entertaining and women will also enjoy this movie I'm sure!<br /><br />All cast members perform well, and this film could have been a tremendous hit all over the world if it was made in England or the US. But for those of you who are fortunate enough to understand Swedish, you are in for a treat!<br /><br />Highly recommended.", "label": "positive"}, {"sentence1": "I'm so confused. I've been a huge Seagal fan for 25 years. I've seen all of his films, and many of those dozens of times. I can only describe this film as \"bizarre.\" Steven Seagal shares screenplay writing and producing credits on this film, but I have a really tough time believing he would choose to dub over his own voice for so many of his lines, with a thin, whiny imposter's voice no less. What I also don't get is, if they had to dub SOME of his lines, why does his own voice appear on the rest of them? I expect Seagal to age like the rest of us. But the Seagal in this movie barely exudes a fraction of the same swagger, confidence, bravado, charm, and sex-appeal he so easily showed us in ALL of his previous movies. What I found myself missing most of all was his cocky, self-assured attitude and his bad-ass sneer that so easily shifts into that adorable grin. Where is that in-your-face attitude and charm that made him such a huge star??? I hope that this film is not an indication of what Seagal has left to offer us - if so, his lifelong fans will have to concede that the Seagal we all knew and loved is gone.", "label": "negative"}, {"sentence1": "Robert Mitchum stars as Clint Tollinger in this short but tough western: Man With The Gun. Tollinger is a professional town tamer - as in, when a town needs someone to save itself; he is the one who is brought in to do it. Tollinger's latest gig comes by as an accident: strolling into town looking for his former fling, he stumbles into a town being played like a puppet by a local western gangster. But many townspeople begin to rue the day they hired Tollinger, as his way of cleaning up the town becomes very taxing (suddenly High Plains Drifter seems less original). <br /><br />Man With The Gun starts off as an average western tough-guy film but begins to surprise you more and more as the film progresses. What starts off as forgettable and run-of-the-mill ends up dark and character-centered. The entire film is very well shot and the cast is very enjoyable. Mitchum is his usual excellent self here in Man With The Gun - not one of his very best performances, Mitchum still has his classic and effective tough-guy screen presence in high gear and he knocks the action-packed, meaningful, and shocking scenes of the film right out of the park. Man With The Gun is a nice Mitchum western and is easily worth one's time.", "label": "positive"}, {"sentence1": "My 2 year old likes the Doodlebops show, it seems to keep his attention for awhile. The characters are interesting, vibrant with primary colours and all. There's not much educational content that the intended target audience could benefit from, but they do seem to have a theme each show and try to teach kids about sharing and respect and other basics, so I like it for that. It's well produced with high production values. But it's really just an average show like most of the shows on TV these days. We don't buy into the merchandise angle and have our son wearing everything Dooblebop. I don't think we'd spend money to go to a live show, if they ever came to town. Going to The Zoo or the Science Centre is a far better experience for everyone involved and in my opinion is money better spent.", "label": "positive"}, {"sentence1": "I've noticed over the years that when a rock star makes his final album before his death, that album, if it's not his best, is usually prolific in some way and worthy of a listen at least. The album is usually good enough to cement a legacy. However, when it comes to comedians, especially mainstream comics who star in their own vehicles, their final movie is usually God awful. John Belushi had \"Neighbors\", John Candy had \"Wagon's East\", Chris Farley had \"Almost Heroes\", Phil Hartman had \"Small Soldiers\", and Rodney Dangerfield had this movie.<br /><br />\"Back By Midnight\", although it may not have been Dangerfield's very last film, is weak in every sense of the word. It wrapped filming in 2002 according to this website, and it's safe to say that it would have stayed on the shelves if Dangerfield was still alive. I have been a big fan of Dangerfield's since I was in my early teens, and it pains me to see how rotten this film was.<br /><br />What amazes me the most is that a number of other talented people took part in a movie with a very weak premise to begin with. Dangerfield, a great comedian who usually played his comic persona on film, is a prison warden who houses a close knit group of inmates. When the owner of the prison, Colonel-Tom-Parker-meets-Sam-Walton billionaire Eli Rockwood (Randy Quaid), cuts funding for the prison, the warden sends a group of inmates to break out of prison, rob Rockwood's eponymous convenience stores of consumer goods, and break back into prison with the loot. By taking what's in the convenience stores, they are (I guess) taking what they believe Rockwood owes them.<br /><br />With this flimsy premise, the movie sputters and stalls frequently. On top of that, the jokes that you think would be this movie's salvation are not even close to funny, not even from Mr. No Respect himself. That is incredibly disappointing too, because you'd expect a movie with Oscar-nominated (!!!) Randy Quaid, Kirstie Alley, Gilbert Gottfried, Ed Begley Jr., Yeardley Smith, and others to be at least a little bit funny. Instead, Quaid plays a character we've seen before in countless other comedies, Alley plays a British heiress with an awful British accent (could this movie not afford an actual British person!?!), and every joke was poorly set up and poorly timed by virtually every member of this ensemble. It was just not a good comedy in any sense of the word.<br /><br />\"Back By Midnight\" was rated R mainly for language (and one scene of nudity). The irony in this fact is that many of the jokes are so audience insulting that even kids (if you edit out the language) would walk out of this film. The physical gags are also incredibly predictable, especially when Alley's pet monkey torments Quaid's character. When the monkey grabs a pair of scissors and jumps on Quaid's couch, who wouldn't know where that gag was going?<br /><br />Being a direct-to-video comedy, of course I didn't expect any Oscar-winning material on here. The truth is, though, Dangerfield has made some great, timeless comedies before. \"Easy Money\" and \"Back To School\" are hilarious still, and were definitely not Oscar-worthy in the slightest. However, there's a difference between making a dumb comedy that's funny, and making a dumb comedy. With the latter kind of comedy, it seems like the filmmakers don't even try, which is precisely the case with this lame excuse for a wasted 90 minutes. Rest in Peace, Rodney, but add this film to your batch of forgettable comedies like \"Meet Wally Sparks\" (1997) and \"The Godson\" (1999). This film, dare I say it, is not even worth seeing.", "label": "negative"}, {"sentence1": "This will be a different kind of review. I've seen this movie twice on TV and would like to have a copy because it talks about Panama City and the beach in the winter time which is my favorite time to be there. It was the first movie I'd seen by Ashley Judd and she was great and I've enjoyed every other thing I've seen her in. Sundance's reaction made an impression on me too, as did the director, Victor Nunez, who has directed and written several movies about Florida. This movie speaks to me and I've seen nothing with which to compare it. The plot speaks less to me than the surroundings. Well, I told you it would be a different kind of review.", "label": "positive"}, {"sentence1": "This is an evocative and idealized portrait of the early life of Lincoln(born 1809 Hodgensville-Kentucky- and died in Washington 1865). Ford's excellent movie takes Abraham Lincoln(Fonda) from his youth. He studied laws, common law and began practice as lawyer in 1837.This Hollywood biography follows Lincoln from his log-cabin days, initial relationship to Mary Todd(Weaver), following the couple from their first ball,and his departure for congress candidate. But focuses mainly on a brothers(Richard Cromwell,Eddie Quillan) accused for murder, the posterior trial with amusing court debate scenes and the protection for their mum(Alice Brady). The Lincoln-Fonda as defender advocate and Donald Meek-prosecutor are nothing short of brilliant.<br /><br />Excellent performance from Henry Fonda as idealistic,traveller Springfield solicitor , he was to star regularly for Ford from this movie, as ¨Grapes of wrath,My darling Clementine, and Fort Apache¨. Besides sterling acting by Alice Brady as grieved mother, she was a great actress from the silent cinema, but this one results to be her last movie because she early died from cancer.The Lincoln's deeds developing make for skilfully appealing entertaining.His portrayal shows a nostalgic longing for things past and old values and describes his goodness,uprightness and willful. Lincoln, like John Ford, was a straightforward man who never varied the ideals of his youth.This American masterpiece is correct on both counts, as splendid biography and as magnificent drama.<br /><br />Another biographies about Abraham Lincoln are the following: 1) ¨Abraham Lincoln¨(1930) by D.W.Griffith with Walter Huston, Una Merkel, talking from his birth until his assassination; 2) ¨Abe Lincoln in Illinois¨(1940)by John Cromwell with Raymond Massey, Ruth Gordon, concerning similar events to Ford's film through his career as lawyer 3)TV version titled ¨Gore Vidal's Lincoln¨ with Sam Waterston and Mary Tyler Moore as Mary Todd.", "label": "positive"}, {"sentence1": "May contain spoilers.<br /><br />I say that, but anyone savvy enough to be reading this can probably figure out every plot turn right from the start.<br /><br />This is not a movie that I liked. I didn't hate it in the way of some movies that insult your intelligence, but it all felt too predictable on its trudge to the requisite happy ending. There were funny bits along the way to be sure, but few were original. At least it didn't go for the gutter.<br /><br />Christina Applegate looks fresh, and Ben Affleck works hard. Their scenes together are actually the only redeeming feature. Everyone else is a cardboard cutout, including, surprisingly, James Gandolfini, who must have made this as a favor to someone.<br /><br />All in all, it's a harmless, but not inspiring, 90 minutes.", "label": "negative"}, {"sentence1": "Really, They spelled it BRAIN in the credits, not BRIAN.<br /><br />OK, they didn't have the budget for a spell checker. All the production money went for great old cars. There are at least two Packards visible here. One is a Darin Convertible. A nice yellow Packard convertible.<br /><br />The scenes of the movie studio show that there was some money spent for costumes and set decorations. Old Cameras, an exterior of Ciro's, street signs and whatever was needed to make a visually pleasing picture was there. Poorly written and directed.<br /><br />My DVD says it runs for 104 minutes, approximately. It was more like 85 minutes. It came to an end without reaching a conclusion. There was a collision but no conclusion. The movie just smashed up against the credits. 99 cents for this. I paid 99 cents for this. I could have bought 3 cans of cat food and watched my cat's face as he emoted more excitement.<br /><br />For a few seconds in the Ciro's scene after Darren McGavin gets a phone call, it looked like, maybe... this movie would have a surprise twist that would make for an interesting film. Then it just sat there.<br /><br />The young Latin actor played by Steven Bauer (Tony Montoya) could have had a much bigger part in all that was going on here. This cast could have made a good film.<br /><br />I think if they cut Brian's part and use Steven Bauer in his place and change the script and keep the Packards and lose the band and add a Johnny Otis sound alike band, then they got something.<br /><br />Here Kitty, Kitty...<br /><br />Tom Willett", "label": "negative"}]