[{"sentence1": "Recently, a friend and I were discussing educational and ethical influences when we were growing up in the 1950's versus today. She mentioned Samuel Taylor Coleridge, who, in 1798, wrote The Rime of The Ancient Mariner. Both of us had been required to recite parts of the epic poem in high school and in English Literature courses in college. My friend said, \"Its messages even might be called metaphysical within today's context.\" <br /><br />We tried reciting it and only remembered bits and pieces. (I have problems remembering Dr. Seuss.) I said I'd get two copies of the poem so each could read it. That was easy enough, but I was extremely surprised to find it had been made into a film. We looked forward to watching the film to see how it had been interpreted. After all, The Rime of the Ancient Mariner isn't exactly light reading. After each had read the poem, we watched the film together.<br /><br />We considered the film a remarkable achievement, especially considering it was made in the 1970's, before computers, before the so-called \"Ken Burns effect,\" and before special effects too often began compensating for a lack of substance. Particularly noteworthy are the 19th and 20th century illustrations culled from \"lesser known artists,\" such as Willy Pogany, the early Hollywood designer. <br /><br />The film is narrated by Sir Michael Redgrave, whom had taught the poem when he was a schoolmaster, adding a tone of authority and credibility in remaining true to the poem. <br /><br />Its mastery is in the layers of subtle messages, conveyed without \"instructing,\" or becoming an oppressive and obvious morality tale. We found it such a refreshing change from today's 'in your face' and 'clobber them over the head' mentality. Most of today's morality messages in film are two-dimensional: extreme violence, murder and mayhem mark the bad. The bad are really, really, bad, and good are super heroes. It is as if human character lacked any nuance. The Rime of The Ancient Mariner is a celebration of the individual, of character, of an appreciation for celebrating all the richness life has to offer, within the larger context of humanity, i.e., man's capacity to give to others. <br /><br />Proud of ourselves for having found this \"unknown\" gem, we then learned it had won the top award in its category five out of six times at \"name\" international film festivals. Another surprise was learning the film's director, Raul daSilva, is a recognized authority on early animation, and authored six award winning books about film. <br /><br />This film's message is just as relevant today, if not more so, than when Coleridge penned the original epic poem and when Raul daSilva translated it to film. If I still was teaching high school, which I did for five years, I'd grab this one and show it to all my students. There's a level of richness here that naturally leads to discussion about the big and important issues all of us face, whether in 1798, 1978, or today--in fact, as long as humanity has a spiritual component.<br /><br />Highly recommended.", "label": "positive"}, {"sentence1": "For a made-for-TV \"horror\" movie the movie started off very interesting. I was really intrigued by the story and the mystery of the film. But the ending was a total dissappointment. The movie was going along fast-paced and was building up to, it seemed like anyway, to a very climatic end. But guess what there is no end. The movie is just over and after almost one-and-a-half hours the audience is just left wondering what happened. Why were all the unanswered questions in the film left unanswered. There was no explanation at all about any of the key points in the plot. This film is like watching a murder mystery and then never finding out who did it. Very dissappointed. This film looks like the producers just ran out of money and never completed the film. A real BOMB!", "label": "negative"}, {"sentence1": "What was this supposed to be? A remake of Fisher King? Why do we care about Sandler's character? What a slow, dreary, boring, who-gives-a-damn-about-these-people movie!!! Just simply painful to sit through, I turned it off before it was over. It's so obvious that Cheadle needs help as much as Sandler; like I said: can you say \"Fisher King\"? And how does this psychotic character function in his daily life? We aren't supposed to think that deeply, I guess. Why does Cheadle continue to give Sandler a chance to turn violent on him? If they were such good friends, how did they grow apart? If Cheadle is so in control, why does he keep seeking the advice of the shrink on the street? We are never told. That's why Fisher King was a better film on so many levels and why this just sucks. Nearly 8 out of 10 average score? I don't agree. At all. Even the top films are lucky to get such a high average rating, and this crap doesn't deserve to be in the same universe with them.", "label": "negative"}, {"sentence1": "I have a feeling that Dr. Dolittle was intended for an audience composed entirely of children. I think I would have had a better time if I sat at home and watched a sit-com. My favorite characters in the movie were the pet hamster and the two alley mice.", "label": "negative"}, {"sentence1": "I had heard some not too good things about this movie and had probably seen the low score here at IMDb and that's why I had avoided it. Today they showed Vanilla Sky on TV and as I had nothing better to do... and as it turned out, I would have had a hard time finding anything better to do. Vanilla Sky is a frightening, sad and touching movie, actually one of the best I've seen in a while. I was surprised by how I was affected watching it. It's hard to explain, but during the movie your feelings towards the characters and your perception of what is going on changes and it's quite an emotional journey. Vanilla Sky really touched me in a way that is very rare for a movie, or any media for that matter.<br /><br />I really recommend everyone to watch this movie. Regardless of what you have heard about it.", "label": "positive"}, {"sentence1": "This movie is truly awful. After seeing the advertisement for it, i thought it could have its charms ... but it didn't.The girls cannot act, and they cannot sing either. The soundtrack to this movie is full of their songs, and its not a pretty sight, Terrible story line, unbelievable plot, its one of Disney's worst movies by FAR!. Ally is not a bad actress on \"Phil of the Future\", so i don't know what happened in \"Cow Belles\". And her sister, AJ, seems to be just hitching a ride on her sisters \"fame\", and she displays no talent what so ever.<br /><br />At the end of the movie the girls do finally learn some cliché morals, but this is to late to rescue this train wreck movie.<br /><br />Awful", "label": "negative"}, {"sentence1": "This was the best Muppet movie I've seen ever! I happen to know that Miss Piggy's fantasy of meeting as infants was the cause of Muppet Babies. The songs will remain in my head forever. Only saying so because that stupid Nickelodeon show Hey Dude song still remains in my head. Sorry, a little off the topic there. But anyway what I like is Animal after the credits saying \"Bye Bye! Bye Bye! Bye Bye! Bye Bye! Bye Bye! Hasta Luego!\" That made me laugh so hard. My absolute favorite is the play at the end. I was surprised that the Sesame Street characters popped in at the wedding. I'm just glad this movie was very entertaining. I borrowed it from the library, and now I have bought it because I can't keep the library's copy forever. In conclusion, I proclaim this is the best movie I've ever seen! In my case, it's even better than Austin Powers in Goldmember, which was my favorite movie!", "label": "positive"}, {"sentence1": "ba ba ba boring...... this is next to battlefield earth in science fiction slumberness. genie francis (aka general hospital's laura) has a small role as a reporter and that in itself should tell you that this movie must be bad.... there is ben kingsley (an academy award winning actor) in this stinker and a few others decent actors. You have to wonder what possessed them to decide to do this awful movie. The music dramatically goes up and down like it's a major dramatic story. Even if you pay attention the plot is impossible to follow. The effects are mediocre as well and seem really dated. All of the actors speak in a monotone voice and have no realism to their dialogue. I could go on and on on how this is a bad movie. At least with Battlefield Earth it's so bad it's funny but this is just b o r i n g. Avoid unless you want to be lulled to sleep.", "label": "negative"}, {"sentence1": "Murder and insurance fraud take an adulterous couple to \"the end of the line\"...<br /><br />TV was visually vulgar back in the early 1970s and this truncated, made-for-TV knock-off hurt my eyes. It can't possibly compare to the 1944 Billy Wilder Film Noir classic as anyone in their right mind ought to know -sight unseen- but that doesn't mean this update should be seen as a separate entity, either. Although based on the original Paramount screenplay, there's over half an hour cut out and the director's bland indifference makes what's left imminently forgettable. With rare exception, the younger generation wasn't interested in watching old black and white movies on TV back in 1973 (still true today, alas) so this lurid, compelling tale was new to the overwhelming majority of viewers; then as now, ratings rule and cashing in was its only reel raison d'etre. Gus Van Zandt remade Alfred Hitchcock's PSYCHO for similar reasons and if these redux led to the seeking out of the original films or novels, so much the better. I loved the James M. Cain source novel enough to tune in back then and I enjoyed this time capsule curio the second time around for the longish hair, halter tops, turbans, ugly decor, and lush auburn locks of \"guest star\" Samantha Eggar, who didn't try too hard. In addition to recognizing a few of the incidental cast from a childhood spent in front of the boob tube, Lee J. Cobb was able to hold my interest as a world-weary, tired-looking Keyes but Richard Crenna's affable and inoffensive Walter Neff only reminded me of Bill Bixby on a bad day. Improvement upon the original was, of course, never intended in a rush to make a buck but, instead of a mindless retread, a new adaptation of the novel would have been a novel idea. Cain's book differs somewhat from its celluloid incarnations and the horrific shark fins in the moonlight ending is killer. The completist in me is thankful this speeded up \"Me Decade\" update was included as part of the DOUBLE INDEMNITY DVD extras but the experience not only made me long to see the original, it had me nostalgic for any episode of the better-made COLUMBO TV series. I also flashed back to a very good 1973 ABC TV Movie Of The Week that I haven't seen since its initial airing: John D. Macdonald's LINDA starring the beautiful Stella Stevens as a ruthless femme fatale who murders her lover's (sexy John Saxon) wife and then frames her mild-mannered husband for the crime and, if I remember correctly, there's also an open-ended ending. Like DOUBLE INDEMNITY, it was needlessly remade with TV movie queen Virginia Madsen as the titular vixen and Richard Thomas as the milquetoast husband.", "label": "negative"}, {"sentence1": "I went to see this movie twice within a week and can only sum it up in one word (which I normally don't use lightly): Wonderful! In my view, the best movie ever made. Who deserves Oscars and other awards if not this Swedish crew who have created cinematic perfection in the last scenes of the film, when everything that is said (and left unsaid) throughout the story is drawn together? Just as the character of Daniel Dareus evokes so many sentiments and long repressed feelings within the people around him, the movie does the same to its viewers: You walk out with your head abuzz and your heart feeling full. Great stuff! Next time you ask yourself \"what is the meaning of life\", perhaps think about how you feel after a sumptuous experience like As it is in Heaven: Happy, content, fulfilled. To say it with Virginia Woolf's Mrs Dalloway: \"Such moments are enough\".", "label": "positive"}, {"sentence1": "This reminds me of when I was a born-again believer who was going to be a minister. I never actually thought I would be a minister or even graduate from high school because I was almost positive I would be raptured to Heaven before that would ever happen. That was before I discovered that Christianity was a bunch rubbish. I am now an atheist, and that just proves that the \"once saved always saved\" doctorine that Christians tell us is no more real than elves. If it were true then why did I leave after many years of being a devout born again believer? Yes, I really was saved. I prayed that silly sinners prayer with all my heart.<br /><br />If Christians were to read their Bible they would discover that their god thinks like rape, genocide, abortion, and many other atrocities are alright according to him. They might be surprised to learn that no where is the word \"rapture\" mentioned.", "label": "negative"}, {"sentence1": "Ah, clichés, clichés, clichés; They're a main part of a wide variety of horror films.This one, has a lot of them.Still, it's Stephen King, one of the best masters of horror. This movie was really good, just TOO predictable. And what horror movie doesn't have stupid people? This one is overcrowded with retarded victims just practically begging for their life to be taken. Pet Semetary I found to be creepy a little. The way everything is set up was REALLY spooky, but not terrifying. For the most part, the acting was SOMEWHAT believable, the suspense wasn't that suspenseful, but the entertainment level is set at a major rank; My eyes were practically glued to the screen.All Stephen King fans must see this movie, but as for anyone else, expect an OKAY thriller.", "label": "positive"}, {"sentence1": "Easily 9 out of 10 for a film by director we will continue to grow to admire. But don't watch this movie expecting to be \"entertained.\" Ang Lee takes an objective look at a relatively unexplored aspect of the Civil War. What is beautiful about the movie, like all of Lee's films, is that he doesn't \"side\" with his characters. He creates characters, embodies them with life, problems, and ambiguity ... and endows them with a reality that often hits far closer to home than with which many are comfortable. This film has action, but it is not for the action lover since the violence is deeply disturbing and far from gratuitous ... i.e. like the characters, it is real. And as you would expect about one of mankind's most horrific wars, the violence is horrific.<br /><br />But as an exploration of the greater human ambiguity that surely dwelt within the Civil War, it is a masterpiece. Was the war about slavery and an abolitionism? Lee seems quite willing to blur that line made so popular in depictions like the Blue and the Grey. Neither is about idealism, though, as seen in Gone with the Wind. It is about freedom, about the desire to have something which is yours and to fight for it. As you watch the characters, you will ask yourself \"how can they be fighting to preserve slavery?\" The fact is, I don't think they really are, and in that the film shows the problem of why so many were caught up in the maelstrom of the Civil War.<br /><br />The fact seems clear that many of the characters we learn about are fighting out of senses of loyalty to \"home\" though they may never have examined what home represents or whether they truly espouse its values. The letter scenes are very moving and yet subtle. Jake and Daniel are other examples of loyalty stretched to the limits. And when the tension finally snaps, and these characters find themselves suddenly \"free\" ... we see the birth of new men.<br /><br />All this mixed in with Lee's beautiful incorporation of humankind's environment with breathtaking vistas and frames. Lee has a style which is his, somehow European in its \"art\" (a slow camera, unrushed), Asian in its epic-ness and development of story, and yet somehow familiar and easily accessible to so many in North Americans.<br /><br />Relax, let go of your preconceptions about what the Civil War is, what the \"western\" as a genre is, what a war movie should be ... and let Ang Lee take you into a world so fragile, so hard, so real that few of us can comfortably see it.<br /><br />In this, Lee continues what he wrought in Ice Storm. Again, the movie is slow paced and without apparent \"direction\" ... a sure sign of Lee's ability to direct without \"imposing\" himself on the story or screen. His direction is amplified by what he brings out of Jewel (yes, the singer), a hitherto unproven actress who puts in an amazing performance.<br /><br />A movie for those who love film and are not lovers of the standard Hollywood epic.", "label": "positive"}, {"sentence1": "This movie should be shown to film school students as an example of what NOT to do. The original kicked some major tire squealing butt, this horrible disaster breaks the cardinal rule of Bruckheimer films, which is: we all know they suck, but they have great action. This film has NO ACTION. This film is BORING. Where are the cars? Where are the chases? Where's the tension? Where's the suspense? Where's the rush? Where!!?? This isn't really a movie at all, it's a bad commercial. 50 cars in 24 hours? That is wrong. They have 3 days to steal them, the ad is wrong. How bad is that? The leads acting is stiff, wooden and forced. The villain, the cop, the others...who cares. They utter their pointless lines, they serve the illogical plot. They slog through it the best they can as the music video director says \"don't worry we'll make a lot of fast cuts and no one will notice how bad the film is\" or \"we'll fix it with lots of loud music\" The \"script\" isn't really a script at all, it's more like a list of cliches with an ending that is a total ripoff of: -------Warning - possible spoiler------ 5------4-----3-----2-----1------ The Fugitive. The biggest crime of all is the underuse of Vinnie Jones, man....this is the baddest, coolest mofo since Jules in Pulp Fiction. And what do they do!? They make him a mute who's hardly in the film! Make Vinnie the main villain and he could have saved the film. How could they have been so dumb? How? How? Why? The original film is very entertaining with a cool trick at the end that gets the driver away. The original has a great 40 minute chase that delivers! Go find the original. Or if you're craving some real car chase action go rent RONIN. The chases in Ronin raised the bar by which all other car chases will now be judged. Bruckheimer and Cage had all that money, all those resources, all that experience, and they can't even come close to matching a film made 25 years ago for $250,000? How can that be? You feel like you got ripped off after seeing this movie. Where I was once excited to see Coyote Ugly, Remember the Titans and Pearl Harbor, now I say: God help us all. <br /><br />", "label": "negative"}, {"sentence1": "I love the movie. It brought me back to the best time of my life. <br /><br />We need that time again, now more than ever. For me it was a time of freedom, learning, and finding myself. I will always miss it. There will never be another time like the 60's, unfortunately.", "label": "positive"}, {"sentence1": "This was the first of Panahi's films that I have seen, I saw it at Melbourne film festival. I was totally absorbed by the different characters that he creates and how differently they react and behave compared to Aussie kids and yet on other levels how similarly. I think perhaps if more people could see movies like this, they could see people as individuals and avoid racism that can often be fueled by the fear of the unknown. There are the obvious large political differences between Oz culture and Iranian culture, but I found the more subtle differences between the characters, that this film fleshes out so successfully on screen, extremely fascinating. There are idiosyncrasies in the characters that seem to me, so unique. I found it made the characters compelling viewing.", "label": "positive"}, {"sentence1": "By no means my favourite Austen novel, and Paltrow is by no means my favourite actress, but I found the film almost totally delightful. Paltrow does a good job, and Cummings, Stevenson and the one who plays 'Miss Bates' are all absolutely terrific. The period detail is not alienating; the feel of the movie is just right, in fact. But the real 'find' is Jeremy Northam as Mr Knightley. There could not be more perfect casting, IMO. I hated Mr K in the novel, but found him wonderfully human and humane in the film. Northam's good looks and smiling eyes are no hindrance to enjoyment, either! Highly recommended. AnaR", "label": "positive"}, {"sentence1": "This \"screwy comedy\" seems very forced. Indeed, the actors TRY very hard to make a go of an essentially unfunny script. And, as a result it doesn't really go anywhere. The idea of a woman finding out she was pregnant after getting a quickie divorce just isn't all that funny. And then, when Cooper sneaks off with the baby because he doesn't want it put up for adoption just seems terribly unfunny and it's really pushing hard to turn this into a comedy. It's really a shame, too, as the actors were more capable than the script and I found myself just bored by the whole mess. Considering that Cooper made so many GOOD comedies, I recommend you see them instead.", "label": "negative"}, {"sentence1": "A truly adorable heroine who, at turns, is surprised and terrified by giblets, wrestles with mattresses, runs full-on into closed doors ... just a few of the moments that sparkle in my memory of 'The Naked Truth'. I LOVED what I caught of this show: enjoyably daft plots and some good supporting characters provided the setting for the diamond of the show - Tea Leoni as, 'Nora Wilde'; cute, clownish, and wonderfully accident-prone - How refreshing to see an actress who can clown - it's no wonder Hollyood doesn't seem to know how to cast her. But where-oh-WHERE are the DVD releases? The amount of (bleep) they release, it's incredible me that this little gem continues to remain buried. (Someone please correct me if I'm wrong.)", "label": "positive"}, {"sentence1": "This was just plain terrible. I read this book for school, i made As on all of the tests, and to see it like this! My teacher forced me and 20 other people to watch it, and it was worse than Leonard Part 6, Plan 9 from Outer Space, and Hudson Hawk put together. The thing that made this film so terrible was enough reasons to want to kill yourself over. First of all, it was made on Hallmark. Second, the acting was terrible. Third, it was like completely different from the book. Literally, it was so bad I asked myself to be excused. Basically, I would rather watch Basic Instinct 2 than watch this. Take my advice, don't watch this film. No one would want to watch this. It was horrible. HORRIBLE!", "label": "negative"}, {"sentence1": "A good cast is appallingly wasted in this slower than molasses and haphazardly connived comedy. Peter Ustinov tries hard here to bring something to life but the result is a dour bore that misses all the right beats that might have made it watchable. Regardless of the favorable comments here, this film is awful. Badly directed. Badly edited. Badly acted. Badly written. You need to sit through a hundred movies to come across one this bad.<br /><br />The muddled and excruciatingly laggard plot concerns Ustinov conning his way into an American insurance company in order to hack their computer and embezzle millions of pounds. How he does it is beyond lameness and credibility (he just learns his computer skills seemingly overnight by reading some pamphlets, and hoodwinks computer expert Robert Morley into going to South America and stealing his identity).<br /><br />As a side plot, Ustinov romances fellow loner Maggie Smith, who just happens to become his secretary by chance after he gets a flat in her building. She ends up sharing scenes that have sexual undertones with Bob Newhart that go nowhere, while Ustinov goes about grafting the money bit by bit and trying to keep one step ahead of Newhart and Karl Malden. Then he Marries Smith and they fly off to Brazil, which has become the staple finale of almost every British caper comedy since (Nuns on the Run? A Fish Called Wanda?)<br /><br />The surprise twist of an ending is more laughable than everything that came before. By the end I was thinking I must be truly off my rocker to stick out drivel like this. Even a cameo by Cesar Romero didn't help it. One of the most unfunny, poorly paced 'comedies' I've ever seen, and certainly the worst caper. Don't waste your time. If you love this you need to see better films.", "label": "negative"}, {"sentence1": "Greetings again from the darkness. How rare it is for a film to examine the lost soul of men in pain. Adam Sandler stars as Charlie, a man who lost his family in the 9/11 tragedy, and has since lost his career, his reason to live and arguably, his sanity. Don Cheadle co-stars as Sandler's former Dental School roommate who appears to have the perfect life (that Sandler apparently had prior to 9/11).<br /><br />Of course the parallels in these men's lives are obvious, but it is actually refreshing to see men's feelings on display in a movie ... feelings other than lust and revenge, that is. Watching how they actually help each other by just being there is painful and heartfelt. Writer/Director Mike Binder (\"The Upside of Anger\", and Sandler's accountant in this film) really brings a different look and feel to the film. Some of the scenes don't work as well as others, but overall it is well written and solidly directed.<br /><br />Sandler and Cheadle are both excellent. Sandler's character reminds a bit of his fine performance in \"Punch Drunk Love\", but here he brings much more depth. Cheadle is always fine and does a nice job of expressing the burden he carries ... just by watching him work a jigsaw puzzle.<br /><br />Support work is excellent by Jada Pinkett Smith (as Cheadle's wife), Liv Tyler (as a very patient psychiatrist), Saffron Burrows (in an oddly appealing role), Donald Sutherland as an irritated judge and Melinda Dillon and Robert Klein as Sandler's in-laws.<br /><br />The film really touches on how the tragic events of that day affected one man so deeply that he is basically ruined. In addition to the interesting story and some great shots of NYC, you have to love any film that features vocals from Chrissy Hynde, Bruce Springsteen and Roger Daltrey ... as well as Eddie Vedder impersonating Daltrey. Not exactly a chipper upbeat film, but it is a quality film with an unusual story.", "label": "positive"}, {"sentence1": "Somewhat funny and well-paced action thriller that has Jamie Foxx as a hapless, fast-talking hoodlum who is chosen by an overly demanding U.S. Treasury Agent (David Morse) to be released on the streets of New York to find a picky computer thief/hacker (Doug Hutchinson), who stole forty-two million dollars from the treasury and left two guards shot dead.<br /><br />\"Bait\" marks the sophomore feature for Antoine Fuqua (\"The Replacement Killers\") and he handles the task fairly well even though it doesn't top his first movie. What the two films have in common is the action sequences, which are flat-out excellent.<br /><br />Foxx is pretty good here although his character is annoying in the beginning, but throughout the film, I began to catch on. Hutchinson is marvelous as the mastermind who can be ruthless as John Malkovich and patient as the late Laurence Olivier was in \"Marathon Man\". Morse is okay as the agent who comes up with the ingenious plan to get whoever did it at all cost.", "label": "positive"}, {"sentence1": "I always wrote this series off as being a complete stink-fest because Jim Belushi was involved in it, and heavily. But then one day a tragic happenstance occurred. After a White Sox game ended I realized that the remote was all the way on the other side of the room somehow. Now I could have just gotten up and walked across the room to get the remote, or even to the TV to turn the channel. But then why not just get up and walk across the country to watch TV in another state? \"Nuts to that\", I said. So I decided to just hang tight on the couch and take whatever Fate had in store for me. What Fate had in store was an episode of this show, an episode about which I remember very little except that I had once again made a very broad, general sweeping blanket judgment based on zero objective or experiential evidence with nothing whatsoever to back my opinions up with, and once again I was completely right! This show is a total crud-pie! Belushi has all the comedic delivery of a hairy lighthouse foghorn. The women are physically attractive but too Stepford-is to elicit any real feeling from the viewer. There is absolutely no reason to stop yourself from running down to the local TV station with a can of gasoline and a flamethrower and sending every copy of this mutt howling back to hell. <br /><br />Except.. <br /><br />Except for the wonderful comic sty lings of Larry Joe Campbell, America's Greatest Comic Character Actor. This guy plays Belushi's brother-in-law, Andy, and he is gold. How good is he really? Well, aside from being funny, his job is to make Belushi look good. That's like trying to make butt warts look good. But Campbell pulls it off with style. Someone should invent a Nobel Prize in Comic Buffoonery so he can win it every year. Without Larry Joe this show would consist of a slightly vacant looking Courtney Thorne-Smith smacking Belushi over the head with a frying pan while he alternately beats his chest and plays with the straw on the floor of his cage. 5 stars for Larry Joe Campbell designated Comedic Bacon because he improves the flavor of everything he's in!", "label": "negative"}, {"sentence1": "this dolph lundgren vehicle is a fun die hard throwback action flick, it isn't going to win any awards and its not very original but it delivers the goods you would want to see from a dolph lundgren movie. our man dolph is an ex soldier who is now a teacher at a tough inner city high school and when it gets taken over by terrorists its up to him to save the day. sure the script isn't going to win any Oscars its good fun and it has its fair share eplosive action. dolph lundgren gives a good enough performance but he comes alive more in the action scenes, and the rest of the cast are not the best actors but they hold it well. all in all detention is an enjoyable action flick, but youv'e seen it a million times before.", "label": "positive"}, {"sentence1": "Truly amazing film, the concept as a possible prophetic vision of the future is frightening. A world vastly overpopulated, unbearable heat due to the damaged ozone layer, and all our natural resources spent. In this nightmarish degenerate society we have the great Charlton Heston as a likable film noirish style detective trying to fathom the truth behind a murder, opposite the film noir legend Edward G Robinson turning in a fine last performance.<br /><br />One of the images that will always stay with me from this film, is the masses of people that populate the stairwells and the way in which Thorne (Heston) has to hop through them every time he uses them.<br /><br />The movie's use of music is note worthy too, although it contains no score in the usual sense, The opening theme is good, and the subsequent snatches of music we here in Simonson's apartment, and especially the Beethoven pieces in the euthanasia clinic are outstandingly atmospheric.", "label": "positive"}, {"sentence1": "A good deal of running around. A badly conceived adversary with very little complexity. A scientist who works in communications sending off signals into space and receiving them, gets caught up with aliens. Along with his pretty wife, he invades their territory and is given secrets about them. He becomes rather traitorous in the process. Granted, he is given little choice anyway. There is a scene where he gives them everything they want. This is a dull movie with lots of long stretches where little happens. The plot isn't technically bad. It's just that we are usually following a car, a trip through a woods, investigating a building. This is what editing is all about. I suppose the story wouldn't technically support much more. Not much here.", "label": "negative"}, {"sentence1": "Have not seen this 1958 film in a very long time and greatly enjoyed Kim Novak playing the role as Gil Holroyd who is an actual witch and has an aunt named Queenie Holroyd who is also a witch and Gillian also has a brother warlock named Nick played by Jack Lemmon. When Gillian sets her eyes on Shep Henderson,(James Stewart) who is engaged to a girl he is going to marry; Gillian performers some magic spells with a cat and changes his mind about his intended bride and then becomes very lust full and falls in love with Gillian. The story tells that a real witch cannot fall in love, blush or cry and this begins to prove a big problem between Shep and Gillian, so Nick and Aunt Queenie decided they have to do something about this situation. Great film to view over and over again and a great classic film from 1958.", "label": "positive"}, {"sentence1": "I began watching a replay of this TV movie on a Sunday afternoon, thinking it was just another dumb airplane disaster flick. I was wrong.<br /><br />\"Pandora's Clock\" is an intelligent political thriller that is far beyond the quality of most TV movies. It could just as easily have made its debut on the big screen.<br /><br />The cast is excellent, including veteran actors Richard Dean Anderson, Edward Herrmann, Robert Guillaume, and Robert Loggia. Daphne Zuniga turns in one of her best performances as a medical specialist working for the CIA, and Frasier's Jane Leeves is also very good. <br /><br />The dialogue is well-written and the story is compelling throughout. In fact, the final hour is so filled with plot twists and suspense that you can't leave your seat for a second. If you get a chance to see this movie, invest the time -- nearly four hours. You will be richly rewarded!", "label": "positive"}, {"sentence1": "OK this movie was made for one reason and one reason only TO MAKE MONEY!!The producers obviously didn't care about killing a classic horror movie. I knew this movie would suck as soon as it was going to be a pg-13 how many pg-13 slashers movies have turned out to be good? Thats like asking how many women have been on the moon? The answer is NONE!! Prom night 1980 was of cource no masterpiece but it certainly deserves to be recognised as a movie that stays true to its genre and deosnt try to be anything more than that.<br /><br />My problem with Prom night 2008 is the way that it handles the killer and i have 3 major problems with him.....................<br /><br />1)The way he escapes, he was locked up in a mental institute and he escapes through a air conditioning vent!! WHAT THE HELL? why would they have an air conditioning vent in the patients room? Do they want him to be comfortable during his stay or something? 2)His intentions are somewhat uncertain the killer want all of the main victims family and friends dead so he can have her all to his self, he says he loves her but the next minute he trys to kill her, so does he want to kill her, love her or just plain rape her?? 3) The killer is too good, how did he develop all of his skills? He used to be a teacher, so in this one scene where he kills the main victims boyfriend while hes basically on top of her asleep and she doesn't notice, it all silly 2 stars out of 10 terrible,silly,stupid attempt at a horror movie", "label": "negative"}, {"sentence1": "I think everyone was quite disappointed with this sci-fi flick. For one thing, it was directed by Tim Burton. Another thing, it's a remake of what is supposed to be a classic. I found it boring, gross, and ridiculous. If you've seen it, you know what I mean. Just about everyone at Imdb say it's crap and boy, are they right! If you haven't, avoid it. It's a snorer. 1 out of 10.", "label": "negative"}, {"sentence1": "This is a strange sex comedy because there`s very little comedy but a whole lot of sex , most of which takes place in the back of a car and is so graphic it makes BASIC INSTINCT look like an edition of TELETUBBIES . I kid you not , the sex in this film is so in your face it might just choke you , especially if you`re watching with your grandparents .<br /><br />As for the rest of RITA , SUE AND BOB TOO there`s not much else worth mentioning except the language where every single sentence seems to contain the F word . This a rather bleak hyper-realist British film made at a time when Channel 4 was the main investor in British movies which explains its made for television low budget feel", "label": "negative"}]