[{"sentence1": "Purple Rain... what else can i say, the title speaks for itself. But i think all the actors were well picked. The movie had a great story. I loved it! Ever since i watched that movie, i've been stuck in the eighties, and I'm only 13! My favorite part of the movie was when his father died and he was picking up all of his music compositions, and the Apollonia was sitting on the stairwell with his earing in her hand. Critics say that its a drama but i think its more of a romance. Murphy Brown also did a great job in the movie, he actually acted like himself. I'm so glad I've seen this movie. The song Purple Rain, beautifully sung, was so heartfelt. I cried more than once.", "label": "positive"}, {"sentence1": "The writers and producers of this little outing have plummeted new depths of depravity. Did writer's block set in so badly, OR had ideas dried up so much, that they were forced to include a disgusting scene where a young woman defecates in the back seat of a van, and then promptly throws the excrement at the car behind (mind you at least this summarises what this film is worth). We had already been treated to one of the other women urinating over one of her friends at gunpoint, as well as numerous episodes of graphic vomiting; once would have sufficed... we got the message! This really is taking toilet humour to another level! Had the script and acting been better then I could have easily forgotten that I was watching a film shot entirely on low budget video. This was a fairly original storyline, with a clever (the only) piece of direction in that we only ever got to take the viewpoint from inside of the van; thus making it feel much more real. We never got to see inside any other locations, such as the store or the field where several of the women disappeared, and this could have added much needed tension.<br /><br />The script was dire. Lines like: 'I don't feel too good... I want to go home' after one of the girls has been pursued by a psychopath; subjected to rape by a screwdriver and shot at, seem a little undercooked.<br /><br />The acting was diabolical (apart from the maniac). Did all the main 5 actresses in this learn acting by taking a correspondence course during a long postal strike! The sound was so bad that I had to watch the entire film with the subtitles on.<br /><br />The director seemed to have an easy job in this. It seems that the only direction he must have given was: 'Scream girls'.<br /><br />AND AS FOR THE SCREAMING...... If you watch this please be sure to have some paracetamol at the ready!", "label": "negative"}, {"sentence1": "First things first, the female lead is too gorgeous to be missed. Now actress Wang Zu Xian, the one who played Xiao Qian in the movie, is 42 years old and well aged. It's always good to review these glorious times when seeing old-school HongKong productions like this.<br /><br />The movie is one of the most influential titles made in 1980s. The art set decoration and other aesthetic facets are all mesmerizing. More fantastically the movie had a total black humorous undertone in it. It feels like a horror movie but ultimately it's not scaring, but only fun.<br /><br />I had the experience of translating the second script of \"A Chinese Ghotst Story\", and I thought that script was a decent write. However when I saw the movie, I firstly was disappointed in seeing the movie different from the script, like in a smaller scale and involving more comic roles. However, it turned out to be better executed in terms of being entertaining.<br /><br />If you have seen the Lord of the Rings, you will notice the similarities in this movie to LOTR. The climax is like a mirror of Miranda Otto fighting with the Ring Witch. It's definitely a laugh-out-loud. Bravo!", "label": "positive"}, {"sentence1": "The characters are cliched and predictable, with everyone being either snow-white pure or wholly evil. The acting is too stilted for it to be bad in an amusing, over-the-top way. It's doubly disappointing if you're a Bette Davis fan, because her character is not a typically fun Bette-Davis-type character; she just gets to frown pensively a lot.<br /><br />On the whole, neither my wife nor I found the movie to be interesting, moving or enjoyable at all.", "label": "negative"}, {"sentence1": "Not sure if this counts as a spoiler or not, so beware:<br /><br />Just a small but crucial thing to watch for, an intriguing possibility: the boys steal a green Citroen at one point, for a joy ride, and return it to the owner having done purposeful and vengeful hidden damage to the car, hoping that the owner will crash. Is it the very same car they steal much later from the picnicking family? We know the original owner sold it. They drive off at the end on a dangerous road, one which I understand has been closed to all but pedestrians for the last ten years. A whole new slant to the end of the film.<br /><br />On another matter, this film could have been called \"Scent of a Woman\". I don't recall another film, certainly not American, that treats the scent of a woman in such a frank and open manner, much like the \"nose\" of a fine Bordeaux.", "label": "positive"}, {"sentence1": "Now, I'm one to watch movies that got poor reviews, and say, \"Hmm... this isn't so bad!\" I loved The Cable Guy, and thought that My Big Fat Independent Movie was great. Keep in mind, I really didn't start watching this with high hopes, but I figured that maybe... just maybe... it would be bad in a kind of way I could laugh at it. I was wrong. At no point at all during my suffering through this \"film\" (And I use that term sparingly) was I even close to being mildly entertained. To start, Shaq makes Quentin Tarantino look like Marlon Brando when it comes to acting. I hate rap music, but as far as I could tell, an Amish priest would probably make a better rapper than him. The main character is simply annoying, and not a character that it's easy to like. Quite frankly, I would rather eat a greasy turd out of a Harlequin fetus' bloody sores than watch this again.", "label": "negative"}, {"sentence1": "I had such high hopes for this film because I loved the original so much. It seems that Disney, however, is trying to perfect the art of crappy straight-to-DVD sequels. They deserve a razzie. Several, in fact. I thought the idea had merit, but the music was absolutely awful and the story wasn't much better. What happened to the great music Disney used to have in their films. Mary Poppins, Aladdin, Beauty and the Beast, The Lion King...even Hercules and The Hunchback of Notre Dame. They've made so many great movies over the years that it's really sad that they've sunk to point of making sequels that aren't even good enough to put in theatres.<br /><br />I hope this movie is not an indication of things to come for the Walt Disney Corporation.", "label": "negative"}, {"sentence1": "Just as the new BSG wasn't what fans of the original series were expecting, Caprica may not deliver what fans of the new BSG were expecting (for the most part). It is a very interesting, if not somewhat self-involved show, or at least the pilot is.<br /><br />If you're looking for the big CGI thrills of the (new) BSG, you'll be sorely disappointed. If you liked the drama, you'll probably find something you like and maybe even identify with.<br /><br />The storyline does examine on how the Cylons were developed, why Adama hates them and the origins of a monotheistic society. The writers also manage to tackle humans 'playing God(s)' and the creation or re-creation of 'human' life. It will be interesting to see how this plays out.<br /><br />I found it to plod along in some parts and too preachy in others, but all in all it was promising. A small part of me wishes (or hopes) there might be some minor inklings of BSG in there (aside from the back story I mentioned), but that would probably convolute the storyline too much. Like BSG, I'll have to wait and see if Caprica grows on me, but it's way too early to tell.<br /><br />It would really easy to chalk this up as a failure if you compare it to the previous series, but I'm willing to give it a chance. Overall, I thought it was interesting enough to make me see how the actual series is before 'throwing in the (proverbial) towel'.", "label": "positive"}, {"sentence1": "This is a story of a Jewish dysfunctional family. The parents have divorced and mom remains back east in the house. The father, Murray Abromowitz, moves with his children to California, and moves around Beverly Hills so that his children can get the best education possible.<br /><br />Things really become funny when Marisa Tomei, Murray's niece, comes to lives with the group.<br /><br />The film deals with the various adventures of the family complicated by the drug scene of the affluent neighborhood.<br /><br />Jessica Walter costars as a woman who wants Murray to move in with her since she wants a companion.<br /><br />Carl Reiner and Rita Moreno come in towards the end. They play Murray's brother and sister-in-law respectively; they're also the parents of Tomei. In front of the children, Reiner lets loose reminding Murray that he has been paying the bills for them all along.<br /><br />The film ends on a sour note as the embarrassed family moves out of their fancy digs and take to riding around Beverly Hills in their car. I guess the film is promoting independence and some good old self-esteem.", "label": "negative"}, {"sentence1": "Pathetic. This is what happens when director comes to work just because someone is paying him to. <br /><br />The intentions were good, great locations and settings for a film of epic proportions. But the performance, damn! I swear, in some shots you can see extras on the background staring in the camera, or looking at the actors because no one told them what they should do when they hear \"Action!\". The battle scenes are so bad you wonder - are these people for real? They could've done more damage just by hugging each other. In the slow-mo scenes you can see people on battle field walking around or just standing, waving their hands. <br /><br />Only action in the foreground is somehow emphasized. But for what? The story is so illogical and discontinuous, it seems like random situations in chronological order, sometimes not even that. The dialogs are dumb, the love plot is more embarrassing and ridiculous than in Hong Kong action movies. <br /><br />With a budget of 40 million, and you can see every dollar invested on the screen, in best case scenario, the final result of all this enormous effort is a shiny round laser disk in the thin cover placed on the shelf in video store.", "label": "negative"}, {"sentence1": "I was quite a fan of the series as a child and after that it has always remained in my mind as one of those memorable cartoons that made a difference in the early 80s compared to previous animated series (Heidi, Barbapapa, Il Etait une Fois l'Homme..., most of which I love). I find that other similar Japanese cartoons of this kind released later can't match Mazinger Z, as they started to boringly repeat the same pattern.<br /><br />That very thing, the novelty, may be one of the best features of Mazinger Z. Another good point is its inventiveness, with so many extravagant monsters, strange devices and bizarre characters; actually, we were eager to see each new installment to find out what kind of new fiend or evil machine was awaiting us!", "label": "positive"}, {"sentence1": "Bruce Almighty is the best Jim Carrey work since The Truman Show, and was a pleasant surprise after some of his recent \"Hey Hollywood - look how good I can act!\" box office disappointments. It's great to see Jim recognizing and embracing his strengths. He won't get an Academy Award but the film itself will last longer than many of the \"awarded films\" of the Academy. He is at the top of his form in this most recent film - it's like the return of an old friend.<br /><br />Carrey, Freeman, and Aniston all do a great job together - comfortable in their comedy roles, superb comic timing, and obviously having fun together but without the \"hey mom - look how funny I am\" type of comedy. A real surprise was Steven Carrell as Carrey's nemesis (Carrell of The Daily Show fame), who walked away with some the best and funniest scenes of the film. I laughed harder at Carell than anyone else in the past three years.<br /><br />I can foresee the religious nuts in the US will be up-in-arms over the treatment of God, but the bottom line of the film is true to all major theological beliefs - we are masses of protoplasms trying to get through our short lives by exercising our free will. Without Married With Children t o complain about, this will likely become a target of people with misplaced priorities (who know the types - men adorned in gold watches on Sunday morning and late nigh television, selling prayers to God). And, again, about 0.5% of the country will care and 80% of the media will report it.<br /><br />The bottom line: this a purely entertaining film, each audience member laughingly wondering what they would do, and a feel-good feeling at the movie conclusion. A walk down any major street in America has to confirm that God has a tremendous sense of humor. What better comic genius to remind us of that than Jim Carry.<br /><br />Thanks again, Jim -- it's GREAT to have you back!!", "label": "positive"}, {"sentence1": "as a habit i always like to read through the 'hated it' reviews of any given movie. especially one that i'd want to comment on. and it's not so much a point-counterpoint sorta deal; i just like to see what people say on the flipside.<br /><br />however, i do want to address one thing. many people that hated it called it, to paraphrase, 'beautiful, but shallow,' some even going so far as to say that norm's desire yet inability to help his brother was a mundane plot, at best.<br /><br />i'd like to disagree.<br /><br />as a brother of a sibling who has a similar dysfunction, i can relate. daily, you see them abuse themselves, knowing only that their current path will inevitably lead them to self-destruction. and it's not about the specifics of what they did when; how or why paul decided to take up gambling and associating with questionable folks; it's really more how they are wired. on one hand, they are veritable geniuses, and on the other, painfully self-destructive (it's a lot like people like howard hughes \u0097 the same forces which drive them are the same forces which tear them apart) and all the while you see this, you know this, and what's worse, you realize you can't do a damn thing about it.<br /><br />for norman maclean, a river runs through it was probably a way to find an answer to why the tragedy had to occur, and who was to blame. in the end, no one is, and often, there is no why. but it takes a great deal of personal anguish to truly come to this realization. sometimes it takes a lifetime. and sometimes it never comes at all.", "label": "positive"}, {"sentence1": "While not as famous as some of their other collaborations (such as THE BLACK CAT and THE BODY SNATCHER), this is a dandy little horror film even though the casting decisions were a bit odd. Boris Karloff plays Dr. Janos Rukh, a weird scientist who lives in the Carpathian mountains--near where the Dracula character's home town. Bela Lugosi plays Dr. Benet--whose nationality was never discussed though the name certainly sounds French. I really think it would have made sense to have the two switch roles, as the Carpathian role seems tailor made for Lugosi--especially with his accent. However, despite this unusual twist, the two still did excellent jobs. Karloff's was definitely the lead role, but Lugosi acquitted himself well as a relatively normal person--something he didn't play very often in films!! It seems that Dr. Rukh is a bit of a pariah, as other scientists (especially Benet) think his theories are bizarre and nonsensical. However, over the course of the film, Rukh turns out to be right and Benet is especially generous in his new praise for Rukh. But, unfortunately, the wonderful new element that Rukh discovered has the nasty side effect of turning him into a crazy killing machine (don't you hate it when that happens?). While this could have just been a simple nice scientist turned mad story, the plot was well constructed, the characters nicely developed and the mad Rukh was NOT a one-dimensional killer, but complex and interesting.<br /><br />This film is bound to be enjoyed by anyone except for people who hate old horror films. You can really tell that Universal Pictures pulled out all the stops and made a bigger-budget film instead of the cheap quickies both Lugosi and Karloff unfortunately gravitated in later years. Good stuff.", "label": "positive"}, {"sentence1": "What can I say? An excellent end to an excellent series! It never quite got the exposure it deserved in Asia, but by far, the best cop show with the best writing and the best cast on televison. EVER! The end of a great era. Sorry to see you go...", "label": "positive"}, {"sentence1": "Very outdated film with awful, cliché-ridden and mawkish dialog and a very poor construction. In addition, Cassavetes and Falk overact constantly. A pseudo \"good movie\". It takes no time to discover how catastrophic this intellectual turkey is. The first scene is a total bore, filled with histrionics and hysteric exchanges. The sound is horrible. Camera movements are without imagination as is the building of characters. No poetry, no subtle psychology, no interesting shots. The actors smoke constantly and we see ads for beer beverages. Very cheap, indeed. (one exception : Ned Beattie\"s nice and simple way of playing the hit man).", "label": "negative"}, {"sentence1": "a friend of mine bought this (very cheaply) and decided to give it to me as a birthday present. i thought i'd never watch it 'cause i knew it was a joke and the cover of the DVD looked pathetic, but then my friends and i got really bored and watched it. from start till finish! i know quite an accomplishment but it really is a masterpiece. it's hard to describe. you should see it, it's a real lesson on what people are capable of when they believe they're creative and smart and really aren't. The \"acting\" is sous-terrain (you can actually see the \"leading lady\" laugh on some occasions, she's definitely the worst). the \"story\" is to stupid to be summed up and really everything in this film sucked. please, pay special attention to \"the sheriff\". the guy is an adult and therefor has absolutely no excuse to be involved in this. he's extremely bad as well. whatever it did have some hilarious moments. check it out, haha", "label": "negative"}, {"sentence1": "Final Score: 0 (out of 10)<br /><br />***Possible scene specific spoilers (but who the hell cares)***<br /><br />Yes, that's right: zero. And I rarely give 1's. Even for the lamest of movies I look for things like music, cinematography, imagination, it's humor, even a good pace to be as objective about the score as possible. Looking at it within it's own genera or subgenera. But there is absolutely nothing redeeming here. I can't remember another time a movie actually sent me pacing up and down the room when it was over. The only reason I made it to the end was because I couldn't seem to change the channel - I sat there simply aghast, watching to see what insultingly stupid bit it would come up with next. It was like watching a snake digest a rat. <br /><br />But let's have some fun and pull this baby apart, shall we. First of all, There is nothing technical about \"Whipped\" that works. The visuals are all sitcom style. The cut scenes all just pictures of the street traffic going by at night over and over. The music and score, not only doesn't contribute anything to the movie - it's obnoxious. Not to mention it doesn't have anything to contribute to anyway. The acting is as cardboard as it comes, all around and that goes for Amanda Peet (clearly the \"star\" that got this train wreck green-lighted) too. These guys, supposedly good friends, have no more chemistry or sense of purpose then if director Peter M. Cohen had rounded them up at a bus station minutes before shooting.<br /><br />On the creative side, there isn't an original bone in it's body. It has no imagination. It shows us nothing we haven't seen a thousand times before. The whole premise, or \"twist\", of this movie is based on male-bashing and the \"idea\" that an empowered women can play men \"just as they get played\". Anybody, that thinks this is somehow a twist or is in any way original has obviously never turned on a TV before. Twisted, shallow women are common. Male-bashing is the norm. It's not stealing from anything specifically, it's worse: it's stealing from clichés. I can't imagine a women making a movie that depicted other women based so much on stereotypes and with this sense of contempt. Makes me want to go rent \"In the Company of Men\" - or better yet, \"There's Something About Mary\". This movie wants to be a \"edgier\" version of \"There's Something About Mary\" so bad you can see the sweat. <br /><br />The movie has no insights into women, men, dating, sex, or really anything. Cohen is simply content to regurgitate myths he has been indoctrinated with from other sexist movies. On the other end, the movie doesn't work as a satire either, because even though it is ripe with exaggerations one could view as \"satirical\" it doesn't have that grounding in reality that satires need. It doesn't even know what it's satirizing. Then there's the dialogue, which is little more then the characters screaming obscenities at each other. Example: Character 1: \"F**k you\" Character 2: \"Oh yeah, well f**k you\" (repeat)<br /><br />And the bottom line, the thing that could excuse all the other discretions: There are a lot of movies without plots, without good acting, with morally repulsive characters and obscenity laced dialogue that have been funny and thus, been good. \"Whipped\" ain't funny. Not for a second. It has no comic skills or timing. The situations are all completely phony, not based in any shred of truth, especially enough to wring laughs out of us. The characters all broadly drawn so they will SEEM relatable to the lowest of the lowest common denominator. Just look at \"the marquee scene\", \"cult classic\" hair gel scene. One of our bumbling anti-heroes opens the medicine cabinet and sees Mena (Peet)'s vibrator. For some reason light shines down on it as if he's found the holy grail. Why Cohen thinks men react this way to vibrators I do not know. While he rubs it on himself, he drops it in the toilet and then attempts to fish it out with his bare hands when, oh my, Mena walks in on him. Oh, my sides. <br /><br />But strangely enough, people actually like this movie. Of course, people also like \"Friends\" and reality dating shows so I shouldn't be surprised. All of this has a common thread however. \"Whipped\" is big evidence to me that there is just a huge pocket of people in America that will laugh at any joke just because it is about sex. They will like any show or movie (or think they like it) just because it is about dating or relationships. It's lack of any quality has no baring on these people. Just as people are indoctrinated to want whiter teeth and thinner bodies to sell toothbrushes and weight loss programs, they are also indoctrinated to blindly lap up anything dating/relationship related to sell them cheap, empty, effortless TV, movies and any number of products. <br /><br />The only consilation will be that when I die, because I saw this movie, I've got a credit to get 80 minutes of my life back. <br /><br />", "label": "negative"}, {"sentence1": "I noticed that this film has taken the brunt of a lot of insults. It probably earned some of them, but it wasn't that bad. Well, I'll be honest: I never want to see this film again. It was a bad film. But I don't hate this film, it tried to tell a story. As a drama, this film could work very well actually. I just think the filmmakers misgauged which road to take when they made this (they should have added more funny bits if they wanted it to be a comedy). With a rewrite, it could have been a great film. But as a satire, it didn't work in its current form -- many scenes did not fit within the context of the plot: for example, the robbery scene makes little sense in the story. Still, it wasn't the worst independent film ever made -- is it in the Top 10 Worst? That's debatable.", "label": "negative"}, {"sentence1": "We see a body of dead girl in a morgue with the coroner trying to close the eyes of the girl, but whatever he tries they won't stay open. After this we move into the future and we follow a group of former school friends who hide a terrible secret, but suddenly they start getting picked off one by one in many grisly ways. Through flashbacks we learn of this awful suicide of a shy girl who was trying to be one of the group, but she was shut out by them because they dug up her past and found out some weird occurrences. So, is she back from the grave seeking revenge? <br /><br />Oh what a great and always spooky story! Well, that's what I hoping I could say. And 'hoping' was as good as it got. This is an forgettable, so-so supernatural horror flick that I actually watched before, but I went in thinking it was my first viewing. So to my surprise it hit me when I started picking up on certain things, but like I said it's quite a forgettable mix that it felt like a first viewing again. \"Nightmare' is just another type of it's field that adds a 'few' changes to the gruel. Oh, please give me something that's a bit more fresh. It doesn't have to be entirely original, but this is one formulaic and at times quite tired J-horror flick. Even though it strings along the usual ghost story involving you guessed right\u0085 an evil looking, vengeful chick spirit.<br /><br />But in spite of my negativity of it being the same old, same old story and jolts. This one kind of entertains when its being grisly and popping in some creepy visuals. The deaths are vividly displayed with bite and some originality. While, the gloomy atmosphere alienates the audience with it's murky lighting. The first scene involving the spirit terrorising one of the girls is one blood-curdling experience, but really when it's not trying to shock you. I found it rather coma inducing and I thought about getting some shut-eye. That might be harsh, but it just didn't go anywhere of any interest between those shock moments. You could say that because the supposed mystery is really not much of one, the unsure story is just simply flat and the characters are a self-centred bunch that you don't really care what happens to them. The disjointed story should have focused more on the spirit than that of these bland characters who have one unconvincing group relationship. It just overplayed its cards by becoming overly muddled and taking too long to get going that when it comes to the climax it's just plain ludicrous. The film's haunting ending is a high point, though.<br /><br />The film looks fine, although it could have done without the snazzy, quick fire editing and the music score was a bit overbearing in playing up the mood. The performances tread a fine line, but Gyu-ri Kim is strong in the lead role.<br /><br />It's nothing new and it shamelessly steals ideas, but if you can look past that it delivers some nasty thrills. Although, I found the handling of it rather lethargic, despite the odd effective chills. A standard effort all round I guess, but still it's equally missable.", "label": "negative"}, {"sentence1": "Why is this show so popular? It's beyond me why people like it. I think it's one of the worst sitcoms out there. <br /><br />Because it's so popular, I've tried more than once to watch it and I can't make it through an entire episode.<br /><br />For one thing, the acting is horrible. Everybody is overacting to the point where it's annoying to watch. They talk in unnatural voices, use unnatural tones, and have unnatural body language. I've seen better acting in a kindergarten school play.<br /><br />For another thing, it's NOT FUNNY. The plots are dull. They're not creative, intelligent, or FUNNY. Shouldn't a sitcom be funny?? Why am I not laughing?<br /><br />Lastly, what is seventies about this? It's about as authentic to the seventies as \"Happy Days\" was to the fifties.<br /><br />OH and what is up with Ashton Kutcher? Who cast this untalented dweeb? And now he's making movies?? Oh, save us all!<br /><br />If people think this is quality television, it worries me.", "label": "negative"}, {"sentence1": "With a cast list like this one, I expected far better. Venessa Redgrave spent the majority of the movie lying in bed. The best actresses in the world cannot make anything very interesting when their acting is limited to lying down and falling asleep throughout the entire movie. The plot summary says that a secret is revealed to the daughters as their mother comes closer to death. The thing is, she never tells her daughters anything except cryptic advice to be happy. All the relationships in the movie are underdeveloped. I also felt that the back and forth between the past and present was unnecessary. It seemed as if the idea was stolen either from the book the Da Vinci Code in which the device was used to increase suspense, or from The Notebook in which they used the device to create the never ending romance of the story's main characters. Either way it was a cheap device in this movie because it didn't work to create anything. It was a way to attempt suspense in a movie that has none. I left wondering why good movies can't be written for women. It really was a disappointment.", "label": "negative"}, {"sentence1": "As a baseball die-hard, this movie goes contrary to what I expect in a sports movie: authentic-looking sports action, believable characters, and an original story line. While \"Angels in the Outfield\" fails miserably in the first category, it succeeds beautifully in the latter two. \"Angels\" weaves the story of Roger and J.P., two Anaheim foster kids in love with baseball but searching for a family, with that of the woebegone Angels franchise, struggling to draw fans and win games. Pushed by his deadbeat father's promise that they would be a family only when the Angels win the pennant, Roger asks for some heavenly help, and gets it in the form of diamond-dwelling spirits bent on reversing the franchise's downward spiral. And, when short-fused manager George Knox (portrayed by Danny Glover) begins believing in what Roger sees, the team suddenly has hope for turning their season around--and Roger and J.P. find something to believe in. Glover in particular gives a nice performance, and Tony Danza, playing a washed-up pitcher, also does well, despite clearly having ZERO idea of how to pitch out of the windup!", "label": "positive"}, {"sentence1": "If you ever hear these three words uttered to you...\"Joe Don Baker\", be afraid...<br /><br />Final Justice is the low budget action movie based on a sheriff in a Texas town named Geronimo (pronounced as Heronimo). He's an ugly, slimy, rude character who is on the hunt for a criminal in Malta who killed his partner in Texas. His partner actually slumps down twice in the movie. Very bad editing. Joe Don Baker (Geronimo) ends up in jail like 4 or 5 times in this movie, making the plot go nowhere fast. Plus, he shoots everybody like he's in the wild west. I guess nobody told him it was the 20th century. A woman cop is assigned to show him around Malta (who looks like Elaine from Seinfeld) and she is the only one who can put up with the redneck. She must be insane!<br /><br />The strippers in the bar are the most entertaining characters in this movie. Their dancing is shown throughout the film and I began to bond with the sleazy women. Well, at least it was better than watching Geronimo try to dumb his way out of something. The ending is flawed and somewhat predictable, and I was happy it was finally over. You'll never forget that last line of Joe Don Baker from the movie.<br /><br />It's so hard to imagine how he was in THREE Bond movies...very weird! Anyway, if you're up for a laugh, then see this one on MST3K sometime. Also, I've heard his other bad movie (among many), \"Mitchell\" MST3K version is being released on DVD by Rhino. I can't wait to see that!", "label": "negative"}, {"sentence1": "The unlikely duo of Zero Mostel and Harry Belafonte team up to give us some interesting performances and subject matter in The Angel Levine. It's one interesting twist on the themes from It's A Wonderful Life.<br /><br />Zero is married to Ida Kaminsky and the two of them belong to a special class of elderly Jewish poor in New York. Mostel used to be a tailor and proud of his trade, but his back and arthritis have prevented him from working. Kaminsky is mostly bedridden. He's reduced to applying for welfare. In desperation like Jimmy Stewart, he cries out to God for some help.<br /><br />Now maybe if he had gotten someone like Henry Travers things might have worked out differently, but even Stewart had trouble accepting Travers. But Travers had one thing going for him, he was over 100 years off this mortal coil and all his ties to earthly things were gone. God sent Mostel something quite different, the recently deceased Harry Belafonte who should have at least been given some basic training for angels before being given an assignment.<br /><br />Belafonte hasn't accepted he's moved on from life, he's still got a lot of issues. He also has a wife, Gloria Foster, who doesn't know he's passed on, hit by a car right at the beginning of the film. You put his issues and Mostel's issues and you've got a good conflict, starting with the fact that Mostel can't believe in a black Jew named Levine.<br /><br />This was the farewell performance for Polish/Jewish actress Ida Kaminsky who got a nomination for Best Actress in The Shop on Main Street a few years back. The other prominent role here is that of Irish actor Milo O'Shea playing a nice Jewish doctor. Remembering O'Shea's brogue from The Verdict, I was really surprised to see and hear him carry off the part of the doctor.<br /><br />The Angel Levine raises some interesting and disturbing questions about faith and race in this society. It's brought to you by a stellar cast and of course created by acclaimed writer Bernard Malamud. Make sure to catch it when broadcast.", "label": "positive"}, {"sentence1": "Let me start off by saying that after watching this episode for the first time on DVD at 10 o'clock P.M. one night, I could not fall asleep until about 3:00 A.M.<br /><br />This brief review may contain spoilers.<br /><br />I'm a long-time fan of The Sopranos and I can safely say this is the best episode I've seen. I'm not saying everyone should feel this way, but I do. This episode is identical to the weekend I spent with my family, watching over my own father, comatose in the ICU before he passed.<br /><br />The episode begins with Tony in an alternate reality: he is a salesman who's identity has been mistaken for that of a man named Kevin Finnerty.<br /><br />By the time ten minutes had gone by, I knew either Tony was dreaming, or I was watching some other show. It wasn't like the normal Sopranos and I loved it.<br /><br />Option 1 is confirmed when Anthony (or \"Kevin\") looks into the sky at a \"helicopter spotlight\" and we see prodding through it, a doctor with a flashlight. We see this only for a moment and the sequence plays out until we go back to real life in a situation similar to the one I just stated.<br /><br />Tony has come out of the coma for only a moment. His boys take A.J. home and Carmella, overcome by stress, breaks down in the hallway: a signature moment in the episode.<br /><br />For the remainder of the episode, we cut in between the real world: the family dealing with the potential negative outcome of this coma, and Tony's alternate reality, which parallels what's going on both in his mind and in the real world around him.<br /><br />Then comes the stellar point in the episode: after A.J. finishes telling his mother he's flunked school, she walks in to see Meadow sitting at Anthony's side.<br /><br />She approaches Tony, and utters the best line of the episode: \"Anthony, can you hear us?\" In Tony's world, he enters a dark hotel room and turns on a light. He takes off his shoes and goes to the phone. He tries to dial, but he cannot--as if he were trying to say something back to Carmella, but couldn't physically bring himself to do so. Not yet.<br /><br />He sits down and looks out his window. A shimmering light that has reoccurred throughout the episode now seems to call to him from the other side of the city.<br /><br />\"When It's Cold I'd Like To Die\" by Moby marries perfectly with these last images and helps in creating an emotional roller-coaster of an episode.<br /><br />10 out of 10.<br /><br />P.S.: Watch the next episode. You find out what the light is. It's wonderful.", "label": "positive"}, {"sentence1": "One of the most common entries in the 'goofs' category is anachronism. Though I'm beginning to believe that anachronism and other goofs are more acceptable, even ignored, in very good films, but are found front and center in rotten films. KISS THEM FOR ME is a rotten film and reeks of anachronism, yet when watching it closely, I found almost nothing specifically anachronistic.<br /><br />The shots of aircraft which bookend the film are certainly out of place. The big 4 engine transport seen after the title \"Honolulu 1944\" appears to be the post war C-97 Stratofreighter (in MATS colors). The combat planes seen taking off from the carrier at the end are Douglas Skyraiders which entered service after WW2 and were made famous by their service in Vietnam.<br /><br />But excepting these two pieces of film and, of course, the hairstyles, everything else is very possibly period authentic. It just 'feels' so wrong. I'm an admirer of Stanley Donen, we share the same birthday. In his co directed ON THE TOWN (1949) there is a car chase at the end with the police driving 1949/50 Ford's yet there isn't the slightest feeling that this is out of place in a WW2 period film. In fact, as I reflected later, there isn't anything which says that this is supposed to be a WW2 period film. It just feels that way. Based on a wartime Broadway musical which was based on a ballet (Fancy Free) which may have been based on the work of artist Paul Cadmus (The Fleet's In! 1934) its a great film about sailors on a 24 hour pass in New York and, so heavy with wartime associations, its merely assumed it takes place during the war and yet these contemporary cars do nothing to break the spell.<br /><br />The first problem is old Cary Grant. Though far too old to represent a Navy SBD dive bomber pilot, it is a Hollywood tradition for stars like Grant, Gary Cooper (Lou Gehrig), Jimmy Stewart (Charles Lindbergh) to play younger. It was the role which he is miscast in, not his age. He plays an operator, as they used to call them. A guy who gets things done and breaks all the rules while doing it yet remains admired and loved for it. A hustler. A wheeler dealer. A de rigueur character in a service comedy. Grant is the comic center of what is after all supposed to be a service comedy which is contra to his comedy style.<br /><br />Thinking back on the great Grant comic performances like BRINGING UP BABY (1938) or ARSENIC AND OLD LACE (1944) and he is the great reactor whose comedy is to be reduced by his context from dignity to a befuddled puddle of inert jelly. IN KISS THEM he is expected to be the comic spark plug which just isn't him. People had already been exposed to the type, most recently to comic Phil Silvers as Sgt. Bilko on television. The role would be perfected later by James Garner but here Grant just isn't funny and appears to be a bully getting his way by aggressively pushing his Cary Grantness rather than cajoling and finessing.<br /><br />But the thing which really stinks the place up with anachronism is the lead women. There can be no more echt 50s women than Suzy Parker and Jayne Mansfield. They are unique to the decade. Marilyn Monroe can be placed in a continuum with Carole Lombard and Marie Wilson and any number of dumb blonds, and Grace Kelly was another high class dame (think of Mary Astor), but there never could have been an anatomically exaggerated woman in films like Mansfield. Sure there were the 'sweater girls' (e.g. Lana Turner) of WW2, but Mansfield was stretching the point. Suzy Parker was THE model who revolutionized the model business, who changed the mannequin like poses to become the first natural girl who moved and whose personality was captured by the camera (see FUNNY FACE (1957) also by Stanley Donen).<br /><br />Of course in high 50s style, there seems to be a lot of gender mixing at 'wild' parties but never even a hint of sex (think of the 50s TV shows Bachelor Father or The Bob Cummings Show where dinner jacketed men returned from 'dates' alone). The original book, which I haven't read, was published during the war and appeared as a play on Broadway at the end of the war and the nuances of the situation must have been inescapable for contemporary readers and audiences, but broken down, bowdlerized and reconstituted a dozen years later and fatally miscast, it remains a once forgotten stain on otherwise exemplary careers until the invention of the VCR and cable television resurrected this petrified turkey.<br /><br />So the lesson here is whatever the 'goof' it will be ignored in a great film like CITIZEN KANE (who actually hears Charles Foster Kane say 'Rosebud'?), and tolerated in fun dreck like WESTWORLD ( why were the robots given live ammunition in the first place?) but absolutely despised in a rotten film, even if the goofs are really non existent.", "label": "negative"}, {"sentence1": "\"The Godfather\" of television, but aside from it's acclaim and mobster characters, the two are nothing alike. Tony Soprano is forced to go to a psychiatrist after a series of panic attacks. His psychiatrist learns that Tony is actually part of two families -- in one family he is a loving father yet not-so-perfect-husband, and in the other family he is a ruthless wiseguy. After analysis, Dr. Melfi concludes that Tony's problems actually derive from his mother Livia, who's suspected to have borderline-personality disorder. Gandolfini is rightfully praised as the main character; yet Bracco and Marchand aren't nearly as recognized for their equally and talented performances as the psychiatrist and mother, respectively. Falco, Imperioli and DeMatteo are acclaimed for their brilliant supporting roles. Van Zandt (from the E-Street Band) plays his first and only role as Tony's best friend, and is quite convincing and latching. Chianese, the only recurring actor to have actually appeared in a Godfather film, plays Tony's uncle and on-and-off nemesis. Many fans also enjoyed characters played by Pastore, Ventimiglia, Curatola, Proval, Pantoliano, Lip, Sciorra and Buscemi. Tony's children are \"okay\" but not notable (with the exception of Iler's stunning performance in the third-to-last episode, \"The Second Coming\"); Sirico and Schirripa are unconvincing and over-the-top, but the show is too strong for them to hold it back. Even as the show continues for over six season, it ceases to have a dull or predictable moment.<br /><br />**** (out of four)", "label": "positive"}, {"sentence1": "The \"movie aimed at adults\" is a rare thing these days, but Moonstruck does it well, and is still a better than average movie, which is aging very well. Although it's comic moments aim lower than the rest of it, the movie has a wonderful specificity (Italians in Brooklyn) that isn't used to shortchange the characters or the viewers. (i.e. Mobsters never appear in acomplication. It never becomes grotesque like My Big Fat Greek Wedding) The secondary story lines are economically told with short scenes that allow a break from the major thread. These are the scenes that are now missing in contemporary movies where their immediate value cannot be impressed upon producers and bigwigs. I miss these scenes. It also beautifully involves older characters. The movie takes it's own slight, quiet path to a conclusion. There isn't a poorly written scene included anywhere to make some executives sphincter relax. Cage and Cher do very nice work.<br /><br />Moonstruck invokes old-school, ethnic, workaday New York much like 'Marty' except Moonstruck is way less sanctimonious.", "label": "positive"}, {"sentence1": "The film was okay, quite entertaining. The cast was pretty good, and I'll second what the comment before me mentioned - Glenn Quinn was outstanding and he alone is reason enough to watch this movie. He played the selfish \"evil\" friend and manager of the band brilliantly!<br /><br />There are a lot of songs performed by \"Beyond Gravity\" in this film, but this doesn't really come as a surprise considering the film is a VH1 production. However, if the soft rock/ pop music isn't to someone's liking one might as well flash forward those scenes.<br /><br />The plot of a band trying to make it to the top in L.A. but having to overcome many obstacles on the way isn't too original, but quite entertaining, with some surprising plot turns here and there.", "label": "positive"}, {"sentence1": "Boring. Minimal plot. No character development. I went into this movie with high expectations from the book. It COULD have been an awesome movie. It COULD have probably become a cult classic. Nope, it was a giant let-down. It was poorly cast and had horrible special effects. It was difficult to determine who were the bad guys: the rebels or the military or the church or all of them? I am still left puzzled by certain mini-plots from the movie. I am left dumbfounded as to certain aspects of this so-called \"prophecy\", which is never really FULLY explained. I felt like I was watching a corny episode of a mini-series on the sci-fi channel. It seemed very much like a made-for-TV movie. Don't go see this movie. It is a waste of time AND money.", "label": "negative"}, {"sentence1": "This film takes place in the 1950s. According to this the dead (called zombies) have arisen to eat the living. However a company has developed a collar that, when put around the zombies neck, makes them docile and perfect servants. The Robinsons mom Helen (Carrie-Anne Moss), dad Bill (Dylan Baker) and son Timmy (K'Sun Ray) hire a zombie because everyone on their block already has one. Tim names the zombie Fido (Billy Connolly) and becomes friends with him. But his dad hates him and Timmy looses control of Fido and things go wrong.<br /><br />As you can see this is--among many other things--a takeoff on the \"Lassie\" series with Fido being a stand in for Lassie. Timmy was named that for a reason! Every single of the famous Lassie episodes are spun here. My favorite is when Timmy sends Fido off to get help before the zombies eat him! Also it's a satire of those 1950s Douglas Sirk films where everything is bright and colorful--but dark secrets are tearing people apart. The characters wear VERY bright 1950s clothes (Moss is always in a dress)--the furnishings, settings and cars especially are all 1950s in hyper bright colors. Even when the script becomes repetitious there's always something to look at. The script is good--but there are only so many Lassie jokes you can make. The melodramatics are kind of silly but the cast pulls it off. Everyone here is excellent and right on target. Even Connolly as an emotionless zombie does a good job. Moss is the best--playing each line for all its worth---but never going overboard.<br /><br />This isn't for everybody (of course). The satire may be lost on most people and the gore is pretty tame. The gore is done so casually and with happy music playing over it it's hard to take it seriously. So, for some people, this will really work. I give it an 8.", "label": "positive"}]