[{"sentence1": "I approach films about talking animals with care. For every wonderful one like Babe, you get an equally poor one like the dreadful remake of Homeward Bound: The Incredible Journey. Or in the case of Cats & Dogs, you have a great idea for a film not living up to its potential. When I heard about Paulie, the premise of a wisecracking parrot didn't exactly fill me with confidence. But I found the film a pleasant surprise. And it manages to sneak its way into your heart without you realising.<br /><br />A Russian janitor, Misha Vilyenkov (Tony Shaloub) gets a job in a research laboratory. One day, he hears singing coming from the basement. And when he investigates, he finds a parrot in its cage singing its little heart out. Misha becomes fascinated with the bird, especially when it turns out the parrot can not only sing, it can talk. And not a few phrases either. Its a parrot you can actually make conversation with.<br /><br />The parrot is called Paulie (voiced by Jay Mohr), and recognises a fellow castaway in Misha. Wondering how this world to the wise bird ended up in a dusty basement, Misha convinces Paulie to tell him his life story. Which all began when he was a baby, and in the care of Marie, a five year old girl with a stutter. The two of them became birds of a feather (OK, bad pun!).<br /><br />When Marie's parents became concerned about her close friendship with a bird, they considered sending him away. And they finally did after Marie nearly injured herself in a fall after teaching Paulie to fly. Desperate to be reunited with her, Paulie begins a long journey across America, which includes a diverse number of new owners, flying great distances, and even ending up behind bars. Of a cage that is!<br /><br />Paulie was one of a number of talking animal films released by DreamWorks in the late 90s. And although it wasn't afforded the same recognition or box-office success of Babe, Paulie succeeds on quite a few levels, and is an occasional work of striking intelligence.<br /><br />Jay Mohr's stand-up style of acting is well suited to the part of Paulie. He never plays the part as too smug, even if he is a bit of a smart Aleck. Paulie's worldly, but he is also naive in his way.<br /><br />Because he's lived a rather sheltered life with Marie, when he's taken away, he has to fend for himself for the first time. And when he falls into the hands of different owners, they make promises to Paulie to reunite him with Marie, which he believes. Only for those promises to be broken time and again.<br /><br />Paulie is admittedly a little episodic. It follows the eclectic people Paulie ends up with, and how he slowly gets brought closer and closer to Marie. He first winds up in a pawn shop, where he is adopted by Ivy (Gena Rowlands), a kindly woman who teaches him the meaning of manners. She sympathises with Paulie's situation, and drives an RV across America to find Marie.<br /><br />Paulie is an occasionally very touching film. His scenes with Ivy are some of the best. Wonderful moments of Paulie perched on her shoulder singing Tom Jones numbers. The way she instills in him the need for hope is great, and some of the dialogue is quite well written and even thought-provoking: <br /><br />\"There are things in life you put off, because you think you're gonna do them later. But the real thing Ivy taught me is you gotta live like there may not be a later.\"<br /><br />The scene where Ivy passes away en route leaving Paulie all alone is a very heart-rending moment. And the sequence where he plucks up the courage to fly for the first time across the Grand Canyon, soaring majestically is such a beautifully composed scene it stays with you for hours after the film's over.<br /><br />Despite the occasional sad moment, there are plenty of laughs to be had. Paulie falls in with a group of performing parrots at a Spanish outdoor restaurant. The animatronic effects here are really excellent as four birds do a perfectly choreographed dance number. And Paulie even gets to have a romance. Which is dashed when he falls in with a petty thief (played by Mohr as well). That may be the only complaint I have. As soon as you get comfortable with one situation, the film then moves Paulie on to another.<br /><br />The scene where Paulie is taught to steal money from ATM machines is funny, but a little disturbing too. I'm amazed DreamWorks were granted the chance to include such a scene in a kids film. And Paulie's diamond robbery is very Mission Impossible. He's caught in the act, and shipped off to the lab for animal testing, where he's remained ever since.<br /><br />The story finally comes full circle at the lab, where Misha vows to help Paulie. Of course they do find Marie. But the final revelation is a scene of such shocking intensity, I was left numb for several minutes. Paulie may never get the longevity Babe has, but I believe its an equally brilliant film. The same laughs. The same flawless effects. And the same surprising intelligence.<br /><br />A minor gem.", "label": "positive"}, {"sentence1": "The dubbing/translation in this movie is downright hilarious and provides the only entertainment in this otherwise dull and derivative zombie flick. I haven't laughed so hard in my life as I just did watching Zombi 3 (and I've seen some really bad dubbing in my life, believe me). Seriously, the filmmakers could re-edit this movie and release it as a comedy and make millions of dollars. It's just that funny.<br /><br />But... If falling off your couch laughing at the dubbing in a Fulci zombie movie isn't your cup of tea, then AVOID THIS AT ALL COSTS.", "label": "negative"}, {"sentence1": "This movie is the best horror movie, bar-none.I love how Stanley just dumps the women into the lake.I have been a fan of Judd Nelson's work for many years, and he blew me away. Its a blend of horror, and drama ,and romance, not so much comedy. His evil, yet charming look captured me right then and there. That look in his eyes, I will never forget. There's something about him, I cant describe.", "label": "positive"}, {"sentence1": "I am from the Dallas/Fort Worth area and lived in Arlington for a few years. This movie was way off as far as making it look like Arlington. I saw mountains in the background of one scene! Texas doesn't have mountains. I guess that happens when a movie that is supposed to be in Texas is filmed in Canada. The accents are also really bad. They should have gotten actors from Texas to play the parts. There a lot of aspiring actors from Texas out in Hollywood. The movie is really sad though, because it is a true story. I pray that the killer is found and convicted. The one good thing is that bc of her death, we now have the Amber Alert to help find missing children quickly after they are abducted.", "label": "negative"}, {"sentence1": "For anyone who liked the series this movie will be something to watch. However, it also leaves you wanting more. I loved the way that every character (detective)made an appearance. Least with the ending of who is the fourth chair for they leave a reason for another movie. My guess is Bayless of course. This like the series was a very well put together series of scenes. This is a series I wish had lived on. Thanks to the cast for some wonderful TV.", "label": "positive"}, {"sentence1": "I enjoyed this movie. Unlike like some of the pumped up, steroid trash that is passed off as action movies, Playing God is simple and realistic, with characters that are believable, action that is not over the top and enough twists and turns to keep you interested until the end.<br /><br />Well directed, well acted and a good story.", "label": "positive"}, {"sentence1": "Not funny - how can anyone link this to Monty Python? That is absolutely ridiculous - there are no laughs. This is not funny. Over the top, but ugly, weird just for weird sake and it seems to me these people were on something all the time. Unfortunately something that did not make them funny.<br /><br />It should be given some points for effort etc. whatever. Actually it appears there is a laugh track - or is there one? Hummm.... Since there are barely any laughs that's a debatable question.<br /><br />Maybe I'm doing it injustice - maybe it's some sort of exercise. Some sort of art - in that case anything goes, never mind.<br /><br />But these guys playing women with high-pitched voices, turned-up noses. Come on !!! Not funny. <br /><br />There is only one heir apparent to Monty Pythons intellectual wit and that is Stephen Colbert, and maybe Jon Stewart.", "label": "negative"}, {"sentence1": "End of the World is an uneventful movie, which is odd since it is supposed to be about the total destruction of the earth. The main character is some kind of scientist, I'm not exactly sure what kind. He has two jobs at a government(?) facility guarded by four security men. His first job is monitoring transmissions to and from space (although this actually seems more like a hobby he does when not working on job #2). Job #2 requires him to put on a protective suit and go into a dark room...at least that's the best I can figure. Apparently the \"plant\" is not exactly top-secret, as the scientist brings his wife there. She hangs out (they're on their way to a dinner) while he discovers a message from space: Major Earth Disruption, repeated over and over. He says something about it being the first message from space he's ever been able to decipher; his wife tells him they're going to be late for the dinner party. So they leave and go to the party (!?!). Moments later he finds out that China has suffered a major earthquake. From there, the movie goes... nowhere! Yes, Christopher Lee is in it, but that really doesn't help much. Besides, Lee gives a lackluster performance along the lines of his appearance in Howling II. This movie is boring, but it has enough stupid elements that you might want to suffer through it once if you like Christopher Lee or Z-grade sci-fi. Plus, there's lots of stock footage of the earth being destroyed.", "label": "negative"}, {"sentence1": "I have seen my fair share of comedy and standup movies but this one is so original, so fresh, it will make you wonder why you always walked right pass it in the video store. Murphy has some pretty raunchy jokes but this is just too funny to pass. If only every movie could be this funny. it should be called \"107 minutes of the most incredible comedy\" Murphy is a comic genius in this film and will make you say \"this is the guy that did dr. doulittle!\" He talkes about the ice cream man, shoe throwing mothers, his aunt with a mustache, racism, and everything else you could possibly think of and the ones you couldnt. Please if you ever see one comedy in your life this is it, if only all movies could be Delirious.", "label": "positive"}, {"sentence1": "Well, I would consider Police Story as one of Jackie Chan's best film. The plot, the fighting scenes and the stunt works are excellent. In this film, Jackie himself acted as a police officer called Chan Ka Kui (Kevin Chan in some versions) who successfully arrested a crime lord. After the crime lord was released due to lack of evidence , he framed Chan for the killing of a police officer. Due to this, he became wanted by the police. Later on, Salina (Brigitte Lin), who was the secretary of the crime lord, went to a shopping mall and started to steal the evidence of the crime lord's crimes from his computer and preparing to pass them to Chan. However, the crime lord knew that Salina had downloaded his incriminating data and hired his henchmen to capture her. Later on, Chan appeared at the scenes and began to fight all of the henchmen, defeating them one by one. At the last scene, Chan was seen punching the crime lord. Lastly, this is the best action and comedy movie. Everyone should watch it. Highly recommended.", "label": "positive"}, {"sentence1": "After looking at monkeys (oops apes) for more than one hour, I was feeling like one too. I was an ape, spending money on this movie. Please people, hold you money in your pocket and go see some funny movie like Bridget Jones's Diary..", "label": "negative"}, {"sentence1": "If I hadn't been forced to watch this for work reasons I never would have made it past the first 10 minutes. And even then I admit I fast forwarded through parts. The '63 film version was vastly superior in all regards. Yes, I've read this one is more faithful to the original play, but what a wise thing it was for the writer to change the script in '63! It's overlong, it drags, the songs that are in this version and not in the film version are boring and unimaginative. The version of \"Kids\" in the '63 version was very funny and a true classic of sarcastic parent humor. In this version the Kim is way too old, the Conrad is *absolutely horrible* to behold (when someone ripped his shirt off him I shuttered in disgust...the director of this version has no idea what sexy is.). This Conrad can't dance, can't sing (he can't even stay in tune) and is simply repulsive. If Elvis Presley had really been like that his career would have been over before it began. As for the other actors, well I kept waiting for Alexander's toupee to fall off as he danced and Daly was totally over acting as Momma. See Stapleton's performance in the film version to see the same role properly executed by someone who understands comic timing. This TV version is nothing but a total waste of anyone's time.", "label": "negative"}, {"sentence1": "I would perhaps give 6 or 7 to this propaganda film because it shows when and how a propaganda film becomes successful. If there are people who watch this piece and think that \"well then Jews must have done something to be treated the way they were treated in WW2\", then the movie is very cleverly made to conceal 'why's and 'how's as well as mix correct and false observations on how a people live. What more can a propaganda movie aim for? The part in which an American movie about the Rothschild family is included is re-used very shrewdly here, for instance. The question of why the Jew keeps his wealth away from the officer is never asked. No one mentions the system of taxation within that particular social strata.<br /><br />Besides, the level of excitement (or, the level of disgust) in the movie increases slowly and the solution-like end of the movie suits the aim and the musts of doing propaganda. The audience would leave in joy and gratefulness to the times that are coming up...well done.<br /><br />In the movie, there is a kind of simplicity that addresses the most basic emotional perception of the audience. The movie is kind of history today, so no need to fuss much about it actually. However, in this simplicity of words of ethnic degradation, a careful watcher can find relevance to today's cultural hatred, violence, decivilization as well as the problems of integration. Overall, fine trash.", "label": "negative"}, {"sentence1": "Time paradoxes are the devil's snare for underemployed minds. They're fun to consider in a 'what if?' sort of way. Film makers and authors have dealt with this time and again in a host of films and television including 'Star Trek: First Contact', the 'Back to the Future' trilogy, 'Bill and Ted's Excellent Adventure', 'Groundhog Day' and the Stargate SG1 homage, 'Window of Opportunity'. Heinlein's 'All You Zombies' was written decades ago and yet it will still spin out people reading that short story for the first time.<br /><br />In the case of Terry Gilliam's excellent film, '12 Monkeys', it's hard to establish what may be continuity problems versus plot elements intended to make us re-think our conception of the film. Repeated viewings will drive us to different conclusions if we retain an open mind.<br /><br />Some, seeing the film for the first time, will regard Cole, played by Bruce Willis, as a schizophrenic. Most will see Cole as a man disturbed by what Adams describes as 'the continual wrenching of experience' visited upon him by time travel.<br /><br />Unlike other time travel stories, '12 Monkeys' is unclear as to whether future history can be changed by manipulating events in the past. Cole tells his psychiatrist, Railly (Madeleine Stowe), that time cannot be changed, but a phone call he makes from the airport is intercepted by scientists AFTER he has been sent back to 1996, in his own personal time-line.<br /><br />Even this could be construed as an event that had to happen in a single time-line universe, in order to ensure that the time-line is not altered...Cole has to die before the eyes of his younger self for fate to be realised. If that's the case, time is like a fluid, it always finds its own level or path, irrespective of the external forces working on it. It boggles the mind to dwell on this sort of thing too much.<br /><br />If you can change future events that then guide the actions of those with the power to send people back in time, as we see on board the plane at the end of the film, then that means the future CAN be changed by manipulating past events...or does it? The film has probably led to plenty of drunken brawls at bars frequented by physicists and mathematicians.<br /><br />Bonus material on the DVD makes for very interesting viewing. Gilliam was under more than normal pressure to bring the film in under budget, which is no particular surprise after the 'Munchausen' debacle and in light of his later attempt to film 'Don Quixote'. I would rate the 'making of' documentary as one of the more interesting I've seen. It certainly is no whitewash and accurately observes the difficulties and occasional conflict arising between the creative people involved. Gilliam's description of the film as his \"7½th\" release, on account of the film being written by writers other than himself - and therefore, not really 'his' film' - doesn't do the film itself justice.<br /><br />Brad Pitt's portrayal of Goines is curiously engaging, although his character is not especially sympathetic. Watch for his slightly wall-eyed look in one of the scenes from the asylum. It's disturbing and distracting.<br /><br />Probably a coincidence, the Louis Armstrong song 'What a Wonderful World' was used at the end of both '12 Monkeys' and the final episode of the TV series of 'The Hitchhiker's Guide to the Galaxy'. Both the film and the TV series also featured British actor Simon Jones.<br /><br />'12 Monkeys' is a science fiction story that will entertain in the same way that the mental stimulation of a game of chess may entertain. It's not a mindless recreation, that's for sure.", "label": "positive"}, {"sentence1": "As an adult I really did enjoy this one. I watched it with my 2 granddaughters and the 3 1/2 year old was fascinated and the 15 month old giggled at the mice.<br /><br />The music is fun and the animation is wonderful. This sequel does what Return to Neverland didn't accomplish. A good follow-up to the Cinderella story; but what becomes of Drusilla? Another sequel? I hope so!", "label": "positive"}, {"sentence1": "This movie appears to have been made by someone with some good ideas but who also never had made a movie before nor had they considered that a script should be edited or even funny. When I saw this film, I saw it for John Candy and assumed, incorrectly, that it would be hilarious. Instead, there was a stupid plot about mind control and so many flat, unfunny moments. And, to top it off, Candy delivered some of the crudest lines I had ever heard up to that time. So, despite a potentially funny cast and story idea, we are left with an amateurish and crude movie that will probably be too stupid for the average adult, though teens will probably find a few laughs. It's really a shame--it could have been so much better. I mean, with Eugene Levy, Joe Flaherty and John Candy it SHOULD have been wonderful.", "label": "negative"}, {"sentence1": "I f you thought Sam Mendes' first film, the much heralded American BEAUTY was a movie with style to spare, wait until you see his highly anticipated second effort, the unrelentingly grim 30's gangster melodrama ROAD TO PERDITION. Some critics have hailed this new movie as a worthy successor to THE GODFATHER, a rash judgment made by several reviewers taken with Mr. Mendes' extraordinary technical prowess. If the mechanics of movie making are what make a picture great, then yes, ROAD TO PERDITION is a distant cousin to THE GODFATHER in terms of what it achieves in cinematography, editing, music scoring and sound. What it doesn't have is a resonance that all great stories and some very rare movies have that stay with the viewer long after the experience of reading or seeing it is over. As with American BEAUTY, there is a cold, distancing feel to this movie, despite some very tense scenes involving paternal love, loyalty and betrayal.<br /><br />This story of a hit man (Tom Hanks) and his relationship to a surrogate father - figure who is also his boss, an elderly Irish mob leader (Paul Newman) , seems to have been culled from innumerable gangster movies of years past. The father /son motif that hangs over this picture is so heavy handed in its treatment that there is not much room for spontaneity ; the entire enterprise has been very carefully wrought , and nearly all the dialog is delivered with an air of great portent : this is obviously a gangster film , hence the requisite amount of violence and bloodshed , but the film is nearly devoid of any humor to speak of ; only in scenes involving a young boy driving a getaway car in a cunningly edited montage is there any sense of lightheartedness to leaven the pervasive sense of doom.<br /><br />That being said , I have nothing but the highest praise for the stunning look of this film ; indeed , it is not an overstatement to say that this is one of the most beautifully photographed and designed movies I have ever seen. Veteran cameraman Conrad Hall will very likely win another Oscar for his work here . The production 's sets and costumes are just as exemplary ; in fact , the entire film is a technical marvel. Mr. Mendes continues to astonish with his vivid use of color, and he and Mr. Hall again make very dramatic use of red blood splattered against pale colored walls , all the more effective and disconcerting due to the preponderance of blacks, blues and grays that dominate the movie's color scheme.<br /><br />If I have failed to duly note the acting , it is not because the actors do not purport themselves ably ; everyone in the film is top notch, with special mention going to the two malevolent bad guys : Daniel Craig is the classic \"man you love to hate\", the spoiled, impulsive son of Newman's gangster father ; and an almost unrecognizable Jude Law as an especially slimy miscreant who goes on pursuit of Hanks and his son and figures very importantly in the film's riveting second half. But acting in a movie this dazzling is bound to take a back seat to the photographic fireworks on display here. If a Rolls-Royce was a movie , I've no doubt it would look like ROAD TO PERDITION.", "label": "positive"}, {"sentence1": "Penn takes the time to develop his characters, and we almost care about them. However there are some real problems with the story here, we see no real motivation for the evil brother's behavior, and the time line is screwed up. Supposedly set in 1963, the music is late 60s/early 70s. The references and dialogue is 70s/80s. The potential for a powerful climax presents itself, and Penn allows it to slip away. But even with all these difficulties it is worth the watch, but not great.", "label": "negative"}, {"sentence1": "Disney, the film name that once stood for all things innocent and suitable for all ages, has finally started to realise that to survive it needs to become more diverse. Such diversity has been very apparent in the last couple of years. Films like \"Tarzan\" and \"The Emperor's New Groove\" have made an attempt to move away from the traditional song-driven routine of Disney's past and into new, uncharted territory. \"Atlantis\" is the boldest step yet, but we have to remember: This is STILL Disney. The first ever serious film to come out of Disney's animation studio is a major achievement for them - in fact it's so serious it makes it into PG territory. Perhaps why a lot of families were scared off from seeing it this past summer.<br /><br />But despite the more mature subject matter, this is still a film that Disney wanted to draw in the families with, not just mature audiences, so the plot had to be kept simple enough for children to understand, but interesting enough to take it away from the realms of \"The Little Mermaid\" et al.<br /><br />So what we get is actually a potentially detailed plot, unfortunately suffering the blow of being condensed into a 96-minute movie. Ultimately, this is an action film about Atlantis, not about the exposition preceding it, so we are whisked through the first half hour with as many sequences bombarding the screen as is possible without losing coherency. Suspend your disbelief of how the characters get from point A to point B so quickly, you're unlikely to find an animated film that detailed coming out of Hollywood! If you want epic levels of detail in the plot, turn to James Cameron's \"Titanic\". Both films feature a boat in some manner.<br /><br />And let's talk about love, shall we? Yes, as with a lot of films, the lead male (one Milo Thatch, a bumbling archaeologist) and lead female (Kida, the clichéd Atlantian princess) are set to fall in love with each other. But what I found was not as clichéd as I was expecting. By film's end, for once, the characters touching/feeling/kissing sequence was far more subdued. There's various points in the film where the attraction grows, but it's just not in the ballpark of, say, \"The Little Mermaid\" (A good thing).<br /><br />You may have grasped that this is a rather clichéd film. Correct. You have your leading hero and heroine, backed up by more than half a dozen crew members who go on the expedition, all being given their moments during the film. Numerous other characters appear, take up the few minutes of screentime, then disappear. It doesn't take a genius to do the maths \u0096 a 96-minute film with a focus on action and visuals, and with a considerable cast, has very little time to expand the characters to any major extent. So what does it rely on? Clichés, and lots of them. Every character emulates something that has been done a thousand times before. You have the bumbling scientist, the attractive princess, the square-jawed colonel, the rich eccentric, the maniacal sleazebag, the Russian femme fatale \u0096 need I go on?<br /><br />I don't know why this got to anyone \u0096 I found the tongue-in-cheek nature of this film quite amusing. Alright, this is meant to be a serious flick, but do you really expect Disney to give up every single trait of their history? At least the writers have tried to come up with consistently witty dialogue, and sometimes it even is a little inspired.<br /><br />But in the end it's those big stunning visuals that put the icing on this cake. The CGI animation is truly amazing in places, and doesn't dwarf the characters, which was a flaw that let the recent \"Titan A.E.\" down. Speaking of characters, Disney hired an outside comics industry artist to create the designs, bringing an anime style to the film. Infact the visual presentation of the film as a whole owes a lot to anime, much more so than any previous Disney outing. This resulted in a conflict with fans of the Japanese anime, \"Nadia\", for the film's overall similarities with said cartoon series. Having not seen this anime, I can't comment.<br /><br />With picture, there is sound. Gary Rydstrom heads up the sound team, and what a soundtrack! From the opening shot the sound stage is alive and is a treat. James Newton Howard treats us to a dynamic musical score, which compliments the film in every way, never sounding out of place and always helping to build the tension or subdue it.<br /><br />Perhaps I missed the point of what the creators intended. To me, the film conveys that it's an adventure thrill ride, albeit with a more serious tone than any Disney film before it. If you don't like the clichéd tongue-in-cheek attitude, then perhaps the effort that has been poured into the visuals will delight. Heck, at least the mythology is far more correct than can be said about other Disney efforts (*cough*Hercules*cough*).<br /><br />This is a positive, 10 out of 10 review, from someone who was blown away by this film. I always suspend my disbelief with any animated film \u0096 after all, the laws of the real world are more than frequently broken in the cartoon medium. So sit back, enjoy the ride, and perhaps everyone can find something to enjoy about this film.", "label": "positive"}, {"sentence1": "Actually, Goldie Hawn is from Washington (Takoma Park, Maryland), but I digress. This is sort of a Mr. Smith goes to Washington type of movie, with some variations but the same premise. I taped this movie off of cable years ago because I had a huge crush on Goldie Hawn. The story is interesting, but it's highly unlikely that some cocktail waitress will get an important job in the government just because she saved some big shot's life. It made me laugh and made me mad at the same time. It made me laugh because some of the situations she found herself in were so ridiculous, I had to laugh. (POSSIBLE SPOILER AHEAD). It made me mad to think that our government would set up an average citizen in the manner she was set up. And the speech she made at the end...beautiful. Too bad not many people have guts like that in real life.", "label": "positive"}, {"sentence1": "THE. WORST. FILM. EVER. MADE.<br /><br />After watching this supposedly gay made film, I suspect someone rounded up a brain damaged half blind neo-nazi and had him make the worst gay film ever, all in some deluded attempt to attack gay culture. I had to stop the movie and call a friend to come over just so I had someone to scoff at when I paused the movie out of shock, disbelief and outrage at such sheer stupidity.<br /><br />On top of all the horrible writing and acting and illogical and stupid plot, its just a poorly made film. A dog with a handycam tied to its tail could have churned out better.<br /><br />Seriously, after reading the few positive reviews this movie has here, I suspect the writer must have a half a dozen IMDb accounts. Anyone who says this film is even watchable as anything other than a joke, is a liar or being paid heavily to say so.", "label": "negative"}, {"sentence1": "What a crappy movie! The worst of the worst! This movie is as entertaining as a dead slug. No-talent-what-so-ever-actors, stupid plot. Who wrote this script?! Was there ever a script for this goofy movie or did the director just accidentally press the record-button on his camera and then decided to make the film up as they went along? Is this meant to be a kids movie or a comedy or what? My friends younger brother is in the 6.th grade and him and his classmates just did an amateur-movie for their school-project which outdid this geeky movie.. This is by far the worst film I have seen in my life! There is just no excuse for this flick!", "label": "negative"}, {"sentence1": "I had high expectations of this movie (the title, translated, is \"How We Get Rid of the Others\"). After all, the concept is great: a near future in which the ruling elite has taken the consequence of the right-wing government's constant verbal and legislative persecution of so-called freeloaders and the left wing in general, and decided to just kill off everyone who cannot prove that they're contributing something to the establishment (the establishment being called \"the common good\", but actually meaning the interests of the ruling capitalist ideology).<br /><br />Very cool idea! Ideal for biting satire! Only, this movie completely blows its chance. The satire comes out only in a few scenes and performances of absurdity, but this satire is not sustained; it is neither sharp nor witty. And for an alleged comedy, the movie has nearly no funny scenes. The comedy, I assume, is supposed to be in the absurdity of the situations, but the situations are largely uncomfortable and over-serious, rather than evoking either laughter or thought.<br /><br />The script is rife with grave errors in disposition. The action should have focused on the political aspects and how wrong it would be to do such a thing, but instead oodles of time are spent on a young woman who was the one that wrote the new laws for fun, and who's trying to save everybody, by organizing a resistance that ships people to Africa. All this is beside the point! A movie like this should not pretend to be so serious! It's a satire! A political statement. But it doesn't even begin to actually address the problem it's supposed to be about. Maybe it was afraid of going too far? How cowardly. That's not art. It's not even real satire.<br /><br />Søren Pilmark, a very serious and by now one of Denmark's absolutely senior actors, was very good. He largely carried what little entertainment value the movie had. Everybody else: nothing special (well, perhaps except for Lene Poulsen, who did supply a convincing performance).<br /><br />In fact, a problem with most Danish movies is that the language never sounds natural. Neither the formulation nor the delivery. Why is it so difficult to make it sound right? Why must it be so stilted and artificial? I hope, when people look at these movies fifty years from now, they don't think that this was how people talked in general Danish society.<br /><br />3 out of 10.", "label": "negative"}, {"sentence1": "Honestly, I went to see the movie, not because of the actors, not because of the plot but because it was rated 17 here in Luxembourg and a movie has to be really brutal or pornographic to be put in this category. Believe me, being a movie-freak, I have seen quite a lot of brutal films in my lifetime (Ichi the killer, Irreversible, Hellraiser) but this movie was by far the most disturbing and brutal picture I have ever seen. <br /><br />The plot is plain stupid, the directing is awful, acting was mediocre even the music was a cheap copy of so-called \"Horror Soundtracks\". There isn't a single intelligent aspect in the whole movie, and some of the scenes are really hard to stand. (especially the scene, where you see the embryos in the glasses and hear the baby cries--horrible). I can't understand why the movie was rated 16 in Germany, where normally the criteria are real tough (e.g. kill-bill (brutal but it made fun of itself and had great allusions to Asian cinema and besides a magnificent directing) even a movie like state of grace is rated 18). No one can call this a Horror movie, because actually it was more about showing gore than about scaring the public (Showing the \"Creep's\" face in the middle of the movie was a very bad decision); for me (excuse my expression) it is just one insane director living out his disturbing fantasies. In some scenes you see violence, that has absolutely nothing to do with the plot nor does it explain anything. The plot has holes and flaws, the dialog is boring, honestly I can't mention a single positive aspect of the movie except for the British and Scottish accent.<br /><br />If I had something to say, I would ban this movie from the theaters, I fully understand why none of the big production companies invested their money in this crap.<br /><br />I'm looking forward to getting feedbacks to my thread and I'd be happy to discuss about one or the other topic.<br /><br />\"Livin' the dream baby, livin' the dream\" David Aames", "label": "negative"}, {"sentence1": "David Webb Peoples meets Paul Anderson...if it already sounds weird to you, then you are right, because it is.<br /><br />Peoples is known for his scripts with moral implications of what is right and wrong, the value of life, etc... He covered these issues in Bladerunner, Unforgiven, and pretty much in all of his screenplays there is something along those lines.<br /><br />Paul Anderson's first successful movie was a violent thriller. Not surprisingly so have all of his other movies! And here is a violent thriller with moral implications!<br /><br />Peoples' script is quite apparent in the first half of the movie. Soldiers trained from birth, taught to kill, and never had a normal life. They are replaced by better, genetically engineered soldiers and Todd, one of the original soldiers, is left on a planet and left for dead. There he must cope with a group of refugees, some want him to stay others hate him and there is an interesting drama here. BUT THEN...<br /><br />...The bullets start to fly as the new soldiers move onto the planet for a military exercise and try to kill all the people. Big, violent, loud action ensues and Peoples' script turns into an Anderson action-fest. It is hard to believe that the script was originally written that way, but the end product is better then I expected. Entertaining, somewhat, though admittedly not very, thought-provoking, and exciting once the action starts. 7/10<br /><br />Rated R: a lot of violence", "label": "positive"}, {"sentence1": "A very interesting entertainment, with the charm of the old movies. Tarzan faces the greatest perils without hesitation if the moment requires it, and we all enjoy with him his success.The most insteresting for me is a man without special powers facing the problems and beating them just with human skills (he was a great swimmer and had a great shout)", "label": "positive"}, {"sentence1": "This is a movie that plays to everyone's emotions. We all want a second chance at things. Jim Morris got one, followed his heart and got a chance to live his dream. What a great message and what a great delivery by this movie.", "label": "positive"}, {"sentence1": "He pulled the guys guts out his butt! That's a spoof right?! No one really writes that it just happens like improv gone horribly wrong. I think any way. This movie must be a spoof because who would say they wrote that script otherwise. Can anyone imagine the entire cast sitting around as the director and writers go over the storyboard.<br /><br />Director says, \"next our inbreed villain uses his 24 inch machete to disembowel our token creepy neighbor. Get this, he is going to pull the guts out his bunghole\"<br /><br />\"Brilliant!\" the entire cast proclaims.<br /><br />No way can that happen, nobody writes that stupid! Gotta be a spoof.<br /><br />I loved the part where the skinny introspective gal beats the inbreed freak to death with the cast iron skillet she finds on the floor of the cave. I wasn't sure the inbreed cannibal types bothered to cook much. Maybe that explains why the skillet was lying on the floor in the dark at just the right time to kill the malformed hulk. Seems ironic that after the freaky guy had bested martial arts expert porn queens and a couple out doors type jocks he falls so easily to the frying pan of a skinny defenseless girl next door. <br /><br />What the heck is that Richard Greco guy doing in this? Did he fire his agent or something? <br /><br />Can anyone explain the ending to me please because I didn't get it either? I can't quite figure why the nice hero girl wanted to kill the funny lady who was making her some tea. Never mind I don't want to know.", "label": "negative"}, {"sentence1": "It used to be my thinking that movies required plots, or some other means of making you care at all about the story line or anything that is going on. This movie has showed me that you don't actually have to have anything like that.<br /><br />I could sum it up simply as that. But, IMDb wants me to have more lines. It was kind of pretty. not compelling in the slightest. The way the characters talk in the movie makes you think it should have taken place over a matter of days, but there is no passage of time and i'm pretty sure it all happens in an hour.<br /><br />If you are looking to entertain yourself, then buy a gallon of milk and see how fast you can drink it before throwing up. It would be a far better use of your time. Time that you will never get back. Jurassic Park 3 was pulled off better than this movie.", "label": "negative"}, {"sentence1": "STAR RATING: ***** Unmissable **** Very Good *** Okay ** You Could Go Out For A Meal Instead * Avoid At All Costs <br /><br />Stuck-up career bitch Kate (Franka Potente) heads to the London underground to catch a train to take her to meet George Clooney. However, after a hectic working day, she dozes off and awakens to find herself alone in a deserted platform. As she races off on a situation taking her from one daunting encounter to the next, however, she learns of something far more malign and evil waiting for her out there.<br /><br />In a lot of ways, the British Film Industry is really becoming one on it's own, especially in the horror thriller department, with films such as Creep and the successful 28 Days Later (which this has strong echoes of in parts.) In terms of succeeding in what it set out to do, Creep does cleverly create (especially at the beginning) a scary sense of isolation and tense fear. At it's clever running time, it also (though inadvertently, I suspect) manages to pay homage to some of those pioneer high-concept horror films from the 70s that rely on shocks and fear through-out without really focusing too much on character development and such.<br /><br />Of it's weaknesses, some scenes are a little predictable, but these don't really succeed in making it less scary or effective in any way. I'm not sure if the ending was meant to make it come off as some sort of morality play and it's not exactly perfect, but it's certainly very effective and serves it's basic function very well. ***", "label": "positive"}, {"sentence1": "Monstrous mother-son-duo (Alice Krige and Brian Krause) sucks life-force of virgins, and their newest target is pretty but lonely Tanya (Madchen Amick). However, these monsters are allergic to cat's scratches... I have never been fan of sleazy, overrated bestsellerists like King, Koontz or Barker, but this B-movie, written by Mr Dung himself, is actually not near as bad than it could be. Yes, it is sometimes jaw-droppingly atrocious, but there is actually some surprisingly impressive touches: good old-fashioned graveyard, eerie soundtrack and candlelit-Gothic-house-scene, mirror showing the monstrous form of the villains, etc. Of course, the film is polluted by Mr Dung's potty-mouthed dialogue and all-tactics-of-toilet-seat obsession to vilify fat people, leading to totally pointless subplot of rapist teacher, but there is roses among manure.", "label": "positive"}, {"sentence1": "I remember watching this on prime time when I was about 7 years old. I was a huge comic book reader at the time, and anything relating to superheroes was anticipated heavily. The end result, however, was underwhelming.<br /><br />I was aware of the \"Emma Peel\" Diana Prince stories, as they had only recently come to an end and Diana was returned to her Amazonian form. However, there was so little action that I was bored throughout most of the movie. The final costume was an interesting idea, but looked more like a cheerleader than a superhero.<br /><br />I saw the movie again in my late teen years. It hadn't improved much. Cathy Lee Crosby was more familiar, thanks to That's Incredible, but her acting was no better. The script had a few good ideas, like the rogue Amazon, and a decent villain in Ricardo Montalban, but it just didn't come together and was still boring.<br /><br />I think they should have built the back story better, and built the show into a more epic climax. It was too much like a bland spy film, crossed with a superhero story written by someone who had never seen a comic book. The Amazon elements were intriguing, but needed to be expanded.<br /><br />The film did succeed in forcing producers to go back to the drawing board and come up with something more faithful, if a bit too camp and low budget. The budget was also pretty low here, and superheroes don't come cheap.<br /><br />It would be nice to have the movie available on DVD, if only as a comparison and historical document. Even Superman 4 is available, and it has nothing over this film (except Chris Reeve and Gene Hackman). It's worth seeing for curiosity sake and for a bit of inspiration and caution for future versions.", "label": "negative"}]