[{"sentence1": "If you ever hear these three words uttered to you...\"Joe Don Baker\", be afraid...<br /><br />Final Justice is the low budget action movie based on a sheriff in a Texas town named Geronimo (pronounced as Heronimo). He's an ugly, slimy, rude character who is on the hunt for a criminal in Malta who killed his partner in Texas. His partner actually slumps down twice in the movie. Very bad editing. Joe Don Baker (Geronimo) ends up in jail like 4 or 5 times in this movie, making the plot go nowhere fast. Plus, he shoots everybody like he's in the wild west. I guess nobody told him it was the 20th century. A woman cop is assigned to show him around Malta (who looks like Elaine from Seinfeld) and she is the only one who can put up with the redneck. She must be insane!<br /><br />The strippers in the bar are the most entertaining characters in this movie. Their dancing is shown throughout the film and I began to bond with the sleazy women. Well, at least it was better than watching Geronimo try to dumb his way out of something. The ending is flawed and somewhat predictable, and I was happy it was finally over. You'll never forget that last line of Joe Don Baker from the movie.<br /><br />It's so hard to imagine how he was in THREE Bond movies...very weird! Anyway, if you're up for a laugh, then see this one on MST3K sometime. Also, I've heard his other bad movie (among many), \"Mitchell\" MST3K version is being released on DVD by Rhino. I can't wait to see that!", "label": "negative"}, {"sentence1": "Let me start off by saying that after watching this episode for the first time on DVD at 10 o'clock P.M. one night, I could not fall asleep until about 3:00 A.M.<br /><br />This brief review may contain spoilers.<br /><br />I'm a long-time fan of The Sopranos and I can safely say this is the best episode I've seen. I'm not saying everyone should feel this way, but I do. This episode is identical to the weekend I spent with my family, watching over my own father, comatose in the ICU before he passed.<br /><br />The episode begins with Tony in an alternate reality: he is a salesman who's identity has been mistaken for that of a man named Kevin Finnerty.<br /><br />By the time ten minutes had gone by, I knew either Tony was dreaming, or I was watching some other show. It wasn't like the normal Sopranos and I loved it.<br /><br />Option 1 is confirmed when Anthony (or \"Kevin\") looks into the sky at a \"helicopter spotlight\" and we see prodding through it, a doctor with a flashlight. We see this only for a moment and the sequence plays out until we go back to real life in a situation similar to the one I just stated.<br /><br />Tony has come out of the coma for only a moment. His boys take A.J. home and Carmella, overcome by stress, breaks down in the hallway: a signature moment in the episode.<br /><br />For the remainder of the episode, we cut in between the real world: the family dealing with the potential negative outcome of this coma, and Tony's alternate reality, which parallels what's going on both in his mind and in the real world around him.<br /><br />Then comes the stellar point in the episode: after A.J. finishes telling his mother he's flunked school, she walks in to see Meadow sitting at Anthony's side.<br /><br />She approaches Tony, and utters the best line of the episode: \"Anthony, can you hear us?\" In Tony's world, he enters a dark hotel room and turns on a light. He takes off his shoes and goes to the phone. He tries to dial, but he cannot--as if he were trying to say something back to Carmella, but couldn't physically bring himself to do so. Not yet.<br /><br />He sits down and looks out his window. A shimmering light that has reoccurred throughout the episode now seems to call to him from the other side of the city.<br /><br />\"When It's Cold I'd Like To Die\" by Moby marries perfectly with these last images and helps in creating an emotional roller-coaster of an episode.<br /><br />10 out of 10.<br /><br />P.S.: Watch the next episode. You find out what the light is. It's wonderful.", "label": "positive"}, {"sentence1": "Not sure if this counts as a spoiler or not, so beware:<br /><br />Just a small but crucial thing to watch for, an intriguing possibility: the boys steal a green Citroen at one point, for a joy ride, and return it to the owner having done purposeful and vengeful hidden damage to the car, hoping that the owner will crash. Is it the very same car they steal much later from the picnicking family? We know the original owner sold it. They drive off at the end on a dangerous road, one which I understand has been closed to all but pedestrians for the last ten years. A whole new slant to the end of the film.<br /><br />On another matter, this film could have been called \"Scent of a Woman\". I don't recall another film, certainly not American, that treats the scent of a woman in such a frank and open manner, much like the \"nose\" of a fine Bordeaux.", "label": "positive"}, {"sentence1": "We see a body of dead girl in a morgue with the coroner trying to close the eyes of the girl, but whatever he tries they won't stay open. After this we move into the future and we follow a group of former school friends who hide a terrible secret, but suddenly they start getting picked off one by one in many grisly ways. Through flashbacks we learn of this awful suicide of a shy girl who was trying to be one of the group, but she was shut out by them because they dug up her past and found out some weird occurrences. So, is she back from the grave seeking revenge? <br /><br />Oh what a great and always spooky story! Well, that's what I hoping I could say. And 'hoping' was as good as it got. This is an forgettable, so-so supernatural horror flick that I actually watched before, but I went in thinking it was my first viewing. So to my surprise it hit me when I started picking up on certain things, but like I said it's quite a forgettable mix that it felt like a first viewing again. \"Nightmare' is just another type of it's field that adds a 'few' changes to the gruel. Oh, please give me something that's a bit more fresh. It doesn't have to be entirely original, but this is one formulaic and at times quite tired J-horror flick. Even though it strings along the usual ghost story involving you guessed right\u0085 an evil looking, vengeful chick spirit.<br /><br />But in spite of my negativity of it being the same old, same old story and jolts. This one kind of entertains when its being grisly and popping in some creepy visuals. The deaths are vividly displayed with bite and some originality. While, the gloomy atmosphere alienates the audience with it's murky lighting. The first scene involving the spirit terrorising one of the girls is one blood-curdling experience, but really when it's not trying to shock you. I found it rather coma inducing and I thought about getting some shut-eye. That might be harsh, but it just didn't go anywhere of any interest between those shock moments. You could say that because the supposed mystery is really not much of one, the unsure story is just simply flat and the characters are a self-centred bunch that you don't really care what happens to them. The disjointed story should have focused more on the spirit than that of these bland characters who have one unconvincing group relationship. It just overplayed its cards by becoming overly muddled and taking too long to get going that when it comes to the climax it's just plain ludicrous. The film's haunting ending is a high point, though.<br /><br />The film looks fine, although it could have done without the snazzy, quick fire editing and the music score was a bit overbearing in playing up the mood. The performances tread a fine line, but Gyu-ri Kim is strong in the lead role.<br /><br />It's nothing new and it shamelessly steals ideas, but if you can look past that it delivers some nasty thrills. Although, I found the handling of it rather lethargic, despite the odd effective chills. A standard effort all round I guess, but still it's equally missable.", "label": "negative"}, {"sentence1": "Purple Rain... what else can i say, the title speaks for itself. But i think all the actors were well picked. The movie had a great story. I loved it! Ever since i watched that movie, i've been stuck in the eighties, and I'm only 13! My favorite part of the movie was when his father died and he was picking up all of his music compositions, and the Apollonia was sitting on the stairwell with his earing in her hand. Critics say that its a drama but i think its more of a romance. Murphy Brown also did a great job in the movie, he actually acted like himself. I'm so glad I've seen this movie. The song Purple Rain, beautifully sung, was so heartfelt. I cried more than once.", "label": "positive"}, {"sentence1": "This is a story of a Jewish dysfunctional family. The parents have divorced and mom remains back east in the house. The father, Murray Abromowitz, moves with his children to California, and moves around Beverly Hills so that his children can get the best education possible.<br /><br />Things really become funny when Marisa Tomei, Murray's niece, comes to lives with the group.<br /><br />The film deals with the various adventures of the family complicated by the drug scene of the affluent neighborhood.<br /><br />Jessica Walter costars as a woman who wants Murray to move in with her since she wants a companion.<br /><br />Carl Reiner and Rita Moreno come in towards the end. They play Murray's brother and sister-in-law respectively; they're also the parents of Tomei. In front of the children, Reiner lets loose reminding Murray that he has been paying the bills for them all along.<br /><br />The film ends on a sour note as the embarrassed family moves out of their fancy digs and take to riding around Beverly Hills in their car. I guess the film is promoting independence and some good old self-esteem.", "label": "negative"}, {"sentence1": "With a cast list like this one, I expected far better. Venessa Redgrave spent the majority of the movie lying in bed. The best actresses in the world cannot make anything very interesting when their acting is limited to lying down and falling asleep throughout the entire movie. The plot summary says that a secret is revealed to the daughters as their mother comes closer to death. The thing is, she never tells her daughters anything except cryptic advice to be happy. All the relationships in the movie are underdeveloped. I also felt that the back and forth between the past and present was unnecessary. It seemed as if the idea was stolen either from the book the Da Vinci Code in which the device was used to increase suspense, or from The Notebook in which they used the device to create the never ending romance of the story's main characters. Either way it was a cheap device in this movie because it didn't work to create anything. It was a way to attempt suspense in a movie that has none. I left wondering why good movies can't be written for women. It really was a disappointment.", "label": "negative"}, {"sentence1": "First things first, the female lead is too gorgeous to be missed. Now actress Wang Zu Xian, the one who played Xiao Qian in the movie, is 42 years old and well aged. It's always good to review these glorious times when seeing old-school HongKong productions like this.<br /><br />The movie is one of the most influential titles made in 1980s. The art set decoration and other aesthetic facets are all mesmerizing. More fantastically the movie had a total black humorous undertone in it. It feels like a horror movie but ultimately it's not scaring, but only fun.<br /><br />I had the experience of translating the second script of \"A Chinese Ghotst Story\", and I thought that script was a decent write. However when I saw the movie, I firstly was disappointed in seeing the movie different from the script, like in a smaller scale and involving more comic roles. However, it turned out to be better executed in terms of being entertaining.<br /><br />If you have seen the Lord of the Rings, you will notice the similarities in this movie to LOTR. The climax is like a mirror of Miranda Otto fighting with the Ring Witch. It's definitely a laugh-out-loud. Bravo!", "label": "positive"}]