[{"sentence1": "Gloria Victor and Dolores Reed in space girl costumes.<br /><br />I love 50 sci fi, I even love cheesy 50s sci fi, but this film is really, really bad. And not in a MST3K kinda way.<br /><br />Virtually unwatchable as a couple of bozos do their best \"hip cat\" impression of Abott & Costello.<br /><br />Chessecake can usually save cheesy sci fi, such as in \"Cat Women On The Moon\" but it can't in this case. This film requires a mute button and fast forward feature.<br /><br />That said, I could watch Gloria and Dolores walk around the space ship for about an hour or so.", "label": "negative"}, {"sentence1": "We toss around the term \"superstar\" way too lightly these days, but here's one guy that truly deserves it.<br /><br />I was glued to the set this entire show. The song selection was perfect -- it only contained the songs I actually wanted to hear and cut in with documentary footage during the weaker new songs. I loved that the band was just a five guys on stage in a very minimalist environment. (With songs of this strength, you don't need a circus to be entertained).<br /><br />The shots of the crowd were amazing, too. How many performers can affect the original Beatles fans (now in their 50's and beyond), get young kids to jump up at the opening lines of \"Can't Buy Me Love\" and impact everyone in between? <br /><br />While watching, I also realized that in the wake of John Lennon's tragic death, Paul McCartney instantly became an afterthought. Paul not only lost John and George (no matter what their final relations were, it must be hard to lose someone with whom you changed the world), but he also lost his wife Linda and never really seemed to garner the acknowledgment Lennon's murder received. I agree that Lennon's murder was horrible, but only now did I realize that Paul was sort of forgotten in the aftermath. I was very happy that he's found love again in Heather.<br /><br />As for those complaining about the audio/video quality, I had no complaints whatsoever; both were crystal clear on my set. I think these same people will complain about the quality of DVD when the next format comes out; they'll never be satisfied.<br /><br />My only regret was not buying a ticket to this show when I had the chance. Thanks to this video I was able to enjoy it.<br /><br />When people remember John Lennon, they will first remember his murder and then his music. I now have a new appreciation for Paul McCartney, because, if nothing else, he will be remembered for his music first. And let's hope another lunatic won't change this, because the McCartney catalog is pretty good.", "label": "positive"}, {"sentence1": "All of those who voted less than 5 are obviously not fans of clean, tongue-in-cheek humor. Keaton is brilliant in this - as in most of his work. This is not a blockbuster, bigger-than-life affair. This is campy, slapstick humor played out by some of Hollywood's best (and very versatile) actors. Piscopo was equally on the mark as the top dog wannabee, once.<br /><br />If you want to see the funniest attempt at not really cussing ever filmed, you gotta see Dimitri do his piece as Morone.<br /><br />I gave it a 7.", "label": "positive"}, {"sentence1": "Glacier Fox is one of the most heartrending and wonderfully photographed wildlife films ever made.<br /><br />The film makes you care about each member of this fox family, from the blind cub to the strongest - their adventures are at times hilarious and also tragic. Set against an inhospitable countryside, the audience's hearts warm to the family members.<br /><br />The music score and lyrics tell the story intercut with narration about what is happening in general terms.<br /><br />Man remains one of the biggest predators, but we are left in no doubt that the foxes are capable of living, not just surviving beyond human endeavours.", "label": "positive"}, {"sentence1": "I was so eager to see this one of my favorite TV shows.I saw Universal trademark followed with a newly acquainted title and theme song which still impress me.Computer animation on some scenery like a solid title name\"The Jetsons\" or a dimension view of a spaceship approaching an amusement park and more made this version splendid and fantastic.Shortly after that till the end...I couldn't believe my eyes!!!!How lucky I was that I could forget all I had seen.Just songs by Tiffany and its theme song in new arrangement were in my head.Anyway,I wish to see this space-aged family (also The Flintstones and Yogi Bear) in all graphic computer design as Toy story or Bug's life.The best style for Hanna-Barbera's in my opinion.", "label": "negative"}, {"sentence1": "This is a bit of a first for me, the first time I have ever been disappointed in a Tim Burton film. POTA isn't a bad film (great sets, costumes and the odd great performance) but it could have been made by any off-the-shelf hollywood director. The pacing was very odd, the last third was just spent waiting for the film to end, by myself and the cast. Tim Roth was excellent, probably the only pleasure in the film. Come back Tim.", "label": "negative"}, {"sentence1": "It is finally coming out. The first season will be available March 2007. It is currently airing on ABC Family from 4-5 pm eastern time Monday through Friday. The last episode will air on December 19th at 4:30. I missed it the first 100 times around. I wish I could buy the whole series right now. Who does she pick? I have to write 10 lines in order to reply to the first comment. What am I going to say. La da da de de. La da da de de nope only up to 8 how do I get to 9 almost almost awww 9 now I need 10 - 1, 2, 3, 4, 5, 6, 7, I missed counted this is only number 8. Punky Brewster is pretty awesome too. Almost to 10 almost awwwwww.", "label": "positive"}, {"sentence1": "Having seen men Behind the Sun I guess I hoped for an evolution in style & technique to match the larger scale of this movie. I was also quite interested to see someone make a hard-hitting fact-based fictionalised account of what happened during this most notorious of Japanese atrocities, but this is not it. This plays like a bottom-to-mid tier European Nazi exploitation movie from the 70s - e.g. SS Experiment Camp etc (perhaps more like Deported Women of the Special Section actually). Granted it has a greater scope and more people running around, but it resorts to the same cheap and cheerless device of lots of hapless non-actors limply falling over to the sound of ridiculously fake gunshots, spiced up with the occasional poorly executed 'shock' sequence. The admittedly horrible documentary footage is roughly spliced in between scenes so hackneyed that even these real images are robbed of much of their power. Watch channel 4's 'The Holocaust' (aired recently (still running?), as of 1 No 2006) for a genuinely disturbing documentary on the evils of war (featuring excellent in-context use of actual footage). This is the type of treatment the horror of Nanjing deserves, not this hackneyed exploitation garbage (a better executed exploitation movie minus the disrespectful use of stock footage would have been fine, but again this is not even a very good exploitation movie). Rating: 3 (5 as exploitation, 1 as a treatment of the subject).", "label": "negative"}]