[{"sentence1": "Work great for me", "label": "5"}, {"sentence1": "Annoying Annoying", "label": "2"}, {"sentence1": "Where is the network support. I can't access shared folders on a LAN or ssh/ftp to anything...", "label": "3"}, {"sentence1": "Great online app", "label": "4"}, {"sentence1": "For me it constantly keeps spawing the albino rat and it keeps merking me when im only on floor 1.......FLOOR 1", "label": "3"}, {"sentence1": "It takes a long time to download and why do I need this to use another app?", "label": "2"}, {"sentence1": "It's OK Decided to uninstall when notifications started becoming too frequent with no ability to disable. Also  images in the articles sometimes don't show.", "label": "3"}, {"sentence1": "Pepe Pupu", "label": "5"}, {"sentence1": "Wnt bloody update", "label": "1"}, {"sentence1": "Good Flexible", "label": "3"}, {"sentence1": "Unstable", "label": "2"}, {"sentence1": "Some bugs Upon picking certain roms it'll shut itself down", "label": "3"}, {"sentence1": "Hiii", "label": "4"}, {"sentence1": "I think got", "label": "5"}, {"sentence1": "Good work Some bugs are still there it adds the script of copy text for example if I copy the text \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"my name is KING BRANDON \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" in 2 lines with hitting enter in anywhere in the text so after copy it add tag in changed line position !!!!! Fix this bug and get 5 star from most of the users !!!!!\"\"", "label": "2"}, {"sentence1": "Logging out without my authorisation Yesterday  when I came to check my telegram  I saw that  my other telegram account has been logged out without my permission and because I don't have the chip with me  I'm unable to access it. Please when I get that account working  please fix whatever problem it is and then I'll give you the full 5 stars", "label": "4"}, {"sentence1": "Perfect app otherwise The app is really great but sometimes text messages remain \"\"\"\"\"\"\"\"sending\"\"\"\"\"\"\"\"  it takes terminating the app  reopen  copy the old text  paste & send  deleting the old text to fix. Very annoying. Please fix if this is a bug. Thank you and keep the excellent work up!!!\"\"", "label": "4"}, {"sentence1": "Opeyemi Cool", "label": "4"}, {"sentence1": "For love it /", "label": "3"}, {"sentence1": "10000 Plzzzz help me sir coz is tu hard tu succesed or join u plzzzz hv try long time bt no feedback sir plzzzz help me", "label": "2"}, {"sentence1": "Causes 50% of the battery drain even with poll switched off!!!", "label": "2"}, {"sentence1": "Good  but.. Great game  but add checkpoints or something like that  then I will rate it 5 stars☆☆☆☆☆", "label": "4"}, {"sentence1": "Where do we download the games", "label": "3"}, {"sentence1": "Not Working piece of junk", "label": "2"}, {"sentence1": "it is not installing properly annoying", "label": "1"}, {"sentence1": "It does BEST an emmulatir can on phone.Onky problem is we do NEED hardware ps2 controller to play same as ons ps2 or psp.", "label": "5"}, {"sentence1": "Does not support Mediatek MT6795 Helio X10 (gionee e8). Will keep it for upadte. Please do something.", "label": "1"}, {"sentence1": "Note 3 After installing the app  it stated that it can not be used on my phone. Something about the Qualcomm not being right. So  if snoop snitch can not work  can stingray hit my phone?", "label": "3"}, {"sentence1": "Mr vusi Man that is the best", "label": "1"}, {"sentence1": "Trash Has not worked. Ever. Sucks", "label": "1"}, {"sentence1": "Comes in handy Use it a lot for theming", "label": "5"}, {"sentence1": "Home screen support Would be awesome", "label": "5"}, {"sentence1": "Ashu Ashi", "label": "1"}, {"sentence1": "People just don't like it..", "label": "1"}, {"sentence1": "Overall Amazing Everything is very well done except that it's missing 2 things. It is missing a few event quests and a BIG miss for me was Palico gear. It has no information  list or stats for Palico gear. I hope they add this at some point.", "label": "4"}, {"sentence1": "Does everything you would expect No adds  no nonsense.", "label": "5"}, {"sentence1": "Need more features. Also there's a problem that when someone delete his account  the channels that he made them  dosn't delete and the channel will be unusable for ever. Pls fix this !", "label": "4"}, {"sentence1": "I don't even like this app because it force stopped most of my apps😫😬😬😤😤😠😠😠😡😡😡😡👿👿👿👿👿", "label": "1"}, {"sentence1": "Best app Sumeet", "label": "2"}, {"sentence1": "Very helpful and easy accessibility", "label": "5"}]