[{"sentence1": "It's not work properly", "label": "3"}, {"sentence1": "Used to be great Everytime I download a song it says moving incomplete", "label": "3"}, {"sentence1": "CAN'T REMOVE THIS STUPID BLOATWARE. IT'S MY PHONE NOT YOURS", "label": "1"}, {"sentence1": "Useless Really wanted to use app but it has been downloading for 20+ minutes. Can't use it if it won't complete download.", "label": "1"}, {"sentence1": "Ten Ten", "label": "5"}, {"sentence1": "ppsspp is booring cant play pls help me", "label": "1"}, {"sentence1": "Me tarda como 5 minutos en abrirla cada vez que contesto a algún mensaje  una perdida de tiempo total  solucione lo y le pongo 5 estrellas", "label": "2"}, {"sentence1": "Fully Useless app it has just some loaded information.i", "label": "1"}, {"sentence1": "I've been using k9 for years and have loved it  but the last 3 or so updates have been horrible. Slowed the app down  and caused often crashes. I'm going to find an old version until this is resolved.", "label": "2"}, {"sentence1": "Simple & Strong tool for memorizing.. Love the statistics. Wish I had the option to set pre-configured card settings. Thanks.", "label": "5"}, {"sentence1": "Binaural beats Very useful for travelling & sleep remedy.", "label": "4"}, {"sentence1": "Jamal", "label": "2"}, {"sentence1": "Its a good app. Just wish getting it to close were easier", "label": "4"}, {"sentence1": "Keeps crashing on OnePlus One. Multiple times per game. Was fantastic on galaxy phone but it's so infuriating especially as the warning dialogue box obscures the view of the scores so unless you remembered (rendering a score keeper unnecessary) the score you are screwed.", "label": "2"}, {"sentence1": "I am tired of when I can not do something till I update it so I do and I to update it like 5 times in a min", "label": "3"}, {"sentence1": "Danish Dabish", "label": "1"}, {"sentence1": "Why do I need to update all the time .it's time cosuming", "label": "1"}, {"sentence1": "Good ads free app  but there is a bug with the audio reminder. It doesn't come on if the event is repeated daily every day forever.", "label": "4"}, {"sentence1": "Used to be great.. then I had to switch because of wrong dates (and therefore sorting) on some messages  lack of swipes  a crash constantly occurring when receiving some type of messages (probably malformed but no other client I have tried crashed because of that)  and missing features in notifications.", "label": "3"}, {"sentence1": "Nice idea but made my phone - Samsung s6 edge  slow to a crawl", "label": "2"}, {"sentence1": "Ehh It doesn't have all the music but its still works", "label": "3"}, {"sentence1": "Worked My sms and mms backed up to my Gmail! It was a life saver cos my att message cloud some how got deleted an now isn't synchronizing so thank God most of my texts are on my Gmail! The only thing I hate is when I restored them on to my new phone the text are there but my pictures I had attached did not restore so u can see the conversation but no pictures to tell full story an I needed the text an pictures for a legal case!", "label": "4"}, {"sentence1": "Looks really great but how do you use it? It would have been nice to include a brief tutorial in the initial starred clips present after installing the app... I gave up and will be uninstalling it. Sorry  Charlie...", "label": "1"}, {"sentence1": "AntennaPod Simple  handy player and downloader. Like the speed controls and jump forward and back buttons. Would be useful to have up / down speed buttons instead of a one-way scroll. Embedded player is accessible from file list that includes files not d/led with the app  though in this use it doesn't remember the position of paused files.", "label": "4"}, {"sentence1": "Oh please make it fast ", "label": "2"}, {"sentence1": "Cannot add custom images. The app shows an error when i try to insert a custom image to my comic. Waiting for an update.", "label": "3"}, {"sentence1": "good tee eè", "label": "1"}, {"sentence1": "The best Cloud based messaging is great you Can have your messages there almost forever!!! For Improvement it should have specific background for each group and contact and also sending and directing messages should be allowed to more than one contact just like they do in telegram Plus and also directing Messages without naming the source (Just Like in Plus)", "label": "5"}, {"sentence1": "This ap is not OK this ap slow the mobail Aziz", "label": "5"}, {"sentence1": "Thank you!", "label": "4"}, {"sentence1": "Simple ND useful", "label": "4"}, {"sentence1": "Great app Works as it should. No complaints.", "label": "5"}, {"sentence1": "Unbelievable Most of Telegram useres are iranians. Then why don't you add persian language as an option? I can't understand this.", "label": "1"}, {"sentence1": "Less words and... No word suggestions. No updates", "label": "2"}, {"sentence1": "Nice! If only memory option...", "label": "3"}, {"sentence1": "fake security I saw my all contacts in My relatives telegram contacts. They even don't login from my phone and they don't even know them. somehow telegram transfer my contacts To my other telegram contacts. fix it", "label": "3"}, {"sentence1": "Misbehaving The app is great   specially after the update. But since few days I am getting calls from a number '1' .firstly  I am not supposed to get them and when I pick up   no one talks .please look into the matter", "label": "2"}, {"sentence1": "Good prgrm", "label": "3"}, {"sentence1": "Good an simple to use Good and simple to use  but would be nice to see Dropbox ans Drive online folders within the gallery folders.", "label": "3"}, {"sentence1": "Worst experience Tried to update several times but failed. My data and time wasted", "label": "1"}, {"sentence1": "Simple and just better Maybe you can consider to follow Lollipop design caused in the notification drop down only OS Monitor still in black color  thanks", "label": "5"}, {"sentence1": "Yet Vt", "label": "2"}, {"sentence1": "Ye app update kyu nhi ho rha hai", "label": "1"}, {"sentence1": "Slowness I mean it good but can u fix it so thats it isn't laggy and slow after that I'll rate 5 ?", "label": "3"}, {"sentence1": "Its... I like it but it's pretty slow at times and it also doesn't show all of the Artists songs only some", "label": "3"}, {"sentence1": "Best news resource out there Far better than the establishment news garbage. Good  functional  easy to use app.", "label": "5"}, {"sentence1": "Photo upload. Is not working", "label": "2"}, {"sentence1": "Only classical I would like more of a variety", "label": "1"}, {"sentence1": "Virus!!! App won't unistall from My device even after restarting in safe mode!!!", "label": "4"}, {"sentence1": "Nice problems solution....", "label": "5"}, {"sentence1": "grab this for more easily", "label": "4"}, {"sentence1": "It is sooooooo cool", "label": "1"}, {"sentence1": "Best giler", "label": "5"}, {"sentence1": "Didn't get what I was looking for. It interfered with the process . You Tube was playing what they thought I wanted to listen to", "label": "1"}, {"sentence1": "amazing My friends are always like \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"Wow\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" when ever I open my contacts but pictures come out pixelated\"\"", "label": "4"}, {"sentence1": "It's great 😍", "label": "4"}, {"sentence1": "Images Not giving it 5 stars until I can add custom images.", "label": "2"}, {"sentence1": "GOOD GOOD", "label": "1"}, {"sentence1": "Photo uploading is decidedly broken. The multi picker works great  but it is a coin toss whether each individual photo will upload successfully or hang at 80% and go nowhere. The only way to fix hung uploads is to delete it and then browse through your photos again to try once more. This is a huge burden when you upload 20 photos and 5 of them hang. This behavior is consistent whether on wifi or data. What's more  the only intuitive options for a poat are \"\"local draft\"\" or \"\"publish\"\". I can't get the app to default to \"\"draft\"\"  in which it is uploaded and able to be edited on my computer. Even if I only have the app as a way to upload cell photos  it is almost worthless at that.", "label": "2"}, {"sentence1": "Awful Whenever I try using it says something bad happen.", "label": "2"}, {"sentence1": "Can't uninstall it.. As soon as I try to deactivate it as device administrator  settings crashes .", "label": "2"}, {"sentence1": "Doesn't work for me Cannot connect to an Openfire chat server account with this app.", "label": "2"}, {"sentence1": "Razaq", "label": "4"}, {"sentence1": "Nice touch", "label": "4"}, {"sentence1": "Boring Boring", "label": "1"}, {"sentence1": "Got potential It's a bit too slow and unbalanced for my liking  but it has potential. Could use some form of sound  too. I'm not a fan of the percentage based experience point loss when killed. It's hard enough to level up  and fleeing doesn't always work.", "label": "3"}, {"sentence1": "I loved this app", "label": "5"}, {"sentence1": "Seems to work fine. I've been using it to log hikes. the only problem i have is I can't get it to log to the SD card. (may be because I'm not too familiar with Android) If someone can give me a hint as to how to store the log on SD card I'll be a happy boy and will up it to 5 stars.", "label": "4"}, {"sentence1": "abed.rakhshan yallda mobarak Ok", "label": "5"}, {"sentence1": "Nostalgia Me  my dad  and my brother played this game a lot &lt;3", "label": "5"}, {"sentence1": "VPN access works great Supports anyconnect and you can make it appear as a Windows device instead of an android device.", "label": "5"}, {"sentence1": "Betr Rdfghtdah", "label": "2"}, {"sentence1": "2474 BMW", "label": "4"}, {"sentence1": "Very easy to use. Good jobs.i'm very proud to ringdroid team", "label": "5"}, {"sentence1": "Fantastic app although.. If you can make it unlock with either a pin or pattern lock  i would definitely rate this a 5 outa 5.. until then 3 stars ;) // on a side note can anyone make an extension for solmail ?? Thanks in advance if anyone can.", "label": "3"}, {"sentence1": "rigi واقعا عالىه مرسى از زحماتتون", "label": "5"}, {"sentence1": "Interesting and rewarding networking!", "label": "3"}, {"sentence1": "It fast and quick", "label": "4"}, {"sentence1": "Only the infra red map shows the entire country. The satellite map does not show the northern states. If that can be rectified  this is a five star app.", "label": "3"}, {"sentence1": "Wow It does everything for me", "label": "5"}]