[{"sentence1": "Unstable", "label": "2"}, {"sentence1": "Please add Chromecast! =)", "label": "5"}, {"sentence1": "Very useful Yes very much useful", "label": "4"}, {"sentence1": "I think got", "label": "5"}, {"sentence1": "Gives Your phone a virus........", "label": "2"}, {"sentence1": "Where is the network support. I can't access shared folders on a LAN or ssh/ftp to anything...", "label": "3"}, {"sentence1": "Google play I'm good with it.", "label": "3"}, {"sentence1": "Trash Has not worked. Ever. Sucks", "label": "1"}, {"sentence1": "Comes in handy Use it a lot for theming", "label": "5"}, {"sentence1": "How to open the games in it. Please mention the procedure", "label": "2"}, {"sentence1": "Makes you update constantly. So annoying!", "label": "1"}, {"sentence1": "Pepe Pupu", "label": "5"}, {"sentence1": "help me I inadvertently move my game system and now I can not open the game  and I can not uninstall the game too..help me please ...sorry for my bad english..", "label": "1"}, {"sentence1": "Need more features. Also there's a problem that when someone delete his account  the channels that he made them  dosn't delete and the channel will be unusable for ever. Pls fix this !", "label": "4"}, {"sentence1": "Great online app", "label": "4"}, {"sentence1": "Wifi Game", "label": "5"}, {"sentence1": "Overall Amazing Everything is very well done except that it's missing 2 things. It is missing a few event quests and a BIG miss for me was Palico gear. It has no information  list or stats for Palico gear. I hope they add this at some point.", "label": "4"}, {"sentence1": "Love the game Love the game", "label": "5"}, {"sentence1": "For me it constantly keeps spawing the albino rat and it keeps merking me when im only on floor 1.......FLOOR 1", "label": "3"}, {"sentence1": "Hiii", "label": "4"}, {"sentence1": "Not working on nexus 7 with lollipop", "label": "2"}, {"sentence1": "Social login Any chance to use social account login so that my data is stored on cloud? That would be real nice!", "label": "4"}, {"sentence1": "it consumes more memory and drain battery", "label": "1"}, {"sentence1": "Goggles Services", "label": "5"}, {"sentence1": "I am disappointed in this app I have been trying to update it for more than a week now and it refuses to update.", "label": "2"}, {"sentence1": "Black screen on startup Useless.", "label": "1"}, {"sentence1": "I've always wanted to know how my storage is being used. Now I know. Great app! Thanks.", "label": "5"}, {"sentence1": "Sucked!! It didn't let me play any songs that I downloaded.... Can you please try to fix it then  maybe I will rate it better....", "label": "1"}, {"sentence1": "Good work Some bugs are still there it adds the script of copy text for example if I copy the text \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"my name is KING BRANDON \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" in 2 lines with hitting enter in anywhere in the text so after copy it add tag in changed line position !!!!! Fix this bug and get 5 star from most of the users !!!!!\"\"", "label": "2"}, {"sentence1": "Where do we download the games", "label": "3"}, {"sentence1": "Mohd. Sohial Husaini", "label": "2"}, {"sentence1": "People just don't like it..", "label": "1"}, {"sentence1": "Will not start  every time I try and start up my game it stops working", "label": "1"}, {"sentence1": "Very fast and responsive but the memory and power consumption is not small.", "label": "4"}, {"sentence1": "Best stimulator I liked this app for playing PS game", "label": "3"}, {"sentence1": "It makes me a writer 🙂", "label": "3"}, {"sentence1": "Does not support Mediatek MT6795 Helio X10 (gionee e8). Will keep it for upadte. Please do something.", "label": "1"}, {"sentence1": "Why Why did you remove the speed option...you're no different than the many other players now. I'm uninstalling!!!!!", "label": "1"}, {"sentence1": "It's OK Decided to uninstall when notifications started becoming too frequent with no ability to disable. Also  images in the articles sometimes don't show.", "label": "3"}, {"sentence1": "it is not installing properly annoying", "label": "1"}, {"sentence1": "Needs some smoothe text flow It's very good to work with odt files. Text size modification and smoothe text flow would make it better. And also a option to be introduced to lock the document avoid editing text by mistake while scrolling the document.", "label": "4"}, {"sentence1": "I always must update Google play.. why?", "label": "3"}, {"sentence1": "Logging out without my authorisation Yesterday  when I came to check my telegram  I saw that  my other telegram account has been logged out without my permission and because I don't have the chip with me  I'm unable to access it. Please when I get that account working  please fix whatever problem it is and then I'll give you the full 5 stars", "label": "4"}, {"sentence1": "It does BEST an emmulatir can on phone.Onky problem is we do NEED hardware ps2 controller to play same as ons ps2 or psp.", "label": "5"}, {"sentence1": "Note 3 After installing the app  it stated that it can not be used on my phone. Something about the Qualcomm not being right. So  if snoop snitch can not work  can stingray hit my phone?", "label": "3"}, {"sentence1": "Work great for me", "label": "5"}, {"sentence1": "For love it /", "label": "3"}, {"sentence1": "Consultant Geologist Good", "label": "4"}, {"sentence1": "Hail & thanks from Iran", "label": "5"}, {"sentence1": "10000 Plzzzz help me sir coz is tu hard tu succesed or join u plzzzz hv try long time bt no feedback sir plzzzz help me", "label": "2"}, {"sentence1": "Opeyemi Cool", "label": "4"}, {"sentence1": "communication hamara desh badal raha hai", "label": "4"}, {"sentence1": "Ashu Ashi", "label": "1"}, {"sentence1": "Good but crashes.. Crashes after sending an SMS every time using Fishtext connector on Nexus 6p. It used to be 5 star app so I hope it's fixed soon.", "label": "3"}, {"sentence1": "Not Working piece of junk", "label": "2"}, {"sentence1": "Good Flexible", "label": "3"}, {"sentence1": "Wnt bloody update", "label": "1"}, {"sentence1": "Where is the S7 Edge support?? Still waiting for the S7 Edge support. Please  hurry. 💔", "label": "3"}, {"sentence1": "Lol", "label": "2"}, {"sentence1": "Sweeeeeet!", "label": "5"}, {"sentence1": "Some bugs Upon picking certain roms it'll shut itself down", "label": "3"}, {"sentence1": "Sam Awasome", "label": "4"}, {"sentence1": "Perfect app otherwise The app is really great but sometimes text messages remain \"\"\"\"\"\"\"\"sending\"\"\"\"\"\"\"\"  it takes terminating the app  reopen  copy the old text  paste & send  deleting the old text to fix. Very annoying. Please fix if this is a bug. Thank you and keep the excellent work up!!!\"\"", "label": "4"}, {"sentence1": "Samsung J7 Wont work on my Samsung J7", "label": "3"}, {"sentence1": "Best app Sumeet", "label": "2"}, {"sentence1": "Does everything you would expect No adds  no nonsense.", "label": "5"}, {"sentence1": "Text colours? Needs more text colour options so I don't have to pick a wallpaper based on whether it allows me to see dash clock.", "label": "4"}, {"sentence1": "Annoying Annoying", "label": "2"}, {"sentence1": "Causes 50% of the battery drain even with poll switched off!!!", "label": "2"}, {"sentence1": "It takes a long time to download and why do I need this to use another app?", "label": "2"}, {"sentence1": "Nishant", "label": "5"}, {"sentence1": "Very boooring I really don't care for it cuz  I use it very little!!", "label": "2"}, {"sentence1": "Very helpful and easy accessibility", "label": "5"}, {"sentence1": "Mr vusi Man that is the best", "label": "1"}, {"sentence1": "No sound ??????????????? ??(???)? Why is there no sound not even 1 sound effect and it's really slow", "label": "1"}, {"sentence1": "Worst", "label": "2"}, {"sentence1": "Home screen support Would be awesome", "label": "5"}, {"sentence1": "Ummmmmmm", "label": "3"}, {"sentence1": "I don't even like this app because it force stopped most of my apps😫😬😬😤😤😠😠😠😡😡😡😡👿👿👿👿👿", "label": "1"}, {"sentence1": "Good  but.. Great game  but add checkpoints or something like that  then I will rate it 5 stars☆☆☆☆☆", "label": "4"}]