[{"sentence1": "Major Problem I love this app and enjoy using it  but every time I try to turn on the screen I'll hit the button and it'll take a couple seconds to come up. Used to not have the problem but I do now and it is incredibly annoying.", "label": "2"}, {"sentence1": "MI launcher issues It's working when i'm use stock launcher but  when switch to MI LAUNCHER it's not working. Please fix this for 5stars", "label": "3"}, {"sentence1": "It always says error when I'm downloading a music.", "label": "1"}, {"sentence1": "well I can not watch YouTube Because something wrong it is saying there is a problem with your account", "label": "3"}, {"sentence1": "Eh. My trade union has our group chat on it. Wouldn't have downloaded it otherwise. Well  maybe it's advantage is that its own group chat can take more people than Whatsapp's.", "label": "3"}, {"sentence1": "Another App that won't let me log in I am able to log in to my MAL just fine through the website  but for some reason not on this app.", "label": "1"}, {"sentence1": "Voox", "label": "5"}, {"sentence1": "SO GOOD $", "label": "5"}, {"sentence1": "It is simple to use", "label": "4"}, {"sentence1": "Won't refresh Used this Muzei source for a while now but it won't update beyond the 22 August. Would love for it to be fixed.", "label": "2"}, {"sentence1": "I like it I really like the lock screen but the torch gesture doesn't work and instead opens my browser. I have an HTC one m7 running 5.0.2. Please fix in next update.", "label": "4"}, {"sentence1": "I'll set my staffies on you Worst thing ever", "label": "1"}, {"sentence1": "Please I don't know how to go ahead. Please teache", "label": "5"}, {"sentence1": "I m very pleased", "label": "5"}, {"sentence1": "How it work ????", "label": "1"}, {"sentence1": "Help Help", "label": "2"}, {"sentence1": "Glitch Was running fine then stopped :(", "label": "2"}, {"sentence1": "Very clean Very clean and easy to use. The only suggestion I have  and it is not a make or break  is a notification if someone chats you. I don't know if that would be a problem to battery life but I'm loving to just open tin foil and use it and close it knowing it isn't eating up my precious battery life", "label": "4"}, {"sentence1": "This app is okay  but as others have already stated  there is a bug whereby it doesn't remember the location of my keepass database (Google drive). I must navigate to the file every time I want to open it. This bug is a deal breaker to be honest. The file location is correct but it doesn't open unless I manually browse to the DB. Please fix this. I will be uninstalling until the bug is addressed", "label": "3"}, {"sentence1": "Good enough to open docs I couldn't before", "label": "4"}]