[{"sentence1": "new update is weird. i can make bold text using *(text)* but suddenly it just stop yesterday... why is that happen?", "label": "2"}, {"sentence1": "Amazing!", "label": "3"}, {"sentence1": "Good Okk", "label": "5"}, {"sentence1": "Can you add reboot or shutdown commands maybe?", "label": "5"}, {"sentence1": "Convenient! I like having this when we go camping and have no signal.", "label": "5"}, {"sentence1": "How is it is use pls hlp..", "label": "1"}, {"sentence1": "black rose love 12345", "label": "4"}, {"sentence1": "This app is very good", "label": "4"}, {"sentence1": "4 No support on cyanogenmod dual sims", "label": "4"}, {"sentence1": "Needs an app to use another app? I don't care about most of them nor do I want to use them. Only 2  but can't Poor service from this.", "label": "2"}, {"sentence1": "Sucks Will not let me change time to 7:00 am", "label": "1"}, {"sentence1": "Best of luck! o7 Great app until Facebook borked it. But with new API  my contact photos are coming through just fine to third-party apps like textra  which was a main reason for having these apps. Honorary 5-star  but can't give it a full raiting when Android and Facebook do this natively again.", "label": "1"}, {"sentence1": "It is to slow. But nice", "label": "3"}, {"sentence1": "Love this app Been using this for years to make ringtones and alarms. Has never let me down.", "label": "5"}, {"sentence1": "Copy to sdcard", "label": "4"}, {"sentence1": "Madan uppi It's better than whats app", "label": "4"}, {"sentence1": "Sujan.man Excellent", "label": "5"}, {"sentence1": "How does it work? I don't know it's usage!It only helps blind or normal Humans to?Is it like SIRI?Sorry Google...", "label": "2"}, {"sentence1": "Large size Yeah so large size so i give 3 star", "label": "3"}, {"sentence1": "Error Not able to download and it's already updated", "label": "1"}, {"sentence1": "P Very good", "label": "3"}, {"sentence1": "Wow! I love it. Continue to develop more and more ups.It's very safe!", "label": "4"}, {"sentence1": "I don't want use this", "label": "2"}, {"sentence1": "annoying af", "label": "1"}, {"sentence1": "Notification led Just red green blue orange notification lights work correctly. Others show white. Other apps can light up correct colors. Old color picker was fine", "label": "3"}, {"sentence1": "No missed call alerts :( Undoubtedly the best but there is a problem where missed call alerts don't show up in the lock screen when I get a missed call on honor 4x. Please help !!", "label": "1"}, {"sentence1": "Cannot play music and math formulas are too small Some article have music. Those music cannot be played in the app. Math formulas are too small  and math or greek symbols are gone sometimes. Please fix it. Galaxy Tab 2.0", "label": "4"}, {"sentence1": "Crash Force close on intel atom Z2520 1.2Ghz", "label": "2"}, {"sentence1": "Amit Kumar sinha", "label": "5"}, {"sentence1": "i just play wwe 2k 14 and it was crash in games.... and ppsspp better them ppsspp gold", "label": "3"}, {"sentence1": "I like it ", "label": "4"}, {"sentence1": "About the Pokemon games I have been trying to play Pokemon black and white games on it   but it has lagged a lot. I have tried lowering the frame thing but it didn't work. Please help me", "label": "2"}, {"sentence1": "Suggestions/requests Update: \"\"\"\"\"\"\"\"v0.14.6\"\"\"\"\"\"\"\" still \"\"\"\"\"\"\"\"NO\"\"\"\"\"\"\"\" improvement on the requests for the app  1 • Badge counter issue still \"\"\"\"\"\"\"\"NOT\"\"\"\"\"\"\"\" fixed. 2 • Location sharing \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\" in send attachment options. 3 • Favourites contact speed dail bar on top of messages \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\". 4 • Fingerprint support in passphrase \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\". 5 • Ability to lock messages from been deleted easily in conversations \"\"\"\"\"\"\"\"NOT\"\"\"\"\"\"\"\" available. 6 • \"\"\"\"\"\"\"\"NO\"\"\"\"\"\"\"\" built-in sheduler. So my lower rating stands as it is  a 3 ☆ app until you acknowledge and improve the app from user feedback.\"\"", "label": "3"}, {"sentence1": "My son is autistic he just wants to watch Barney so why all this bullshit?", "label": "2"}, {"sentence1": "I don't get why we have to download it only to watch YouTube do something to get 5 stars GOOGLE", "label": "1"}, {"sentence1": "Don't know what to say It's relaxing but i don't know it work or not", "label": "5"}, {"sentence1": "Kesal Terlalu memakan banyak memori dan ram jadi cepat panas hp", "label": "1"}, {"sentence1": "Chit", "label": "2"}, {"sentence1": "Very bad it is Why not downloading play game", "label": "3"}, {"sentence1": "Really really love it!", "label": "5"}]