[{"sentence1": "Oh no why you haven't fixed the message issue... until then it's pretty useless...", "label": "2"}, {"sentence1": "I don't know what is wrong with this app but it's ridiculous. Doesn't play music it plays weird groaning noises  kind of sounds satanic.", "label": "1"}, {"sentence1": "Great idea! Wonderful dev and awesome application!", "label": "5"}, {"sentence1": "It let me view and edit but it wouldn't save any changes.", "label": "3"}, {"sentence1": "Used to be great  must have app Worked great until early May. Now won't back up. Error says have imap on  which is enabled  so don't know why it won't work. :-(", "label": "2"}, {"sentence1": "Fantastic So easy to use and setup classic games that never die", "label": "5"}, {"sentence1": "Great for sheet music practice! This app simply does what it says. I'd recommend this app to people wishing to practice sheet music from midi files.", "label": "5"}, {"sentence1": "Bast apps", "label": "3"}, {"sentence1": "..... This SUCKS!!!!!!!🙅🙅😫😫", "label": "1"}, {"sentence1": "Doesn't work with my ZTE projector I select the miracast option and the two devices connect  but nothing is projected.", "label": "3"}, {"sentence1": "Doesn't work Wont download", "label": "1"}, {"sentence1": "It is worst", "label": "1"}, {"sentence1": "Where i can find server address? This is not working. Uninstall.", "label": "1"}, {"sentence1": "The best app ever Sort of digital drug but it's amazing 😍😍😍", "label": "5"}, {"sentence1": "Awesome Needs more icon support  but what is available looks great", "label": "4"}, {"sentence1": "WiFi connected Ok", "label": "4"}, {"sentence1": "90% of functionality does not work", "label": "2"}, {"sentence1": "Great app. I can now keep track of books my children have. The only thing is I wish my children and I can all share the one library across devices. If anyone knows how please let me know", "label": "4"}, {"sentence1": "Yes Just great to identify those that are not seen just need to also have feature to copy and paste files(tranfer files to different locations)", "label": "4"}, {"sentence1": "Everytime i try to install it says that its not a psp game", "label": "1"}, {"sentence1": "Loved.it So helpfull", "label": "5"}, {"sentence1": "Feel Happy", "label": "4"}, {"sentence1": "Why some long texts are blind at this version? Please add several fonts  even Persian Language fonts to this official app", "label": "3"}, {"sentence1": "extremely perfect", "label": "5"}, {"sentence1": "i love", "label": "2"}, {"sentence1": "Functionality Problem First  I absolutely LOVE npr. I usually listen twice a day for an hour both times. This app  however  has some serious functionality problems with streaming/buffering. I take the bus to work every day and it is constantly stopping to buffer even when I have almost full bars of 4-g service.", "label": "2"}, {"sentence1": "Very Good Would have given 5 stars if it had a bookshelf built-in. Otherwise it is the best free E-book reader out there. Please bring the WP version to this level. Thanks to the developer.", "label": "4"}, {"sentence1": "No comments", "label": "3"}, {"sentence1": "Nice and simple  but can't read white on black QR codes without using the inverse option  which is annoying", "label": "4"}, {"sentence1": "Don't give up! This game is highly addictive and great fun. It can be frustrating at times  but once you learn the tricks you can finish the game.", "label": "5"}, {"sentence1": "Really good worth the money One thing I miss is to have a independent volume control  so I can lower down the music and be able to hear the sound from other apps.", "label": "4"}, {"sentence1": "Its actually good just need to be a little fast . please add a search option for the search of posts as well . please please its a request add all the post modification options in the app", "label": "3"}, {"sentence1": "Can not get to start.....", "label": "2"}, {"sentence1": "After three or four days gives message waiting for network. It's really irritating....", "label": "2"}, {"sentence1": "Bien bueno Gkkkuu", "label": "1"}, {"sentence1": "nice app", "label": "3"}, {"sentence1": "Doesn't save properly I have edited the same part ten times and saved. Not there when I reopen.", "label": "2"}, {"sentence1": "good okbah", "label": "5"}, {"sentence1": "A massive battery and RAM drainer......... I also don't want to give 1 star.........", "label": "1"}, {"sentence1": "Cannot write on sd card. I know is it due to google be evil policy  but some app seems to be able to bypass that", "label": "3"}]