[{"sentence1": "Where i can find server address? This is not working. Uninstall.", "label": "1"}, {"sentence1": "Really good worth the money One thing I miss is to have a independent volume control  so I can lower down the music and be able to hear the sound from other apps.", "label": "4"}, {"sentence1": "Cannot write on sd card. I know is it due to google be evil policy  but some app seems to be able to bypass that", "label": "3"}, {"sentence1": "Don't give up! This game is highly addictive and great fun. It can be frustrating at times  but once you learn the tricks you can finish the game.", "label": "5"}, {"sentence1": "Loved.it So helpfull", "label": "5"}, {"sentence1": "Awesome Needs more icon support  but what is available looks great", "label": "4"}, {"sentence1": "Used to be great  must have app Worked great until early May. Now won't back up. Error says have imap on  which is enabled  so don't know why it won't work. :-(", "label": "2"}, {"sentence1": "The best app ever Sort of digital drug but it's amazing 😍😍😍", "label": "5"}, {"sentence1": "Why some long texts are blind at this version? Please add several fonts  even Persian Language fonts to this official app", "label": "3"}, {"sentence1": "Very Good Would have given 5 stars if it had a bookshelf built-in. Otherwise it is the best free E-book reader out there. Please bring the WP version to this level. Thanks to the developer.", "label": "4"}, {"sentence1": "After three or four days gives message waiting for network. It's really irritating....", "label": "2"}, {"sentence1": "Doesn't work Wont download", "label": "1"}, {"sentence1": "Bien bueno Gkkkuu", "label": "1"}, {"sentence1": "Feel Happy", "label": "4"}, {"sentence1": "Oh no why you haven't fixed the message issue... until then it's pretty useless...", "label": "2"}, {"sentence1": "No comments", "label": "3"}, {"sentence1": "i love", "label": "2"}, {"sentence1": "Doesn't work with my ZTE projector I select the miracast option and the two devices connect  but nothing is projected.", "label": "3"}, {"sentence1": "A massive battery and RAM drainer......... I also don't want to give 1 star.........", "label": "1"}, {"sentence1": "extremely perfect", "label": "5"}]