[{"sentence1": "It is OK map", "label": "3"}, {"sentence1": "Not working Just wast of time", "label": "1"}, {"sentence1": "Really good worth the money One thing I miss is to have a independent volume control  so I can lower down the music and be able to hear the sound from other apps.", "label": "4"}, {"sentence1": "Why some long texts are blind at this version? Please add several fonts  even Persian Language fonts to this official app", "label": "3"}, {"sentence1": "Doesn't work Wont download", "label": "1"}, {"sentence1": "ousm love you all9855225764", "label": "5"}, {"sentence1": "Great app. I can now keep track of books my children have. The only thing is I wish my children and I can all share the one library across devices. If anyone knows how please let me know", "label": "4"}, {"sentence1": "Good app But map below wind direction is not visible due to heavy color effect of wind direction . Otherwise even a novice can rightly guess than met department", "label": "4"}, {"sentence1": "Dumbass make a better app Bitches", "label": "1"}, {"sentence1": "Great for sheet music practice! This app simply does what it says. I'd recommend this app to people wishing to practice sheet music from midi files.", "label": "5"}, {"sentence1": "Its very worst", "label": "1"}, {"sentence1": "Functionality Problem First  I absolutely LOVE npr. I usually listen twice a day for an hour both times. This app  however  has some serious functionality problems with streaming/buffering. I take the bus to work every day and it is constantly stopping to buffer even when I have almost full bars of 4-g service.", "label": "2"}, {"sentence1": "Awesome Needs more icon support  but what is available looks great", "label": "4"}, {"sentence1": "Crash when brightness scroll bar drags by finger. On CyanogenMod.", "label": "3"}, {"sentence1": "Outdated The maps of many of the cities are outdated. The app is great but it would be much better if all the cities have updated maps. Please update the maps for cities.", "label": "2"}, {"sentence1": "It's okay But it's slow when sending encrypted SMSs", "label": "3"}, {"sentence1": "I can't figure it out! I can not figure out how to post my new content please help I really want to use this app.", "label": "2"}, {"sentence1": "Used to be great  must have app Worked great until early May. Now won't back up. Error says have imap on  which is enabled  so don't know why it won't work. :-(", "label": "2"}, {"sentence1": "Useless and worst Please do not download it because u have to update it every time", "label": "1"}, {"sentence1": "good okbah", "label": "5"}, {"sentence1": "Doesn't work with my ZTE projector I select the miracast option and the two devices connect  but nothing is projected.", "label": "3"}, {"sentence1": "Does its job. I can't complain about the slow internet because I do prefer having privacy rather than quickness. I do wish though that there could be a way for orbot to work with tasker as a plugin rather than having to set up a whole list to open it and long click and all that crazy stuff. But overall  awesome app and service. Thank you.", "label": "4"}, {"sentence1": "Only card view for feeds  no categories.", "label": "2"}, {"sentence1": "extremely perfect", "label": "5"}, {"sentence1": "Not updating Please sort as I cant update", "label": "1"}, {"sentence1": "Please add archiving to the conversation !", "label": "4"}, {"sentence1": "Malayalam any software Very good", "label": "5"}, {"sentence1": "No text search? How come I can't search inside messages? This is a make or break feature in my opinion.", "label": "2"}, {"sentence1": "Good  but need help I love it  but I can't seem to get soul silver to work. All there is a white screen and no matter what I do there still is a white screen. Does anyone know how to fix this? Diamond is working just fine. I don't know if it's the Rom or what  but I got them from the same place so...", "label": "5"}, {"sentence1": "i love", "label": "2"}, {"sentence1": "Rahul Bishalgarh", "label": "2"}, {"sentence1": "Bast apps", "label": "3"}, {"sentence1": "It's been fine  but my battery seems to drain way faster now since the most recent update.", "label": "4"}, {"sentence1": "nice app", "label": "3"}, {"sentence1": "WiFi connected Ok", "label": "4"}, {"sentence1": "Don't give up! This game is highly addictive and great fun. It can be frustrating at times  but once you learn the tricks you can finish the game.", "label": "5"}, {"sentence1": "I was problem when i want updat this app.", "label": "2"}, {"sentence1": "Get rid of the address thing Its the only thing it whines about so i cant play this is a rip off.", "label": "1"}, {"sentence1": "It doesn't helps me... On charger it shows 1mAh  but when I charge my Note 3 on USB from my PC  it shows 0mAh. This was the most important for me  to see this value... but there is no value", "label": "2"}, {"sentence1": "Uses to much memory", "label": "1"}, {"sentence1": "It let me view and edit but it wouldn't save any changes.", "label": "3"}, {"sentence1": "Fantastic So easy to use and setup classic games that never die", "label": "5"}, {"sentence1": "Very easy to use I would like an apply/cancel changes button and stability check on boot that reset settings if system crash within an amount of time", "label": "4"}, {"sentence1": "Oh no why you haven't fixed the message issue... until then it's pretty useless...", "label": "2"}, {"sentence1": "Back to being good. Edit: Ads are back. Not so intrusive  but there. Original: After trying all the other options  I am back to this as the best sync option we have and now that the junk-ware episode is in the past  I can comfortably run and endorse it. The need for a more user friendly/clear way to handle non obvious matches would be my caveat on my 5 star rating. The rating is because it works as advertised without advertising ;-)", "label": "3"}, {"sentence1": "God tier  some games require the use of the combo buttons for comfortable play but in the end it all works out", "label": "4"}, {"sentence1": "Can not get to start.....", "label": "2"}, {"sentence1": "It is worst", "label": "1"}, {"sentence1": "LOVE IT I don't know if it's my device and it's poor RAM management  but MAP keeps closing? It's not always at the predetermined pause time you can set in the settings  it usually happens right after a new chapter is listed. Other than the constant closing of the app  it's neat flawless. Makes me want to listen to Audiobooks even more.", "label": "4"}, {"sentence1": "Doesn't save properly I have edited the same part ten times and saved. Not there when I reopen.", "label": "2"}, {"sentence1": "Its actually good just need to be a little fast . please add a search option for the search of posts as well . please please its a request add all the post modification options in the app", "label": "3"}, {"sentence1": "You tube Its good app", "label": "3"}, {"sentence1": "The best app ever Sort of digital drug but it's amazing 😍😍😍", "label": "5"}, {"sentence1": "Cannot write on sd card. I know is it due to google be evil policy  but some app seems to be able to bypass that", "label": "3"}, {"sentence1": "a must have for techs great to have running next to your workbench. quick access to info.", "label": "5"}, {"sentence1": "Everytime i try to install it says that its not a psp game", "label": "1"}, {"sentence1": "Synchronization. Facebook sync problem solved.", "label": "4"}, {"sentence1": "Great Easy to use  powerful", "label": "5"}, {"sentence1": "Feel Happy", "label": "4"}, {"sentence1": "90% of functionality does not work", "label": "2"}, {"sentence1": "Great Developer Excellent app.", "label": "5"}, {"sentence1": "Great idea! Wonderful dev and awesome application!", "label": "5"}, {"sentence1": "Not bad Heavyyy", "label": "2"}, {"sentence1": "Where i can find server address? This is not working. Uninstall.", "label": "1"}, {"sentence1": "whatsapp it incredible makes its easy for any program '\"\"", "label": "5"}, {"sentence1": "This is craptastic.hated.it!!!!", "label": "1"}, {"sentence1": "I love love telegram. The stickers are colourful and very cute. The privacy and efficiency that comes with this app is amazing. Theres no calling option yet but in my opinion its pretty unbeatable. And I rarely ever rate apps. This is by far the best app I use !", "label": "5"}, {"sentence1": "Yes Just great to identify those that are not seen just need to also have feature to copy and paste files(tranfer files to different locations)", "label": "4"}, {"sentence1": "..... This SUCKS!!!!!!!🙅🙅😫😫", "label": "1"}, {"sentence1": "Loved.it So helpfull", "label": "5"}, {"sentence1": "Nice and simple  but can't read white on black QR codes without using the inverse option  which is annoying", "label": "4"}, {"sentence1": "Very Good Would have given 5 stars if it had a bookshelf built-in. Otherwise it is the best free E-book reader out there. Please bring the WP version to this level. Thanks to the developer.", "label": "4"}, {"sentence1": "After three or four days gives message waiting for network. It's really irritating....", "label": "2"}, {"sentence1": "Not what I needed I wanted to open a docx file  it didn't open... Maybe it only supports open office formats  but it's not what I needed", "label": "3"}, {"sentence1": "A massive battery and RAM drainer......... I also don't want to give 1 star.........", "label": "1"}, {"sentence1": "I don't know what is wrong with this app but it's ridiculous. Doesn't play music it plays weird groaning noises  kind of sounds satanic.", "label": "1"}, {"sentence1": "Bien bueno Gkkkuu", "label": "1"}, {"sentence1": "sync failed", "label": "3"}, {"sentence1": "I prefer the older version style  but w/e. My main issues are with actual problems: force close when I try to open a context menu  and puzzles don't always save filled clues from the previous time I worked on them. Running ICS on LG Optimus G.", "label": "3"}, {"sentence1": "No comments", "label": "3"}]