[{"sentence1": "black rose love 12345", "label": "4"}, {"sentence1": "Good Okk", "label": "5"}, {"sentence1": "Apps تشکرمیکنم ازبرنامه ی دقیق وسرگرم کننده ی کاربرتون", "label": "4"}, {"sentence1": "Laggy! Bad sound quality!", "label": "2"}, {"sentence1": "Nice app Very useful app", "label": "5"}, {"sentence1": "Reduce size of update", "label": "3"}, {"sentence1": "Jaiswal Kamal", "label": "1"}, {"sentence1": "Convenient! I like having this when we go camping and have no signal.", "label": "5"}, {"sentence1": "Kesal Terlalu memakan banyak memori dan ram jadi cepat panas hp", "label": "1"}, {"sentence1": "Notification led Just red green blue orange notification lights work correctly. Others show white. Other apps can light up correct colors. Old color picker was fine", "label": "3"}, {"sentence1": "annoying af", "label": "1"}, {"sentence1": "Amit Kumar sinha", "label": "5"}, {"sentence1": "It gives you cellular device a blank screen Bad do not use", "label": "1"}, {"sentence1": "Wow! I love it. Continue to develop more and more ups.It's very safe!", "label": "4"}, {"sentence1": "good n useful app", "label": "5"}, {"sentence1": "So far so good. Its working so well.", "label": "3"}, {"sentence1": "lacking interactive actions good for some quick reads of articles and forum posts  but the only active option is recording a play (which is good). but I was expecting forum posting. an app like this is supposed to get people more involved in the online community  which it obviously does not.", "label": "2"}, {"sentence1": "Wow!!", "label": "3"}, {"sentence1": "Can you add reboot or shutdown commands maybe?", "label": "5"}, {"sentence1": "Chit", "label": "2"}, {"sentence1": "About the Pokemon games I have been trying to play Pokemon black and white games on it   but it has lagged a lot. I have tried lowering the frame thing but it didn't work. Please help me", "label": "2"}, {"sentence1": "No missed call alerts :( Undoubtedly the best but there is a problem where missed call alerts don't show up in the lock screen when I get a missed call on honor 4x. Please help !!", "label": "1"}, {"sentence1": "Cannot play music and math formulas are too small Some article have music. Those music cannot be played in the app. Math formulas are too small  and math or greek symbols are gone sometimes. Please fix it. Galaxy Tab 2.0", "label": "4"}, {"sentence1": "Mohamadreza", "label": "3"}, {"sentence1": "Disconnects without warning Occasionally drops connection without notifying which is a huge risk! If not for that  would certainly be a 4★ app.", "label": "2"}, {"sentence1": "Superrrrrrrr", "label": "5"}, {"sentence1": "Android L nothing happens on android L nexus 5", "label": "2"}, {"sentence1": "How is it is use pls hlp..", "label": "1"}, {"sentence1": "P Very good", "label": "3"}, {"sentence1": "I hate it my games won't open when I have the app it will say you will have to update the to play...", "label": "2"}, {"sentence1": "Love this app Been using this for years to make ringtones and alarms. Has never let me down.", "label": "5"}, {"sentence1": "Large size Yeah so large size so i give 3 star", "label": "3"}, {"sentence1": "The floating widget on lock screen is crooked.. Slated down and to the right.. Needs to be fixed...", "label": "2"}, {"sentence1": "Copy to sdcard", "label": "4"}, {"sentence1": "I don't get why we have to download it only to watch YouTube do something to get 5 stars GOOGLE", "label": "1"}, {"sentence1": "Really really love it!", "label": "5"}, {"sentence1": "new update is weird. i can make bold text using *(text)* but suddenly it just stop yesterday... why is that happen?", "label": "2"}, {"sentence1": "Excellent Well worth getting.", "label": "5"}, {"sentence1": "Dont get it I saw this working on some phones and i decided to install it and they ask me for root access  ain't nobody got time for that.", "label": "3"}, {"sentence1": "It is to slow. But nice", "label": "3"}, {"sentence1": "Best of luck! o7 Great app until Facebook borked it. But with new API  my contact photos are coming through just fine to third-party apps like textra  which was a main reason for having these apps. Honorary 5-star  but can't give it a full raiting when Android and Facebook do this natively again.", "label": "1"}, {"sentence1": "I like it ", "label": "4"}, {"sentence1": "Sucks Will not let me change time to 7:00 am", "label": "1"}, {"sentence1": "It's weird It just was to hard to unlock the screen!!! I was confused so much", "label": "4"}, {"sentence1": "i just play wwe 2k 14 and it was crash in games.... and ppsspp better them ppsspp gold", "label": "3"}, {"sentence1": "Error Not able to download and it's already updated", "label": "1"}, {"sentence1": "Suma Super", "label": "2"}, {"sentence1": "myo", "label": "5"}, {"sentence1": "Love it Just wish I could pause and rewind sections and search a large database of songs but otherwise it's awesome! Can't believe this is a free app! Now does anyone know where I can safely download some midi files?", "label": "4"}, {"sentence1": "It is wonderful!!!! Your service is very useful! I like this app", "label": "5"}, {"sentence1": "Worst Download pending", "label": "1"}, {"sentence1": "It has helped me a lot... thank you!", "label": "5"}, {"sentence1": "Don't know what to say It's relaxing but i don't know it work or not", "label": "5"}, {"sentence1": "Bad app  it makes my phone a turtle my phone is very very slow because google play Store is eating my hardware", "label": "1"}, {"sentence1": "Very bad it is Why not downloading play game", "label": "3"}, {"sentence1": "Lsober Don't know what you have done on last update  but now it takes three/four tries before I can make a change to my portfolio.... try to remove and replace with a different stock and it will not take.... I like the app but you guys are making changes without testing!!", "label": "2"}, {"sentence1": "Great App - very few \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"glitches\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\". Great app all the way around. I'm sure there's probably more customizing I could do with it  but 2 email accounts + 2 Live accounts  not a big contact list to deal with  so I'm all good. Suggestion : make a delete action possible  the same as 'mark as read' or 'reply'  in notification prompt as it should appear in Android Wear/Notification bar.\"\"", "label": "4"}, {"sentence1": "Galaxy Note 4 🌐 Iran Android ➡ 6.0.1 🔴", "label": "4"}, {"sentence1": "-1 Star Sometimes gmail deny the access to account  I don't even use any proxy. If this can be fixed  I'll add more star (y)", "label": "4"}, {"sentence1": "Used this for years. Good stuff! The biggest issues I have with this are FB restrictions on apps. Things that don't work right are FB shortcomings  no doubt on purpose. Most recently  the best thing is that I can use messenger within tinfoil and don't have to sign away all privacy rights to big bro FB to use their messenger. Yep  great app.", "label": "5"}, {"sentence1": "No File Explorer. It used to work on my old phone but now with my Kyocera Hydro Vibe it Crashes. If it wernt for this it would work because I have more than the recommended specs.", "label": "1"}, {"sentence1": "Crash Force close on intel atom Z2520 1.2Ghz", "label": "2"}, {"sentence1": "This app is very good", "label": "4"}, {"sentence1": "I don't want use this", "label": "2"}, {"sentence1": "Just donated and trying out... I just donated and am trying out features  etc. Rating adjustment  up or down  pending more usage. So far looks promising and more intuitive compared to other similar apps I've used  but jury not yet reached verdict. Donated because I know very well the long hours a good developer invests in application... so I don't mind skipping a Coke or cup of coffee to support the dev's hard work! So  to all you haters & lazya_s complainers wanting all for nothing  do something to improve the world or SHUT UP!", "label": "3"}, {"sentence1": "Why can't I send videos? It always crash whenever it try please fix it", "label": "3"}, {"sentence1": "Suggestions/requests Update: \"\"\"\"\"\"\"\"v0.14.6\"\"\"\"\"\"\"\" still \"\"\"\"\"\"\"\"NO\"\"\"\"\"\"\"\" improvement on the requests for the app  1 • Badge counter issue still \"\"\"\"\"\"\"\"NOT\"\"\"\"\"\"\"\" fixed. 2 • Location sharing \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\" in send attachment options. 3 • Favourites contact speed dail bar on top of messages \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\". 4 • Fingerprint support in passphrase \"\"\"\"\"\"\"\"MISSING\"\"\"\"\"\"\"\". 5 • Ability to lock messages from been deleted easily in conversations \"\"\"\"\"\"\"\"NOT\"\"\"\"\"\"\"\" available. 6 • \"\"\"\"\"\"\"\"NO\"\"\"\"\"\"\"\" built-in sheduler. So my lower rating stands as it is  a 3 ☆ app until you acknowledge and improve the app from user feedback.\"\"", "label": "3"}, {"sentence1": "Needs an app to use another app? I don't care about most of them nor do I want to use them. Only 2  but can't Poor service from this.", "label": "2"}, {"sentence1": "JM Mohlabine", "label": "4"}, {"sentence1": "Terrible. I purchased a month of ad free for the hell of it and I still get ads telling me that I can buy ad free. The UI is cludgy enough without unwanted ads and graphics. When you subscribe to a paid service it shouldn't feel like malware. Won't be spending on this app again.", "label": "1"}, {"sentence1": "4 No support on cyanogenmod dual sims", "label": "4"}, {"sentence1": "Amazing!", "label": "3"}, {"sentence1": "My son is autistic he just wants to watch Barney so why all this bullshit?", "label": "2"}, {"sentence1": "Forcefully", "label": "1"}, {"sentence1": "Only good when we want to install games", "label": "3"}, {"sentence1": "Crazy app!", "label": "4"}, {"sentence1": "How does it work? I don't know it's usage!It only helps blind or normal Humans to?Is it like SIRI?Sorry Google...", "label": "2"}, {"sentence1": "Noob Noob app", "label": "1"}, {"sentence1": "Madan uppi It's better than whats app", "label": "4"}, {"sentence1": "Sujan.man Excellent", "label": "5"}]