[{"sentence1": "Vi jay sagar Compulsory updation", "label": "3"}, {"sentence1": "Nice but can be improved Nice app but UI design is confusing (why is advanced on top??). Also wallpaper often does not change even when I set to change every 3 hours. Lastly it would be nice if you could add an option to assign one wallpaper to a timeslot. I have 8 wallpapers and would like to change like this: 6:00-9:00  9:00-12:00...", "label": "4"}, {"sentence1": "Good initiative I never dreamt that suggestion will convert to reality hats off to developer", "label": "5"}, {"sentence1": "THE HERO Matapang", "label": "2"}, {"sentence1": "Great app until it turn off my sound notifications menu. I can't change the sound in my ringtones or notification on my Note 4. Drove me nut for 3 days because I couldn't figure it out what was happening. I even did a factory hard reset because of it. Fix this!!", "label": "2"}, {"sentence1": "Good It's good. But i think it's better if we can use it offline.", "label": "4"}, {"sentence1": "Vice city stories has buffering", "label": "1"}, {"sentence1": "its good good", "label": "3"}, {"sentence1": "Best on its work but  U.I could look better. Better to use material design.kindly also add scanning previously captured pics from camera app stored on device storage .rest all is fine.", "label": "4"}, {"sentence1": "Bbb", "label": "2"}, {"sentence1": "Tap zoom  tap zoom is slow  pain to find books on phone. I wish it would offer to scan the phone for books you already saved to it. Had to manually find the folder with my books (root/DCIM/ePub). Need to repeatedly tap zoom in  wait to refresh  zoom in again 10 times to easily read the book. Nexus 6P", "label": "2"}, {"sentence1": "I guess it's important I am only eleven years old I am a kid I don't need responsibilities JK... 😔😓😅😒😏😁", "label": "2"}, {"sentence1": "Doesn't work anymore I'm using Android 4.2.2 and I can only edit an mp3 to make ringtone  but it won't save it  as a box appears and says Ringdroid has stopped. It offers reporting it to Google play  but clicking that says Play has stopped.", "label": "1"}, {"sentence1": "Play...the... store Game design... Super.... super app... more.... update....", "label": "5"}, {"sentence1": "Can't choose ur own wallpaper on the lockscreen Only two options 1. Black 2. Homesceen wallpaper. 5 stars if that is implemented", "label": "3"}, {"sentence1": "Hate", "label": "1"}, {"sentence1": "LG G3 Works well  however some options in the config file don't map to the UI and the app crashes if there is no network connection for any extended length of time.", "label": "3"}, {"sentence1": "very well", "label": "4"}, {"sentence1": "Need support for android Lollipop", "label": "2"}, {"sentence1": "Aria Aerial Platform", "label": "2"}, {"sentence1": "Hawler", "label": "4"}, {"sentence1": "Issues Never had a problem until now and it keeps slowing down my songs like wayyyyyu down its weird plz fix", "label": "1"}, {"sentence1": "Makes good pictures  GUI could be better Having to go to menus to change scene type or other details is a bit annoying. However  final output is good.", "label": "4"}, {"sentence1": "This apps is very helpful for me .I see this apps when i was to know somethings.So  i'm really like and use this apps. Thanks for @wikipedia", "label": "5"}, {"sentence1": "I really hated it yes I did 🙅🙅🙅🙅🙅🙅🙅", "label": "1"}, {"sentence1": "Best camera apps on playstote", "label": "4"}, {"sentence1": "⚠ Erro ⚠ Não consigo deletar meu canal. Criei um canal a mais ou menos 1 ano e não consigo deletar-lo. Podem me dizer qual é o erro?", "label": "2"}, {"sentence1": "Good app keep it up", "label": "4"}, {"sentence1": "Great Idea Did not work for me. Yes  U enabled permissions and turned it on within the app.", "label": "1"}, {"sentence1": "Nothing  but do more", "label": "5"}, {"sentence1": "Ok Not the greatest but still good", "label": "3"}, {"sentence1": "Not Easy! Fun for a while  despite the difficulty.", "label": "4"}, {"sentence1": "Ok Really awkward to use. Why does the puzzle hug the left side of the screen? You can rarely guess which clue it will jump to next. The clues don't stay in sync with which box is highlighted. You have to double tap a square to get it to go. And more.", "label": "2"}, {"sentence1": "Google Play service app up to date nahi hota hai bahut Mushkil Hai", "label": "1"}, {"sentence1": "WTF!cant root phone", "label": "1"}, {"sentence1": "Google talkback Luv it", "label": "5"}, {"sentence1": "Wrost app !", "label": "1"}, {"sentence1": "Guise plz help how to use this", "label": "3"}, {"sentence1": "It wont let me go on YouTube and theres a new episode of Disney toys fan", "label": "3"}, {"sentence1": "AMAZING APP My LG Optimus had no way of sending anything  mostly pics and videos to my external SD card thus devouring my memory. Now I have 100 times the memory for adding other apps. THANK YOU THANK YOU THANK YOU!!!", "label": "5"}, {"sentence1": "Can't see entire image at once I really like this app  but unless the image has the exact aspect ratio of my device (Nexus 7 or Moto G)  after tapping the app icon  I can't see the entire image at once. I have to swipe up and down or left and right to get a feel for what the whole looks like. It still brings a tiny amount of joy into every day.", "label": "4"}, {"sentence1": "Would you fix the gane for my phone my Phone Model is Motorola XT1080 Because whenever I pick a game it suddenly crashes", "label": "4"}, {"sentence1": "Beyond Compare I use this app on every mobile device and it's always my first stop for totally custom sounds.", "label": "5"}, {"sentence1": "Salman Khan", "label": "5"}, {"sentence1": "Supprb", "label": "5"}, {"sentence1": "Unfortunately Reicast has stopped I have a tesco hudl2 and the bios is in the right directory and has been checked and works with nulldc and is named right but anytime i try and load the bios i get message mentioned above is this an issue with x86 based socs or have i done something wrong", "label": "1"}, {"sentence1": "For those nights I can't sleep  it works great Love it", "label": "4"}, {"sentence1": "great reader feature rich  simple to use - well done", "label": "5"}, {"sentence1": "Weird b because I have it on my computer and when I looked up a song on the pc it gave me like 500 results and when I looked up the same song on my phone I got like 10", "label": "2"}, {"sentence1": "It doesn't have a lot of old school music or if you type too many words it won't work.", "label": "2"}, {"sentence1": "No choice 😐", "label": "3"}, {"sentence1": "Great app How about adding fingerprint lock too. That works swell I guess", "label": "4"}, {"sentence1": "Ssh Doesnt support ssh private keys", "label": "2"}, {"sentence1": "Atttt", "label": "2"}, {"sentence1": "It doesn't always send you notifications right away when someone messages you even though I have it set up to notify me in the settings. Sometimes it doesn't notify me that someone sent me a message from up to 1 to 6 hours later. I have to keep checking back to see if I got new messages and that is very annoying. Other than that everything else works well.", "label": "3"}, {"sentence1": "Not working miui 8 Not working on miui 7 or 8  no change visible", "label": "3"}, {"sentence1": "Request a feature to edit existing photos and replace them.", "label": "4"}, {"sentence1": "Marshmallow incompatible screen locks once loaded. So becomes useless :( please fix this brilliant app)", "label": "1"}, {"sentence1": "Rajusaroo", "label": "2"}, {"sentence1": "Useful I like this app so much.", "label": "5"}, {"sentence1": "Great apps finally", "label": "5"}, {"sentence1": "Will not scan", "label": "1"}, {"sentence1": "Shorter timeout is not working Turn on the screen fine  but the timeout doesn't work even the lock permission is activated.", "label": "3"}, {"sentence1": "Very usefull", "label": "4"}, {"sentence1": "Need some Improvement  like in Group no msg delete or clear all history option available  please add it  make it improve.", "label": "4"}, {"sentence1": "This is Calendar that keeps your privacy. No need Internet to work. Doesn't Collect any data from my device even in research purposes. Thanks for great app. P.S. There are more apps from this developer that worth attention if you want to keep your data private.", "label": "5"}, {"sentence1": "Its rokzzzz", "label": "3"}, {"sentence1": "After I attend to a notification while my screen is awake and them i lock my screen and unlock it again  that notification still appears on the lockscreen. Plzz fix. Otherwise it is a wonderful and an elegant app.", "label": "3"}, {"sentence1": "413. That’s an error. Your client issued a request that was too large.That’s all we know. 413. That’s an error. Your client issued a request that was too large.That’s all we know.", "label": "3"}, {"sentence1": "ttt fff yyy", "label": "5"}, {"sentence1": "Program functions fine  but I can't seem to have progress by time comes. Sorry but I think this app is not for me.", "label": "1"}, {"sentence1": "Thats good", "label": "2"}, {"sentence1": "Best clock widget on google play! Great app  love the design and simplicity. This is what I was searching for a long time :)", "label": "5"}, {"sentence1": "Excellent And free", "label": "5"}, {"sentence1": "A Developer Hacker wackjob is using it to access my personal devise using saved voice commands to daily redirect my devise. Yet the coward will not allow me to report in real-time their conduct by emailing NJ State Police by filing a complaint.", "label": "1"}, {"sentence1": "Too bad...", "label": "1"}, {"sentence1": "EH It's kinda good I mean not really tho", "label": "3"}, {"sentence1": "No title So I got the game/app and the question is  how do you get games?", "label": "3"}, {"sentence1": "How do you get bios in? This sucks. I downloaded dreamcast bios and that error message keeps popping up. Is there a certain app I need to get it from?", "label": "1"}, {"sentence1": "it drains more battery or space i install bcoz of store want this service or youtube also...", "label": "2"}]