[{"sentence1": "doesnt work it keeps saying there has been an error installing superuser please fix", "label": "3"}, {"sentence1": "Its a great emulator except that the emulator crashes in the middle of a game or the characters glitch out", "label": "3"}, {"sentence1": "ನೈಸ application Download one's its very useful", "label": "4"}, {"sentence1": "&gt;_&lt; grrr! Loads for a second or two and stops Loads for a second or two and stops", "label": "1"}, {"sentence1": "Srinu", "label": "4"}, {"sentence1": "Waste of time", "label": "2"}, {"sentence1": "Elek Lemot", "label": "1"}, {"sentence1": "Great It's working beautifully  include a survival mode and arcade mode where you can make things easily without monsters   control time of day and more things. Right now user interface is so confusing I can't play the game. But it's an awesome initiative a free Minecraft game. So I would give it 3 stars", "label": "3"}, {"sentence1": "Simple", "label": "5"}, {"sentence1": "Downloads App more than once", "label": "2"}, {"sentence1": "Akhilesh nirmal India", "label": "2"}, {"sentence1": "It's just awsome", "label": "5"}, {"sentence1": "Doesn't handle SSL certificate changes well. Just get stuck in a loop. Clearing data/cache didn't help... Or is it just broken on Android N?", "label": "2"}, {"sentence1": "Sony HX400V Perfectly work with Sony HX400V model...", "label": "4"}, {"sentence1": "Can i download some music that i wanted to be learn? Huling elbimbo", "label": "3"}, {"sentence1": "Homemaker Self", "label": "4"}, {"sentence1": "Superb Apps", "label": "4"}, {"sentence1": "Faltu.. Why I need a permission of this app in installation of other app.???", "label": "1"}, {"sentence1": "I thing is good", "label": "3"}, {"sentence1": "Very good app  but auto refresh isn't working properly on Android 5.1 CM12 :(", "label": "5"}, {"sentence1": "Great music app Download music from here to your real music app. Only needs to update the music list and more 80s and 90s an I'll rate 5 stars", "label": "4"}, {"sentence1": "Dope I like this app if u got problems with the app itself download this app then download the frostwire plus you'll get better results", "label": "5"}, {"sentence1": "Oh my good. Its work", "label": "5"}, {"sentence1": "Crashes whenever i try to customize blur to no blur at all  then app wont work until i delete its data and start again", "label": "2"}, {"sentence1": "Error", "label": "2"}, {"sentence1": "some days later it takes update continue and this is so boring.", "label": "4"}, {"sentence1": "Celebrate Good", "label": "4"}, {"sentence1": "I tried to look up some music and the search engine is totally broken  i got no results but stuff i wouldnt listen to kept on coming up", "label": "1"}, {"sentence1": "Coc Good", "label": "3"}, {"sentence1": "Easily the best Android MTG App. Would love a deck builder  but won't give it anything other than 5 stars anyways. Dev was quick to respond to requests for features and added almost everything I requested!", "label": "5"}, {"sentence1": "Leoangelo Ayw magupdate", "label": "2"}, {"sentence1": "Nougat has broken notifications Notifications and broken in Nougat", "label": "1"}, {"sentence1": "Good Bri keep it up", "label": "5"}, {"sentence1": "Over heats your phone", "label": "1"}, {"sentence1": "It's somehow accurate", "label": "3"}, {"sentence1": "This is very useful application H", "label": "2"}, {"sentence1": "Unlike the pc version On the pc version I was able to get through iboss but am unable to do so with this version  any help?", "label": "3"}, {"sentence1": "IM ONLY DOING THIS TO MAKE A VIDEO😡", "label": "1"}, {"sentence1": "Hindi is not available", "label": "1"}, {"sentence1": "Great fun for book lovers!! If u r a enthusiastic reader then this app is one of the best.", "label": "5"}]