[{"sentence1": "Not working miui 8 Not working on miui 7 or 8  no change visible", "label": "3"}, {"sentence1": "It doesn't always send you notifications right away when someone messages you even though I have it set up to notify me in the settings. Sometimes it doesn't notify me that someone sent me a message from up to 1 to 6 hours later. I have to keep checking back to see if I got new messages and that is very annoying. Other than that everything else works well.", "label": "3"}, {"sentence1": "Thats good", "label": "2"}, {"sentence1": "Great app until it turn off my sound notifications menu. I can't change the sound in my ringtones or notification on my Note 4. Drove me nut for 3 days because I couldn't figure it out what was happening. I even did a factory hard reset because of it. Fix this!!", "label": "2"}, {"sentence1": "Best camera apps on playstote", "label": "4"}, {"sentence1": "Hate", "label": "1"}, {"sentence1": "Very usefull", "label": "4"}, {"sentence1": "WTF!cant root phone", "label": "1"}, {"sentence1": "Its rokzzzz", "label": "3"}, {"sentence1": "THE HERO Matapang", "label": "2"}, {"sentence1": "Good It's good. But i think it's better if we can use it offline.", "label": "4"}, {"sentence1": "Salman Khan", "label": "5"}, {"sentence1": "Too bad...", "label": "1"}, {"sentence1": "Nice but can be improved Nice app but UI design is confusing (why is advanced on top??). Also wallpaper often does not change even when I set to change every 3 hours. Lastly it would be nice if you could add an option to assign one wallpaper to a timeslot. I have 8 wallpapers and would like to change like this: 6:00-9:00  9:00-12:00...", "label": "4"}, {"sentence1": "This apps is very helpful for me .I see this apps when i was to know somethings.So  i'm really like and use this apps. Thanks for @wikipedia", "label": "5"}, {"sentence1": "Shorter timeout is not working Turn on the screen fine  but the timeout doesn't work even the lock permission is activated.", "label": "3"}, {"sentence1": "Vice city stories has buffering", "label": "1"}, {"sentence1": "great reader feature rich  simple to use - well done", "label": "5"}, {"sentence1": "I guess it's important I am only eleven years old I am a kid I don't need responsibilities JK... 😔😓😅😒😏😁", "label": "2"}, {"sentence1": "Excellent And free", "label": "5"}]