[{"sentence1": "well I can not watch YouTube Because something wrong it is saying there is a problem with your account", "label": "3"}, {"sentence1": "Won't refresh Used this Muzei source for a while now but it won't update beyond the 22 August. Would love for it to be fixed.", "label": "2"}, {"sentence1": "It takes a lot of memories so that i cant save photos  videos  files...", "label": "3"}, {"sentence1": "Helpful Very helpful in finding wat we actually need", "label": "4"}, {"sentence1": "Help Help", "label": "2"}, {"sentence1": "Good enough to open docs I couldn't before", "label": "4"}, {"sentence1": "I like it I really like the lock screen but the torch gesture doesn't work and instead opens my browser. I have an HTC one m7 running 5.0.2. Please fix in next update.", "label": "4"}, {"sentence1": "Well done Google Well done Google thanks", "label": "5"}, {"sentence1": "Voox", "label": "5"}, {"sentence1": "Very Sad So recently I've been having problems with K9 mail and despite my best efforts it still persists. I have had problems checking my other accounts on it after checking one of them  for instance if I check one email account and then try to check another the program just hangs. I have to clear the cache and force a stop for it to work again. So that being said I'm switching.", "label": "2"}, {"sentence1": "I'll set my staffies on you Worst thing ever", "label": "1"}, {"sentence1": "Improve voice call", "label": "5"}, {"sentence1": "SO GOOD $", "label": "5"}, {"sentence1": "zero stars privacy affront An affront to privacy", "label": "1"}, {"sentence1": "I m very pleased", "label": "5"}, {"sentence1": "Droid ultra 4.4 Actually really accurate for me... Only problem is when not charging it shows 200mA not 0 but when charging it matches the chargers specs  tested with multiple amperage chargers. Would be extra nice if it only updated while charging. Seems silly to make it update when not connected to power", "label": "4"}, {"sentence1": "Great app. A must have app.", "label": "5"}, {"sentence1": "Glitch Was running fine then stopped :(", "label": "2"}, {"sentence1": "I can not make it so the volume buttons turn it on tell me how to I'm on galaxy s5", "label": "2"}, {"sentence1": "Awesome experince", "label": "3"}, {"sentence1": "Rainfall forcast not updating. become a bit slower to download uodates. rainfall is not at all updating since 8 days.", "label": "3"}, {"sentence1": "Is cool and nice app everywhere u are", "label": "3"}, {"sentence1": "Useful and still evolving!", "label": "5"}, {"sentence1": "Horrible When I would go to cut a song it played in slow motion & I couldn't understand it.", "label": "1"}, {"sentence1": "Please I don't know how to go ahead. Please teache", "label": "5"}, {"sentence1": "Azad Nice", "label": "2"}, {"sentence1": "Please add a quicker way to delete Like the app so far but really would prefer a button on the toolbar to delete rather than having to use the three dot menu", "label": "4"}, {"sentence1": "Good: Simple  quick and open source. Problem: I set a folder as Home so it's the first thing I see when opening the app. The Home keeps getting reset back to root. I'm only using that because there's no option to have a shortcut widget for that folder on the phone Home Screen.", "label": "4"}, {"sentence1": "Can't update. Error code -19. Now what? All google apps same error codes...", "label": "1"}, {"sentence1": "Good.. but ws not responding...so installed again", "label": "2"}, {"sentence1": "This app is okay  but as others have already stated  there is a bug whereby it doesn't remember the location of my keepass database (Google drive). I must navigate to the file every time I want to open it. This bug is a deal breaker to be honest. The file location is correct but it doesn't open unless I manually browse to the DB. Please fix this. I will be uninstalling until the bug is addressed", "label": "3"}, {"sentence1": "Won't uninstall!! It didn't do anything and now it won't uninstall! When I try to deactivate it  first  it only tells me I have to deactivate it before I can uninstall it. But that's what I'm trying to do!", "label": "1"}, {"sentence1": "It is simple to use", "label": "4"}, {"sentence1": "Eh. My trade union has our group chat on it. Wouldn't have downloaded it otherwise. Well  maybe it's advantage is that its own group chat can take more people than Whatsapp's.", "label": "3"}, {"sentence1": "MI launcher issues It's working when i'm use stock launcher but  when switch to MI LAUNCHER it's not working. Please fix this for 5stars", "label": "3"}, {"sentence1": "Another App that won't let me log in I am able to log in to my MAL just fine through the website  but for some reason not on this app.", "label": "1"}, {"sentence1": "Very clean Very clean and easy to use. The only suggestion I have  and it is not a make or break  is a notification if someone chats you. I don't know if that would be a problem to battery life but I'm loving to just open tin foil and use it and close it knowing it isn't eating up my precious battery life", "label": "4"}, {"sentence1": "How it work ????", "label": "1"}, {"sentence1": "Major Problem I love this app and enjoy using it  but every time I try to turn on the screen I'll hit the button and it'll take a couple seconds to come up. Used to not have the problem but I do now and it is incredibly annoying.", "label": "2"}, {"sentence1": "It always says error when I'm downloading a music.", "label": "1"}]