[{"sentence1": "Manju Good", "label": "2"}, {"sentence1": "It's a decent app doesn't have every song I want...", "label": "3"}, {"sentence1": "on 5 sir i can find any questions?", "label": "4"}, {"sentence1": "Color Change I won't be updating due to the color change. Bring black back as an option.", "label": "2"}, {"sentence1": "Beautyful Beautiful", "label": "5"}, {"sentence1": "Will not read bios Will not find my bios file. It keeps wanting me to put it in a different folder and when I put it there it acts like it's going to open then closes and tells me to put it in a different folder. I had it working at one point then It just stopped and started doing this. I want this to work", "label": "1"}, {"sentence1": "wtf? is it for? confused", "label": "1"}, {"sentence1": "Nice very nice still try n to figure all there is involve. But super duper", "label": "4"}, {"sentence1": "Nice Y? Bake key not worke", "label": "5"}, {"sentence1": "Why it is not updating on my phone?", "label": "2"}, {"sentence1": "pretty great except for the bit that you can't set and scale your own wallpapers and it zooms in and it makes it look off", "label": "3"}, {"sentence1": "Simple Just like it says  simple. Just what I needed. All music files are found and listed. Nice! But I gave only 4 stars cuz when I try to edit the artist  title  etc in a song the info I change won't save and sometimes the app will crash afterwards. Otherwise  love it!", "label": "4"}, {"sentence1": "Sau Ttttytt", "label": "5"}, {"sentence1": "Material Design strikes again... Another good app bites the dust. This used to be one of the better ereaders out there  although not the most customizable. Now the controls are all rearranged  most awkwardly  so the ones I want are least accessible & the ones I don't need are most unavoidable. This has a number of nice features Moon Reader lacks--& lacks a number Moon Reader has.", "label": "3"}, {"sentence1": "Pritpal Singh Pirty", "label": "3"}, {"sentence1": "Nice D", "label": "5"}, {"sentence1": "Worst app...", "label": "2"}, {"sentence1": "Keka", "label": "1"}, {"sentence1": "Slowing the dialer Unfortunately I have to remove the app. its slowed my phone 😢", "label": "1"}, {"sentence1": "Why does it need permission to see my contacts?", "label": "4"}]