[{"sentence1": "WiFi cannot", "label": "5"}, {"sentence1": "Doesn't always sync with MAL Doesn't always sync with MAL. Doesn't report errors when sync fails", "label": "2"}, {"sentence1": "Nice D", "label": "5"}, {"sentence1": "Worst app...", "label": "2"}, {"sentence1": "Beautyful Beautiful", "label": "5"}, {"sentence1": "Bakwas h aap sonকততপগদকললস সকককততততষোাা্্দদহবসসয", "label": "4"}, {"sentence1": "pretty great except for the bit that you can't set and scale your own wallpapers and it zooms in and it makes it look off", "label": "3"}, {"sentence1": "Unfortunately  reicast has stopped I don't know why it can happen  i think i surely do like everyone  i search guide about it to set up in youtube and googe  that made us be confused", "label": "2"}, {"sentence1": "Why it is not updating on my phone?", "label": "2"}, {"sentence1": "Quick to delete Mistakenly deleted myself from a group now I can't be re added... also their should be a group button other than contacts", "label": "3"}, {"sentence1": "420 stoned", "label": "5"}, {"sentence1": "Good app Vr nice", "label": "5"}, {"sentence1": "Killer", "label": "4"}, {"sentence1": "Yall Need To Worked On This App. I Have This App For Like 3 or 4 Weeks & Still No Update For This App Yet.I Hope The Updated Version Would Be Less Lagging & Run More Faster & Smoother.All The Free DS Emulator Apps (Except Drastic) On Goggle Play Freaking Sucks.People Would Rather Pay For Drastic DS Than Dealing This Or Any Other Free Crappy DS Emulators On Google Play.So If Yall Reading This I Hope This Get Yall Pumped Up To Improved This App & Also Try To One-Up The People Who Made Drastic DS.", "label": "2"}, {"sentence1": "Pritpal Singh Pirty", "label": "3"}, {"sentence1": "Keka", "label": "1"}, {"sentence1": "Best app. Best app for dwnlding movie nd songs..", "label": "4"}, {"sentence1": "wtf? is it for? confused", "label": "1"}, {"sentence1": "on 5 sir i can find any questions?", "label": "4"}, {"sentence1": "Archana Jaiswal", "label": "1"}, {"sentence1": "Simple Just like it says  simple. Just what I needed. All music files are found and listed. Nice! But I gave only 4 stars cuz when I try to edit the artist  title  etc in a song the info I change won't save and sometimes the app will crash afterwards. Otherwise  love it!", "label": "4"}, {"sentence1": "Arrggghhhhh It wants me to update it but i cant im so angry!!", "label": "1"}, {"sentence1": "Manju Good", "label": "2"}, {"sentence1": "Slowing the dialer Unfortunately I have to remove the app. its slowed my phone 😢", "label": "1"}, {"sentence1": "only gidra gidra store xa", "label": "3"}, {"sentence1": "IT SUCKS", "label": "1"}, {"sentence1": "Nice very nice still try n to figure all there is involve. But super duper", "label": "4"}, {"sentence1": "Material Design strikes again... Another good app bites the dust. This used to be one of the better ereaders out there  although not the most customizable. Now the controls are all rearranged  most awkwardly  so the ones I want are least accessible & the ones I don't need are most unavoidable. This has a number of nice features Moon Reader lacks--& lacks a number Moon Reader has.", "label": "3"}, {"sentence1": "Sau Ttttytt", "label": "5"}, {"sentence1": "Color Change I won't be updating due to the color change. Bring black back as an option.", "label": "2"}, {"sentence1": "Backup is hacked Now this App doesn't backup to sched  will not backup by settings  backup fails at end of the month--every 7 days will not backup as config; manual backup now used primarily.", "label": "1"}, {"sentence1": "Please fix Ever since new update it takes forever to load the song I chose to make into a ringtone", "label": "3"}, {"sentence1": "Good Amazing", "label": "5"}, {"sentence1": "Will not read bios Will not find my bios file. It keeps wanting me to put it in a different folder and when I put it there it acts like it's going to open then closes and tells me to put it in a different folder. I had it working at one point then It just stopped and started doing this. I want this to work", "label": "1"}, {"sentence1": "How to setup the wizard", "label": "4"}, {"sentence1": "Nice Y? Bake key not worke", "label": "5"}, {"sentence1": "It's a decent app doesn't have every song I want...", "label": "3"}, {"sentence1": "Why does it need permission to see my contacts?", "label": "4"}, {"sentence1": "It's new update is not updating Google I will be so pleased if you will fix mine problem that my problem is that the new update you recently launched is not updating on my mobile android version is marshmallow when it comes to be install it gives error", "label": "3"}, {"sentence1": "It's great if you plan to never use another phone again. If you do  the option to transfer your authenticator settings to your new device is not there. You have to re-enter each entry manually after you've cancelled it. Problem is many companies require long and time heavy procedures to remove the authenticator verification from your account just so you can reapply it to the authenticator on your new device. Stay away untill they fix the problem.", "label": "2"}]