[{"sentence1": "Baddest Baddest emulator ever multi touch is not working in this app. Delete this app from playstore", "label": "1"}, {"sentence1": "Backup is hacked Now this App doesn't backup to sched  will not backup by settings  backup fails at end of the month--every 7 days will not backup as config; manual backup now used primarily.", "label": "1"}, {"sentence1": "Like a hacker", "label": "5"}, {"sentence1": "Pritpal Singh Pirty", "label": "3"}, {"sentence1": "420 stoned", "label": "5"}, {"sentence1": "Beautyful Beautiful", "label": "5"}, {"sentence1": "Can't delete cagegories Now I can't delete any existing categories in wordpress. Really ruins my work", "label": "3"}, {"sentence1": "ITS LAG AF I JUST WANT PLAY POKEMON ;-;", "label": "1"}, {"sentence1": "Worst app...", "label": "2"}, {"sentence1": "The updates keep throwing the 'unfortunately google play services has stopped working' error. Had to remove updates to get my phone back", "label": "2"}, {"sentence1": "Good It's a useful app", "label": "4"}, {"sentence1": "I can't manually add permission on a specific app", "label": "2"}, {"sentence1": "only gidra gidra store xa", "label": "3"}, {"sentence1": "wtf? is it for? confused", "label": "1"}, {"sentence1": "Simple Just like it says  simple. Just what I needed. All music files are found and listed. Nice! But I gave only 4 stars cuz when I try to edit the artist  title  etc in a song the info I change won't save and sometimes the app will crash afterwards. Otherwise  love it!", "label": "4"}, {"sentence1": "this is for total beginners nothing fir advance users", "label": "1"}, {"sentence1": "Lynn I have used this for years and loved it now with.the update I have problem with the mail format. Can't get rid of the From To CC BCC and description. It used to just have To: and Description. Anyhow I cannot fix so have uninstalled. Help!", "label": "2"}, {"sentence1": "Great IM app. I wish less emphasis on stickers though. Also  more integrations with products like: gCalendar  slack and other. Already reported but mention here as well  cache is not deleting locally on my phone after 7 days (setting that I really would like to work) . any simple VoIP would be great!. please add Russian into settings-&gt;language. Mark as read from notification menu. Email registration option without phone number.", "label": "4"}, {"sentence1": "Unfortunately  reicast has stopped I don't know why it can happen  i think i surely do like everyone  i search guide about it to set up in youtube and googe  that made us be confused", "label": "2"}, {"sentence1": "Simple and useful utility. I think this app's elegance is in its simplicity. It presents everything about your Rasp Pi on one screen  and isn't complicated to use. The only suggestion I'd make to the developer is - try to make this app more Material Designed  with better themes. Also - allow some custom actions or commands to be programmed by the user for controlling their Pi. Otherwise  I'd give this app five stars.", "label": "4"}, {"sentence1": "Nice Y? Bake key not worke", "label": "5"}, {"sentence1": "2nd best The look is very nice  it's fluid and well designed  but Yatse just has more features. Honestly  if you add Notifications integrations and pause/play in Kodi on call start/end  I'd probably switch.", "label": "3"}, {"sentence1": "How to add rage face?", "label": "2"}, {"sentence1": "Monkey island?? Is monkey island ever coming to android? Had it on the iPhone but now have an htc  disappointed that I can't get it.", "label": "3"}, {"sentence1": "Iske update na hone se kuch ni chalta", "label": "5"}, {"sentence1": "Open source  no ads  works great Thank you to all the contributors", "label": "5"}, {"sentence1": "Very Poor App I am using this app as i purchased bt with fon. I connect using the app and then lock and unlock ny phone  the app does not auto login and then this causes problems  which means i have shut down the app and disconnect from the hotspot and then reconnect. Also the connection drops out with this app all the time which is annoying.", "label": "2"}, {"sentence1": "Everytime I have to update it  it takes forever ii go off screen I have to start update all over again. This is just crazy. Its been installing for 40 mins now.like I have nothing better to do besides sit here and make sure its updated so I can use other apps.", "label": "1"}, {"sentence1": "BEST ringtone mixer ever!!! Works GREAT!!! Easy-to-use!!! LOVE IT!!!", "label": "5"}, {"sentence1": "Do Not Download! You've Been Warned! This application has attached it's self to my phone and I'm unable to remove it! I've reached out to the developers for help on how to remove the admin rights and no one has responded. I have turned off all of it's functions but when you attempt to remove the admin for the application it freezes the crashes the setting! I am reaching out to Google for assistance since I belive this app is pure spam! Galaxy Note 5.", "label": "1"}, {"sentence1": "Gj", "label": "3"}, {"sentence1": "Will not read bios Will not find my bios file. It keeps wanting me to put it in a different folder and when I put it there it acts like it's going to open then closes and tells me to put it in a different folder. I had it working at one point then It just stopped and started doing this. I want this to work", "label": "1"}, {"sentence1": "Good app Vr nice", "label": "5"}, {"sentence1": "Nice D", "label": "5"}, {"sentence1": "Yall Need To Worked On This App. I Have This App For Like 3 or 4 Weeks & Still No Update For This App Yet.I Hope The Updated Version Would Be Less Lagging & Run More Faster & Smoother.All The Free DS Emulator Apps (Except Drastic) On Goggle Play Freaking Sucks.People Would Rather Pay For Drastic DS Than Dealing This Or Any Other Free Crappy DS Emulators On Google Play.So If Yall Reading This I Hope This Get Yall Pumped Up To Improved This App & Also Try To One-Up The People Who Made Drastic DS.", "label": "2"}, {"sentence1": "Missing some key things: SASL identification doesn't work. Close button and /part seem to do nothing. A button for nick auto-completion  like AndChat has  would be good. Also  a minor thing  but I should still be able to /join channels  despite there being a button to do this. Some /list functionality would be great; right now  this command crashes the app. Otherwise  a well designed client. Easier to use than others  without sacrificing features.", "label": "3"}, {"sentence1": "Best app. Best app for dwnlding movie nd songs..", "label": "4"}, {"sentence1": "Archana Jaiswal", "label": "1"}, {"sentence1": "Why it is not updating on my phone?", "label": "2"}, {"sentence1": "Material Design strikes again... Another good app bites the dust. This used to be one of the better ereaders out there  although not the most customizable. Now the controls are all rearranged  most awkwardly  so the ones I want are least accessible & the ones I don't need are most unavoidable. This has a number of nice features Moon Reader lacks--& lacks a number Moon Reader has.", "label": "3"}, {"sentence1": "How to setup the wizard", "label": "4"}, {"sentence1": "Needs features No ISS location. Needs Cardboard viewing mode.", "label": "3"}, {"sentence1": "Sau Ttttytt", "label": "5"}, {"sentence1": "Bar kays New relese", "label": "3"}, {"sentence1": "Good app but free version forces you to watch an ad before you can shut down the app. Wouldn't be so bad if the ads weren't near impossible to close. The ad free version is a monthly subscription fee  I understand that you have to make your money somehow but a monthly fee is a bit much.", "label": "2"}, {"sentence1": "Color Change I won't be updating due to the color change. Bring black back as an option.", "label": "2"}, {"sentence1": "Good creativity", "label": "5"}, {"sentence1": "Bakwas h aap sonকততপগদকললস সকককততততষোাা্্দদহবসসয", "label": "4"}, {"sentence1": "Doesn't always sync with MAL Doesn't always sync with MAL. Doesn't report errors when sync fails", "label": "2"}, {"sentence1": "Map needs improvement When I attempt to use the map feature it always puts me on the other side of the world. I am not sure why it doesn't GPS my location and give me the closest correlating address.", "label": "3"}, {"sentence1": "Won't load what do I do???", "label": "1"}, {"sentence1": "It has great potential This app has a lot of cool features. I love the sticker setup. And it is so convenient for group chats. Really can get used to this.", "label": "4"}, {"sentence1": "It's great if you plan to never use another phone again. If you do  the option to transfer your authenticator settings to your new device is not there. You have to re-enter each entry manually after you've cancelled it. Problem is many companies require long and time heavy procedures to remove the authenticator verification from your account just so you can reapply it to the authenticator on your new device. Stay away untill they fix the problem.", "label": "2"}, {"sentence1": "They sure do help my apps run better  thank you!", "label": "5"}, {"sentence1": "Manju Good", "label": "2"}, {"sentence1": "Hitesh sharma", "label": "2"}, {"sentence1": "My life is ruined since my Tablet got updated and i need this stuff just to enjoy what i want. But Keep The Good Work!", "label": "2"}, {"sentence1": "Trash Absolute trash  I can't even update it.", "label": "1"}, {"sentence1": "on 5 sir i can find any questions?", "label": "4"}, {"sentence1": "pretty great except for the bit that you can't set and scale your own wallpapers and it zooms in and it makes it look off", "label": "3"}, {"sentence1": "Good Amazing", "label": "5"}, {"sentence1": "Keka", "label": "1"}, {"sentence1": "easy to use ... cool desing help me to manage my routers ... hope this not collect user credentials XD", "label": "4"}, {"sentence1": "Quick to delete Mistakenly deleted myself from a group now I can't be re added... also their should be a group button other than contacts", "label": "3"}, {"sentence1": "It's a decent app doesn't have every song I want...", "label": "3"}, {"sentence1": "Amazing for a alpha  wish there was a better way to import files but that's the only down side so far!", "label": "4"}, {"sentence1": "Arrggghhhhh It wants me to update it but i cant im so angry!!", "label": "1"}, {"sentence1": "IT SUCKS", "label": "1"}, {"sentence1": "Nice very nice still try n to figure all there is involve. But super duper", "label": "4"}, {"sentence1": "Poor It's very bad to have a programme that is useless in your phone. .just like this 1 doesn't want to function at all...", "label": "1"}, {"sentence1": "Please fix Ever since new update it takes forever to load the song I chose to make into a ringtone", "label": "3"}, {"sentence1": "Really solid app Top notch just really really needs a keyboard!", "label": "4"}, {"sentence1": "Superb I was very disappointed with my samsung j5 2016 model which produced pathetically blurred images. But this app improved the picture quality tremendously. Very nice app highly recommend for samsung 2016 j series users", "label": "5"}, {"sentence1": "Slowing the dialer Unfortunately I have to remove the app. its slowed my phone 😢", "label": "1"}, {"sentence1": "Killer", "label": "4"}, {"sentence1": "The best I loved it I have been donwloading about 10 apps till I found this appp it is the best esey fast and of course original loved it best application ever always", "label": "5"}, {"sentence1": "Why does it need permission to see my contacts?", "label": "4"}, {"sentence1": "WiFi cannot", "label": "5"}, {"sentence1": "It's new update is not updating Google I will be so pleased if you will fix mine problem that my problem is that the new update you recently launched is not updating on my mobile android version is marshmallow when it comes to be install it gives error", "label": "3"}, {"sentence1": "Super Super nahi", "label": "4"}]