[{"sentence1": "No supporting My Mobile is micromax Q414 whenever i try to play god of war : ghost of Sparta ppsspp - PSP emulator says   ppsspp not responding. Pls fix it", "label": "3"}, {"sentence1": "Only time I ever lost root was when I replaced superuser by chainsdd with this  it did nothing  not sure why.", "label": "2"}, {"sentence1": "zero stars privacy affront An affront to privacy", "label": "1"}, {"sentence1": "The application itself is really neat  it's exactly what i wanted  sadly the rating will be low due to it's not replacing the lockscreen  it's adding on top of it  which means i can't simply use my fingerscanner to go into the device immediately. The idea is 10/10 it's exactly what makes Android much better  hopefully this can be sorted.", "label": "3"}, {"sentence1": "It ok This kind of works good", "label": "4"}, {"sentence1": "Everything is amazing but wish it would should a picture of the weapons or armors", "label": "4"}, {"sentence1": "Best PF srd app for android Great work. I'd like the ability to bookmark from a search (without clicking into the page)  but good nonetheless.", "label": "4"}, {"sentence1": "Mere phone ki google play service stop ho gyi h. Updated krne par google play service has stopped aa raha h koi btayega k kya karu?", "label": "4"}, {"sentence1": "I like it I really like the lock screen but the torch gesture doesn't work and instead opens my browser. I have an HTC one m7 running 5.0.2. Please fix in next update.", "label": "4"}, {"sentence1": "Wtf I recently upgraded my android and now it only says I have three contacts synced with fb. My old phone synced EVERYBODY. Fix this", "label": "3"}, {"sentence1": "Azad Nice", "label": "2"}, {"sentence1": "Bad experience.. Very much time consuming", "label": "1"}, {"sentence1": "Great app. A must have app.", "label": "5"}, {"sentence1": "The best app Its easy to use it has sticker memes", "label": "5"}, {"sentence1": "Improve voice call", "label": "5"}, {"sentence1": "Good enough to open docs I couldn't before", "label": "4"}, {"sentence1": "Earth. War", "label": "2"}, {"sentence1": "I want new version but this app not updating in my phone What I am do?", "label": "5"}, {"sentence1": "Connection is very slow**", "label": "3"}, {"sentence1": "Deck Lists? This is a good app with plenty of useful features  but I really wish it had decklist building support. It has a wish list feature  but I really wish there were support for multiple named lists of cards  ideally with analyzation tools and whatnot (similar to tappedout)  but even just lists would be fine.", "label": "4"}, {"sentence1": "Very clean Very clean and easy to use. The only suggestion I have  and it is not a make or break  is a notification if someone chats you. I don't know if that would be a problem to battery life but I'm loving to just open tin foil and use it and close it knowing it isn't eating up my precious battery life", "label": "4"}, {"sentence1": "well I can not watch YouTube Because something wrong it is saying there is a problem with your account", "label": "3"}, {"sentence1": "I can not make it so the volume buttons turn it on tell me how to I'm on galaxy s5", "label": "2"}, {"sentence1": "Other than the anonymity thing  chrome is 1000x better. Extremely slow  google doesnt seem to work. Half the time pages dont even load.", "label": "1"}, {"sentence1": "The photos are still seen after deleting. Wtf", "label": "2"}, {"sentence1": "I can't root my galaxy grand neo duos", "label": "2"}, {"sentence1": "Awesome experince", "label": "3"}, {"sentence1": "Cash money I like this applications", "label": "3"}, {"sentence1": "It consumes a lots of memory of my device.", "label": "1"}, {"sentence1": "It is simple to use", "label": "4"}, {"sentence1": "Cnnt updte wdout googleply its hell", "label": "1"}, {"sentence1": "Auto backup problem in miui8 Plz tell me why it is not working in note 3 miui8 auto backup not working properly", "label": "3"}, {"sentence1": "Please add a quicker way to delete Like the app so far but really would prefer a button on the toolbar to delete rather than having to use the three dot menu", "label": "4"}, {"sentence1": "Please I don't know how to go ahead. Please teache", "label": "5"}, {"sentence1": "Another App that won't let me log in I am able to log in to my MAL just fine through the website  but for some reason not on this app.", "label": "1"}, {"sentence1": "Updates and updates and updates WTF is this.. Too much of updates..", "label": "1"}, {"sentence1": "How it work ????", "label": "1"}, {"sentence1": "Very Sad So recently I've been having problems with K9 mail and despite my best efforts it still persists. I have had problems checking my other accounts on it after checking one of them  for instance if I check one email account and then try to check another the program just hangs. I have to clear the cache and force a stop for it to work again. So that being said I'm switching.", "label": "2"}, {"sentence1": "I m very pleased", "label": "5"}, {"sentence1": "MI launcher issues It's working when i'm use stock launcher but  when switch to MI LAUNCHER it's not working. Please fix this for 5stars", "label": "3"}, {"sentence1": "This app USED TO be good but now its got less music please change it back to the old FrostWire", "label": "2"}, {"sentence1": "Help Help", "label": "2"}, {"sentence1": "It always says error when I'm downloading a music.", "label": "1"}, {"sentence1": "I'll set my staffies on you Worst thing ever", "label": "1"}, {"sentence1": "Major Problem I love this app and enjoy using it  but every time I try to turn on the screen I'll hit the button and it'll take a couple seconds to come up. Used to not have the problem but I do now and it is incredibly annoying.", "label": "2"}, {"sentence1": "Rainfall forcast not updating. become a bit slower to download uodates. rainfall is not at all updating since 8 days.", "label": "3"}, {"sentence1": "Can't update. Error code -19. Now what? All google apps same error codes...", "label": "1"}, {"sentence1": "Horrible When I would go to cut a song it played in slow motion & I couldn't understand it.", "label": "1"}, {"sentence1": "Mytides", "label": "4"}, {"sentence1": "Eh. My trade union has our group chat on it. Wouldn't have downloaded it otherwise. Well  maybe it's advantage is that its own group chat can take more people than Whatsapp's.", "label": "3"}, {"sentence1": "Well done Google Well done Google thanks", "label": "5"}, {"sentence1": "Good Its the best except for 1 thing that the frame rate is so slow on some games", "label": "4"}, {"sentence1": "JILLUR RAHMAN", "label": "4"}, {"sentence1": "I hate it for every second that I have to use this.", "label": "1"}, {"sentence1": "I want to run Google play store", "label": "3"}, {"sentence1": "This app is okay  but as others have already stated  there is a bug whereby it doesn't remember the location of my keepass database (Google drive). I must navigate to the file every time I want to open it. This bug is a deal breaker to be honest. The file location is correct but it doesn't open unless I manually browse to the DB. Please fix this. I will be uninstalling until the bug is addressed", "label": "3"}, {"sentence1": "I hate it it won't update Sucksss", "label": "1"}, {"sentence1": "Great magic card app. Search is good  and the trading functionality is very very useful. It's just a solid app with a good interface.", "label": "5"}, {"sentence1": "Great tool Awesome and handy to have in ap form", "label": "5"}, {"sentence1": "best thing since females twerking", "label": "5"}, {"sentence1": "You should add bows.", "label": "5"}, {"sentence1": "Droid ultra 4.4 Actually really accurate for me... Only problem is when not charging it shows 200mA not 0 but when charging it matches the chargers specs  tested with multiple amperage chargers. Would be extra nice if it only updated while charging. Seems silly to make it update when not connected to power", "label": "4"}, {"sentence1": "Voox", "label": "5"}, {"sentence1": "Good.. but ws not responding...so installed again", "label": "2"}, {"sentence1": "Timer and delay are mismatched. App stops and go to sleep after screen goes black (screen off  standby  call it whatever you want).", "label": "3"}, {"sentence1": "Helpful Very helpful in finding wat we actually need", "label": "4"}, {"sentence1": "Good: Simple  quick and open source. Problem: I set a folder as Home so it's the first thing I see when opening the app. The Home keeps getting reset back to root. I'm only using that because there's no option to have a shortcut widget for that folder on the phone Home Screen.", "label": "4"}, {"sentence1": "Manoj Kumar", "label": "5"}, {"sentence1": "Ayyaz Gujjar", "label": "2"}, {"sentence1": "Glitch Was running fine then stopped :(", "label": "2"}, {"sentence1": "Won't refresh Used this Muzei source for a while now but it won't update beyond the 22 August. Would love for it to be fixed.", "label": "2"}, {"sentence1": "I think it is to many app i have to delete for me cause i only have a limited amount of storage", "label": "2"}, {"sentence1": "I liked the earlier version", "label": "2"}, {"sentence1": "Is cool and nice app everywhere u are", "label": "3"}, {"sentence1": "It takes a lot of memories so that i cant save photos  videos  files...", "label": "3"}, {"sentence1": "Rupali Sinha", "label": "1"}, {"sentence1": "SO GOOD $", "label": "5"}, {"sentence1": "Excellent app. Seems amazingly accurate. A great way to get my kid interested in astronomy/science. We saw what I thought was Mars (reddish color) but Skymap identified it as Betelgeuse. We googled Betelgeuse and found out we were actually looking at a red giant star over 600 light years away. Alot of fun for us.", "label": "5"}, {"sentence1": "Useful and still evolving!", "label": "5"}, {"sentence1": "Won't uninstall!! It didn't do anything and now it won't uninstall! When I try to deactivate it  first  it only tells me I have to deactivate it before I can uninstall it. But that's what I'm trying to do!", "label": "1"}]