[{"sentence1": "Does what it's meant to do Could be a little nicer UI wise but it gets the job done in a fair bit of style. I'm sure with time it'll get improved.", "label": "4"}, {"sentence1": "It's ol", "label": "5"}, {"sentence1": "I thing is good", "label": "3"}, {"sentence1": "I tried to look up some music and the search engine is totally broken  i got no results but stuff i wouldnt listen to kept on coming up", "label": "1"}, {"sentence1": "Shashi Kumar", "label": "3"}, {"sentence1": "It didn't work at all. I had to unistall it right away.", "label": "2"}, {"sentence1": "&gt;_&lt; grrr! Loads for a second or two and stops Loads for a second or two and stops", "label": "1"}, {"sentence1": "Homemaker Self", "label": "4"}, {"sentence1": "Fun Great way to get my puzzle fix!", "label": "4"}, {"sentence1": "Still the only app that works at calibration when my aging nexus 7 goes crazy with its orientation sensors.", "label": "5"}, {"sentence1": "Newly updated version is an editing nightmare I still have problems with the UI on this new version not \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"keeping up\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\". Deleting text results in the cursor missing words  going \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"through\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" them and then deleting the word before instead.\"\"", "label": "2"}, {"sentence1": "It's very better after this new update but there are a few themes for it!!", "label": "4"}, {"sentence1": "Don't really care", "label": "4"}, {"sentence1": "Waste of time", "label": "2"}, {"sentence1": "Crashes all the time. Bugs live forever. It seems that Google doesn't care for it at all.", "label": "1"}, {"sentence1": "Error", "label": "2"}, {"sentence1": "Would never bring anything up  the search bar would just continue to spin.", "label": "1"}, {"sentence1": "ನೈಸ application Download one's its very useful", "label": "4"}, {"sentence1": "Doesn't handle SSL certificate changes well. Just get stuck in a loop. Clearing data/cache didn't help... Or is it just broken on Android N?", "label": "2"}, {"sentence1": "Hated it I hate how I have to up date it just to use YouTube or anything else really", "label": "1"}, {"sentence1": "It's just awsome", "label": "5"}, {"sentence1": "But this does not support landscape mode :(", "label": "3"}, {"sentence1": "Not for me No google task support. No subtasks for projects. No repeating tasks.", "label": "2"}, {"sentence1": "It's somehow accurate", "label": "3"}, {"sentence1": "Private Search Engine  doesn't personalized  but results lack.", "label": "2"}, {"sentence1": "Srinu", "label": "4"}, {"sentence1": "Simple", "label": "5"}, {"sentence1": "Hommmm good", "label": "2"}, {"sentence1": "Messed up my screen App manager would flip screen off after this app installed. Better apps out there", "label": "2"}, {"sentence1": "Unlike the pc version On the pc version I was able to get through iboss but am unable to do so with this version  any help?", "label": "3"}, {"sentence1": "Over heats your phone", "label": "1"}, {"sentence1": "Leoangelo Ayw magupdate", "label": "2"}, {"sentence1": "Last version not working I had to go back.I think is something wrong with root permission because it dont ask for.Other thing I dont like is the color of checkboxes in settings  so please make them more visible because I hardly can dintinguish if it is on or off.", "label": "3"}, {"sentence1": "Very good app  but auto refresh isn't working properly on Android 5.1 CM12 :(", "label": "5"}, {"sentence1": "Nafas Tanhaie", "label": "5"}, {"sentence1": "This is very useful application H", "label": "2"}, {"sentence1": "Sony HX400V Perfectly work with Sony HX400V model...", "label": "4"}, {"sentence1": "Superb Apps", "label": "4"}, {"sentence1": "Its a great emulator except that the emulator crashes in the middle of a game or the characters glitch out", "label": "3"}, {"sentence1": "It is best for knowledge", "label": "3"}, {"sentence1": "Great fun for book lovers!! If u r a enthusiastic reader then this app is one of the best.", "label": "5"}, {"sentence1": "No Only update because you tube", "label": "1"}, {"sentence1": "Elek Ruwt", "label": "1"}, {"sentence1": "Moto G4 mobile data issue LTE is not working after reboot while \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"Fix startup data leak\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" option enabled. Without this option data leaks presents during wifi connection.\"\"", "label": "4"}, {"sentence1": "Why does this reroute & record? Traitorous NSA complicity?", "label": "2"}, {"sentence1": "Coc Good", "label": "3"}, {"sentence1": "Nice! 2 factor! I feel better already! easy is never secure and secure is never easy!", "label": "5"}, {"sentence1": "Waste of storage", "label": "1"}, {"sentence1": "This is a great start from an image recognition. But I found a severe flaw: A friend sent me a QR code in an MMS message. There is no way to import the image into the scanner. I had to forward the MMS to a friend's phone and scan his screen to read it in.", "label": "3"}, {"sentence1": "Akhilesh nirmal India", "label": "2"}, {"sentence1": "Great music app Download music from here to your real music app. Only needs to update the music list and more 80s and 90s an I'll rate 5 stars", "label": "4"}, {"sentence1": "Easily the best Android MTG App. Would love a deck builder  but won't give it anything other than 5 stars anyways. Dev was quick to respond to requests for features and added almost everything I requested!", "label": "5"}, {"sentence1": "doesnt work it keeps saying there has been an error installing superuser please fix", "label": "3"}, {"sentence1": "I try not to. Trying to quit!!!", "label": "3"}, {"sentence1": "Nice Performance good", "label": "4"}, {"sentence1": "Needs to show us our own stats The software keeps our stats somewhere internally so it can report to Google Play games. But there is no way for us to see them. Give us an interface that shows us our own stats  please. Also  at least give us some clue as to what the last 5 Google play games achievements are. Finally  if we are using show errors mode  find a way that mis-types don't count as hinted boxes. And if we start a puzzle in show errors mode  how about giving us a warning box to switch it back to hide errors before starting.", "label": "5"}, {"sentence1": "IM ONLY DOING THIS TO MAKE A VIDEO😡", "label": "1"}, {"sentence1": "Good Bri keep it up", "label": "5"}, {"sentence1": "Dope I like this app if u got problems with the app itself download this app then download the frostwire plus you'll get better results", "label": "5"}, {"sentence1": "Good. Does its job. Could be much improved.", "label": "3"}, {"sentence1": "Hindi is not available", "label": "1"}, {"sentence1": "Can i download some music that i wanted to be learn? Huling elbimbo", "label": "3"}, {"sentence1": "Guys you should add the 'stick to the front page' button on the app. It's usless if you must log on the pc to do it!", "label": "4"}, {"sentence1": "Downloads App more than once", "label": "2"}, {"sentence1": "Its best messenger you can find", "label": "5"}, {"sentence1": "Elek Lemot", "label": "1"}, {"sentence1": "SATENDRA Vishwkamar SATENDRA Vishwkamar", "label": "2"}, {"sentence1": "hahaha huhuhuhu", "label": "5"}, {"sentence1": "Faltu.. Why I need a permission of this app in installation of other app.???", "label": "1"}, {"sentence1": "I want it to b very easier for everyone using youtube", "label": "5"}, {"sentence1": "Great It's working beautifully  include a survival mode and arcade mode where you can make things easily without monsters   control time of day and more things. Right now user interface is so confusing I can't play the game. But it's an awesome initiative a free Minecraft game. So I would give it 3 stars", "label": "3"}, {"sentence1": "Oh my good. Its work", "label": "5"}, {"sentence1": "Interface not working anymore probably due to remote changes. Please update and it's back to a 5 star :)", "label": "3"}, {"sentence1": "NOTIFICATIONS!!!!!!!!!!!!!!!!!!", "label": "1"}, {"sentence1": "Celebrate Good", "label": "4"}, {"sentence1": "I will give 5 if you be able to add folders Nice mail programm I like it and use it as my default mail client. But it would be great if I could save male to a folders.", "label": "4"}, {"sentence1": "Nougat has broken notifications Notifications and broken in Nougat", "label": "1"}, {"sentence1": "Fu_Ck u google.... Forcing to Download Fu_cking play services Suck my Di_c_K", "label": "1"}, {"sentence1": "Crashes whenever i try to customize blur to no blur at all  then app wont work until i delete its data and start again", "label": "2"}, {"sentence1": "some days later it takes update continue and this is so boring.", "label": "4"}]