[{"sentence1": "Best app Very nice", "label": "4"}, {"sentence1": "Doesn't always switch WI-FI on when I enter trusted locations. Location is set on. Seems to switch off OK. I see someone else raised this issue previously but I don't see any solution posted. Update. As well as above it now switches WiFI on at random when well away from trusted locations. Will probably uninstall it. Android 6.0 Seems OK still on wife's Android 5.1 phone.", "label": "2"}, {"sentence1": "Frickin anoying", "label": "1"}, {"sentence1": "Like this app!! Quite useful & similar to WinDirStat in PC 😎😎", "label": "5"}, {"sentence1": "Why no cloud storage?? This would be perfect  but no cloud storage is a no go. I have used this for years but I don't want to risk losing my data. Moving to fuelio  I would stay but no cloud just doesn't work. It's 2016! Even my games auto save to the cloud!", "label": "4"}, {"sentence1": "Nearly Perfect The only thing I would find very handy is the ability to select an individual day for an alarm to go off. Other than that it's reliable  still sounds when phone is on silent and dead simple to set.", "label": "4"}, {"sentence1": "Nice app but little disappointed Creates notes well. But syncs from its single folder. So when syncing it reads notes but not notebooks. That makes it incomplete as the main purpose is using it with Tomboy notes from Linux. Please make this happen :) Update: as reported in launchpad this will be a feature in the next 0.8 release.", "label": "4"}, {"sentence1": "Won't work with Yahoo or Gmail With Yahoo and Gmail I get not the right user name or password. Tried web address for problems no place to send issue request. Works go on pop3 and Hotmail. Will change star if fixed.", "label": "2"}, {"sentence1": "It makes easiest to drive google", "label": "4"}, {"sentence1": "This app is dope af", "label": "4"}, {"sentence1": "No It's so slow", "label": "3"}, {"sentence1": "It doesn't work When I put in the right one its not working", "label": "1"}, {"sentence1": "This app not good bt more app not run so download", "label": "1"}, {"sentence1": "Enable", "label": "5"}, {"sentence1": "Slow  glitchy. Images don't load.", "label": "2"}, {"sentence1": "Force updates  and disabling other apps unless its updated", "label": "1"}, {"sentence1": "Html view Please separate html view and normal view", "label": "3"}, {"sentence1": "Only continuously downloaded if the app was open. Wouldn't download torrent if the phone was in sleep mode.", "label": "2"}, {"sentence1": "Not quite usable I love listening to Morning Edition  but you simply cannot do it with this app. It gets two stars since it technically CAN be done listening to one story at a time  but that is far from a good experience. The UI could use a little help  too.", "label": "2"}, {"sentence1": "Loved it at First I used it exclusively  but more I'm getting pop-up spam when I read some of its linked articles from the Smithsonian and other periodicals. I don't think it's safe. Uninstall.", "label": "2"}, {"sentence1": "Doesn't work Stop working after a week of using it", "label": "1"}, {"sentence1": "No password or pattern that would be useful I would give it a 5 star if they included it", "label": "3"}, {"sentence1": "Ha Good", "label": "3"}, {"sentence1": "Please guys reduce the size of the applications because the device storage gets almost full.", "label": "3"}, {"sentence1": "Just another form of Google's market strategy  its cool i get it. Its all business", "label": "3"}, {"sentence1": "Seems to work well so far.", "label": "3"}, {"sentence1": "Aliii Aliii", "label": "5"}, {"sentence1": "Best Very best app", "label": "5"}, {"sentence1": "It's OK but.....", "label": "2"}, {"sentence1": "Keep telling me to update but will not", "label": "1"}, {"sentence1": "Best one of it's kind Simple and well polished. It's also very helpful. The only thing that would make it better is images of the monsters and equipment.", "label": "4"}, {"sentence1": "Crash  crash  crash.", "label": "1"}, {"sentence1": "Not loadign..", "label": "2"}, {"sentence1": "Finally at last! I've been looking for an app of this function ever since I've begun to care about the appearance of my desktop. I have many static wallpapers  and yet I don't have anyway to display them all. I mean even at the rate of one new wallpaper a day  there is still not enough time to use all of them. I've been dreaming about an app such as this probably since the same day ive begon to use an Android device. It changes the wallpaper flawlessly and without any issues.", "label": "5"}, {"sentence1": "Every time I try to play a game it exit out by it self", "label": "3"}, {"sentence1": "Nice take of app", "label": "5"}, {"sentence1": "Need widgets to show different calenders It's nice but I need to set different calenders to different widgets not all show the same thing", "label": "3"}, {"sentence1": "I doesn't work correctly   when it closed   it starts again sending code again ....", "label": "1"}, {"sentence1": "Ooopps My clash of caln account has sign using this is", "label": "5"}, {"sentence1": "its so great...i luv it", "label": "5"}, {"sentence1": "All these years later  it still works as advertised! That's amazing and I really appreciate that! Thank you for keeping this app relevant and useful!", "label": "5"}, {"sentence1": "Open Camera worked only sporadically  immediately after installation  on my Samsung Galaxy S5 running Marshmallow 6.0.1. Now  the app freezes after every shot and doesn't save the pictures. It does the same installed on internal and external memory. Android reports that it's slowing my device. I have no choice but to uninstall. Disappointing. 👎", "label": "2"}, {"sentence1": "Better than metal", "label": "4"}, {"sentence1": "Best and all you gotta do is to search the apps by typing their names and boom!! Lightning fast execution of every code! Loved it!!", "label": "5"}, {"sentence1": "Its very good and best app", "label": "4"}, {"sentence1": "Wow.. great app", "label": "5"}, {"sentence1": "Streaming is troublesome Streaming will randomly stop when I hit my devices back button. The check box becomes unchecked as well  without user interaction. If a streaming song is buffering  the song will continue to play. This leads to missing 10-30 seconds of a song while waiting for it to buffer. Could there be an option to automatically pause the current song while it buffers? Overall this is the best android mpd client by far. It is very polished  and works consistently in most areas. Please address the streaming problems!", "label": "4"}, {"sentence1": "Difficult to find games Also give link to download cso file games", "label": "3"}, {"sentence1": "it's not starting. What happen? I'm starting it for 30 mins now and still it doesn't work. Please fix. God bless", "label": "3"}, {"sentence1": "Yup Tush tush yeah", "label": "3"}, {"sentence1": "Fails after each use", "label": "2"}, {"sentence1": "Main page and reading list I am not being able to open the reading list or app settings. All that appears at the start is featured article or no connection when there is no internet. Please fix these bugs which has got in the recent updates.", "label": "2"}, {"sentence1": "thanks for published with google play store. good app but one problem. sound is very bad. sorry", "label": "4"}, {"sentence1": "Screen overlay issues in Nexus 6p Great app. Only issue is the permission to draw over other apps causes conflicts on Nexus 6P. Constantly have to turn off to change permissions on other apps. Then you have to turn it back on again.", "label": "4"}, {"sentence1": "Google Play Services Very Loved It", "label": "5"}, {"sentence1": "Doesn't work every time I go to use it it says start failed please try again", "label": "1"}, {"sentence1": "Help me please It says I have to update but I did and it keeps saying that I did not help me please it will not let me watch YouTube unless I update but I did help me :'(", "label": "2"}, {"sentence1": "That \"\"\"\"\"\"\"\"impossible\"\"\"\"\"\"\"\" install bug is gone With this update. Installed free  updated pro and voilá ... Running with free uninstalled. Marshmallow android installs only ? Regardless  bug gone. Glitch vanquished.\"\"", "label": "4"}, {"sentence1": "Not working Not working on my Samsung SM-T211 tablet... NOT SCANNING AT ALL. WHY???", "label": "1"}, {"sentence1": "Ok  but.. The App is good but I'm extraordinarily missing the 24h Program Stream which is readily available on the homepage. Where is it?", "label": "3"}, {"sentence1": "Awsm Beautiful", "label": "3"}, {"sentence1": "It sucks  runs your battery down It keeps popping up in the background never turns off and runs your battery down", "label": "1"}, {"sentence1": "Waste of time It suddenly crashed and after i tried to load my last saved draft  there were a lot of parts missing", "label": "1"}, {"sentence1": "Useless!! Totally useless does not pair to anything. DON'T WASTE YOUR TIME", "label": "1"}, {"sentence1": "Tasin", "label": "2"}, {"sentence1": "Paul Dipa paul", "label": "5"}, {"sentence1": "Its just so much faster to navigate", "label": "5"}, {"sentence1": "Bugs It randomly locks my phone again when trying to unlock it", "label": "2"}, {"sentence1": "Balderdash", "label": "1"}, {"sentence1": "Breaks wifi Latest update breaks WiFi  phone constantly disconnects from known WiFi access points.", "label": "2"}, {"sentence1": "bal", "label": "4"}, {"sentence1": "Doesn't work with Android 5.0 Hi  I tried with Android 5.0 and it doens't work. Please update your app. Anyway  it's a great product!", "label": "5"}, {"sentence1": "Very helpful", "label": "4"}, {"sentence1": "Just restarts wifi Didn't work for me on my Galaxy S3. Just turned wifi off and on every minute or so  took up lots of process time and made the phone slow. Uninstalled five minutes after downloading.", "label": "2"}, {"sentence1": "Doesn't read txt? Useless The basic format that Windows notepad works in is txt. How you missed that I can't imagine. I guess your an apple nut trying to break into Android apps.", "label": "1"}, {"sentence1": "smd", "label": "3"}, {"sentence1": "Fast and powerful but... The UI design could be improved. So code is great  Design is not. Thank you guys", "label": "4"}, {"sentence1": "Ok Top", "label": "3"}, {"sentence1": "This aplication good use at all users becuse of the new version.", "label": "5"}, {"sentence1": "Total crap that keeps stalling other apps!", "label": "1"}]