[{"sentence1": "Only classical I would like more of a variety", "label": "1"}, {"sentence1": "Me tarda como 5 minutos en abrirla cada vez que contesto a algún mensaje  una perdida de tiempo total  solucione lo y le pongo 5 estrellas", "label": "2"}, {"sentence1": "Images Not giving it 5 stars until I can add custom images.", "label": "2"}, {"sentence1": "Slowness I mean it good but can u fix it so thats it isn't laggy and slow after that I'll rate 5 ?", "label": "3"}, {"sentence1": "grab this for more easily", "label": "4"}, {"sentence1": "Photo uploading is decidedly broken. The multi picker works great  but it is a coin toss whether each individual photo will upload successfully or hang at 80% and go nowhere. The only way to fix hung uploads is to delete it and then browse through your photos again to try once more. This is a huge burden when you upload 20 photos and 5 of them hang. This behavior is consistent whether on wifi or data. What's more  the only intuitive options for a poat are \"\"local draft\"\" or \"\"publish\"\". I can't get the app to default to \"\"draft\"\"  in which it is uploaded and able to be edited on my computer. Even if I only have the app as a way to upload cell photos  it is almost worthless at that.", "label": "2"}, {"sentence1": "It is sooooooo cool", "label": "1"}, {"sentence1": "Simple and just better Maybe you can consider to follow Lollipop design caused in the notification drop down only OS Monitor still in black color  thanks", "label": "5"}, {"sentence1": "GOOD GOOD", "label": "1"}, {"sentence1": "Got potential It's a bit too slow and unbalanced for my liking  but it has potential. Could use some form of sound  too. I'm not a fan of the percentage based experience point loss when killed. It's hard enough to level up  and fleeing doesn't always work.", "label": "3"}, {"sentence1": "rigi واقعا عالىه مرسى از زحماتتون", "label": "5"}, {"sentence1": "Nice idea but made my phone - Samsung s6 edge  slow to a crawl", "label": "2"}, {"sentence1": "Used to be great.. then I had to switch because of wrong dates (and therefore sorting) on some messages  lack of swipes  a crash constantly occurring when receiving some type of messages (probably malformed but no other client I have tried crashed because of that)  and missing features in notifications.", "label": "3"}, {"sentence1": "Seems to work fine. I've been using it to log hikes. the only problem i have is I can't get it to log to the SD card. (may be because I'm not too familiar with Android) If someone can give me a hint as to how to store the log on SD card I'll be a happy boy and will up it to 5 stars.", "label": "4"}, {"sentence1": "Nice! If only memory option...", "label": "3"}, {"sentence1": "Nostalgia Me  my dad  and my brother played this game a lot &lt;3", "label": "5"}, {"sentence1": "CAN'T REMOVE THIS STUPID BLOATWARE. IT'S MY PHONE NOT YOURS", "label": "1"}, {"sentence1": "Virus!!! App won't unistall from My device even after restarting in safe mode!!!", "label": "4"}, {"sentence1": "Simple & Strong tool for memorizing.. Love the statistics. Wish I had the option to set pre-configured card settings. Thanks.", "label": "5"}, {"sentence1": "AntennaPod Simple  handy player and downloader. Like the speed controls and jump forward and back buttons. Would be useful to have up / down speed buttons instead of a one-way scroll. Embedded player is accessible from file list that includes files not d/led with the app  though in this use it doesn't remember the position of paused files.", "label": "4"}]