[{"sentence1": "One of the best app This is the all which should have been built-in android by default👍👍", "label": "5"}, {"sentence1": "All", "label": "2"}, {"sentence1": "It crashes... ...on closing.", "label": "2"}, {"sentence1": "Awesome Still the best.... BTW the \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"stupid\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" icon is K-9 from Doctor Who  so it's not stupid. I love the new version.\"\"", "label": "5"}, {"sentence1": "I hated it bcz it charge my so much data", "label": "1"}, {"sentence1": "joth", "label": "2"}, {"sentence1": "Love it great app", "label": "5"}, {"sentence1": "Verry nic.cource All proudest hase smpli repair", "label": "2"}, {"sentence1": "Good . . . But . . . Update Needs more work. The app also fails to load all followed posts. Unless you open it every few hours you can look forward to missing some of the posts that you would have liked to have seen. I loaded my Reader in the app  and compared it with the browser version. In 12 hours I lost 50 posts. So. Useless if you only check once daily. Also needs better text formatting control.", "label": "3"}, {"sentence1": "Gerrady Kimwery", "label": "3"}, {"sentence1": "Just about perfect Had to get gmail to approve less secure apps to get it to allow access. Love the ability to customize everything. Wish it had labels.", "label": "4"}, {"sentence1": "was fine now keeps crashing", "label": "2"}, {"sentence1": "..... It confusing lol", "label": "2"}, {"sentence1": "Good app but why i cannot input cheat codes in it please help me", "label": "3"}, {"sentence1": "Nice app I loved", "label": "5"}, {"sentence1": "Coooll", "label": "5"}, {"sentence1": "Ugghhhh It keeps deleting my songs  but they do have great options for songs", "label": "4"}, {"sentence1": "makan memory", "label": "1"}, {"sentence1": "Some games just crash Like danball senki w keeps crashing when i open savedata", "label": "2"}, {"sentence1": "It's great! It's very well detailed with the items  quests and everything! Only thing that's missing are the new dlc event quests.", "label": "4"}, {"sentence1": "Moving story", "label": "4"}, {"sentence1": "Hard to read Very little contrast. Bad for old eyes.", "label": "3"}, {"sentence1": "GR", "label": "4"}, {"sentence1": "SMS ??? Quit backing up two thirds of the way through the process.", "label": "3"}, {"sentence1": "This is sooooooooo baaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaad Don't update it", "label": "1"}, {"sentence1": "Good compass it is", "label": "4"}, {"sentence1": "Could be better! Where's the hunter arts section?", "label": "3"}, {"sentence1": "Kadak mast", "label": "4"}, {"sentence1": "Tanks عالی و سریع . بدون افت سرعت", "label": "5"}, {"sentence1": "not so much it doesn't no my music", "label": "1"}, {"sentence1": "It's broken The app doesn't work properly anymore: once started  to stop becomes a problem; I have to force stop it. Also I don't really think it does what it is supposed to do anymore  for instance  I use it to access US only services such as Pandora  Spotify  etc but since the update it doesn't work anymore and I am informed that the service isn't available in my country which shouldn't be... Also the new UI just isn't right...", "label": "1"}, {"sentence1": "Yes Works on Google Play. Que bien que el equipo responde todas las preguntas.", "label": "3"}, {"sentence1": "Why is it trying to have acsess to my photos and files", "label": "1"}, {"sentence1": "Cumbersome to use Didn't move files.", "label": "2"}, {"sentence1": "I love this up and with every update there is an improvement. I look forward to every update. Keep up the wonderful work guys😘", "label": "5"}, {"sentence1": "Mahendra Mahendra", "label": "1"}, {"sentence1": "Chatu app Boooooooooooooooooooooooooooooooooooooooooooooooing", "label": "5"}, {"sentence1": "Good app This is very good app..bt the only isuue i'm having is cpu settings wt i'm choosing is nt applied on boot.i'm using asus zenfone 2 ze550ml stock android 5.0.plz help", "label": "4"}, {"sentence1": "Super Very accurate", "label": "5"}, {"sentence1": "Zenfone 5 not working. As per title. I have the bins in the right place  but when I tap on a game it just force closes saying reicast has stopped. 3 stars for the effort  as I got reicast working on the pi 2  but 5 stars when it's working on my phone.", "label": "3"}, {"sentence1": "Thanks Thanks again", "label": "3"}, {"sentence1": "odk Thz ir just amazing", "label": "4"}, {"sentence1": "New update has a bug.... Cant update profile picture", "label": "1"}, {"sentence1": "A must for copy pasting a lot", "label": "4"}, {"sentence1": "Doesn't work  so dont waste your time. Doesn't load bios  or games  just crashes without error with everything in the right place and format. Lucky this garbage was free.", "label": "1"}, {"sentence1": "Great I have been using this for years  on three phones. Always easy to use and good to have.", "label": "5"}, {"sentence1": "Advertise kami karavi", "label": "1"}, {"sentence1": "Superman Astig", "label": "2"}, {"sentence1": "can't select files to decrypt. S6", "label": "4"}, {"sentence1": "Improve required", "label": "2"}, {"sentence1": "I love it Its good", "label": "3"}, {"sentence1": "🤔it's good but not perfect", "label": "5"}, {"sentence1": "Needs an online backup or account log in system.", "label": "3"}, {"sentence1": "I can't get the update to install", "label": "1"}, {"sentence1": "Not installing I have installed termux API and I am trying to install termux now  when I opened the app it is showing \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"installing\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" but not getting installed.\"\"", "label": "2"}, {"sentence1": "It good.", "label": "5"}, {"sentence1": "Anyone know how to use it Plz... tell me how to use it", "label": "2"}, {"sentence1": "it's great but... probably the best nds emulator I've used on mobile however as of recently i find that it is impossible to open then settings menu. Please fix this.", "label": "4"}, {"sentence1": "Slow going Has potential but it's really slow going and movement is clunky. Uninstalled", "label": "2"}, {"sentence1": "Important", "label": "1"}, {"sentence1": "It's not download", "label": "1"}, {"sentence1": "Bado Omo", "label": "3"}, {"sentence1": "IS NOT UP TO DATE WITH TRENDING SONGS CANT FIND WHAT I WANT DON'T DOWNLOAD WASTE OF TIME", "label": "1"}, {"sentence1": "Good App Please Change The App Icon!!!! Plsss", "label": "4"}, {"sentence1": "Good times Great free app", "label": "5"}, {"sentence1": "Thanks play store", "label": "5"}, {"sentence1": "Network Connection Problems I really loved it but since last update i am having Problems with Network Connections..... It always shows Connecting to Network even using WiFi and Full Network. i never had such problems in Whatsapp if you fix i will definitely change it to full Stars", "label": "2"}, {"sentence1": "Needs update I can't figure out how to start the bios.please make it easier thanks!", "label": "1"}, {"sentence1": "Great  very fully featured  offline map app. The only downside is the non-intuitive UI.", "label": "4"}, {"sentence1": "Nice app .. Nice app but little amount of quantity .. Good app", "label": "5"}, {"sentence1": "Google Hi very nice", "label": "2"}, {"sentence1": "Cant load I found the show i want to watch but when i press the show. It says 'Atarashi cant load the details'. I also tried it on Atarashi Beta but still the same. How do u play the show?", "label": "3"}, {"sentence1": "Keeps turning on The app keeps turning on even when I shut it off. When I do try to use it  the big onion button flashes constantly and switches between \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"connected to network\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" and \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"connecting to network.\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\" I have no idea if it's secure or not.\"\"", "label": "2"}, {"sentence1": "Just the thing i had in my mind.Awesome It has everything i needed to remind me of the things related to skill development which i keep forgetting .Definitely a 5 star.", "label": "5"}, {"sentence1": "Not so sure with Lollipop Worked well with KitKat  iffy with Lollipop !!!!", "label": "3"}, {"sentence1": "Great app if you don't mind manually backing up your data to somewhere manually. Personally  I use dropbox  but have to move the file into it. I had to do this at least 2 times since I download this app... moving from one device to a new one  and a factory reset after a major upgrade.", "label": "4"}, {"sentence1": "Weak Audio files are provided for only a minor number of the stories. If you start a story  and then go and do something else  the app will not remember where you were you have to start over again.", "label": "3"}, {"sentence1": "Hey  this is good but bad thing for me i cant download any pictures from message and from walls  if u update this i give 5 star", "label": "3"}, {"sentence1": "Good Work it feel good it easy creat ringtone goodjob", "label": "4"}, {"sentence1": "Files are not downloading  i like the PC platform best", "label": "1"}]