[{"sentence1": "#coronavirus I have to say that I'm scared about the people who aren't scared. I was in a Zoom this morning and a woman said she goes to the grocery store every day because it's the only place to go! But the point is to stay home and stay away from people, not hang out w/ folks.", "label": "negative"}, {"sentence1": "Thank your retail workers by asking their stores to make sure they receive annual bonuses, something that many a store got rid of with their payrose last year. #Covid_19 #CoronaCrisisuk #CoronaCrisis #retail", "label": "extremely positive"}, {"sentence1": "I want to share that I did a panic COVID-19 buy a month ago for my brother. I bought him 5 gallons of heart healthy food, got him 2 months worth of medication, TP, sanitising cleansing products, etc. All for if one day, I couldnÂ\u0092t return home for him because of work. Hurts.", "label": "negative"}, {"sentence1": "We have probably been to the local #supermarket lately and wondered \"What happened to all the #toilet #paper.. Is this a sign of The End?!\". The #Coronavirus has taken over our lives and has caused many to loseÂ\u0085 https://t.co/k1KZ27Wls7", "label": "negative"}, {"sentence1": "The #Answer Isnt Either/Or But #BOTH: #COVID2019 is r #opportunity 2 #RaiseTheBar &amp; build #US #healthcare capacity, #workersrights, #consumer #protection &amp; #sustainable #cleanenergy #jobs, b/c #publichealth &amp; #prosperity go #HandInHand: https://t.co/tHo1TLQjfv #moral #imagination", "label": "neutral"}, {"sentence1": "#RhodeIsland @GovRaimondo announces https://t.co/QRFkYXMDM4 grocery delivery service for #Coronavirus quarantiners; partnering with #RI based supermarket.", "label": "neutral"}, {"sentence1": "Looking at the remnants of about 60 acres of cucumber for which the market disappeared 2 weeks ago due to Covid 19 and the collapse of the food service demand https://t.co/x69jQBisOx", "label": "extremely negative"}, {"sentence1": "Love it when artists see the funny side. Don't know who created this but it's brilliant. If you had seen the idiots in Tesco the other day you would understand! #CoronavirusOutbreak #coronavirusuk #coronavirus #Munch #toiletpaper #toiletroll https://t.co/0lWEURaalX", "label": "extremely positive"}, {"sentence1": "Great by President Nicholas Bertram in the encouraging customers to stop with associates working hard to restock shelves Panic buying also affects food banks", "label": "positive"}, {"sentence1": "Right tweeps: what is the best (quietest) time to go to the supermarket? Is later in the day better? What shop(s) are doing a good job trying to keep shoppers safe? #coronavirus #COVID2019", "label": "extremely positive"}, {"sentence1": "Me after #Quarantine ??#toiletpaper #ToiletPaperPanic #ToiletPaperApocalypse #socialdistancing #coronavirus #COVID19  #stay #home ? https://t.co/8hEdViDso2", "label": "neutral"}, {"sentence1": "Is it totally necessary for whole familyÂ\u0092s to go to the supermarket? ???????????????#socialdistancing #coronavirus IÂ\u0092m glad to get some Â\u0091meÂ\u0092 time for an hour ?", "label": "positive"}, {"sentence1": "A fish tank product has the same chemical US is studying for COVID-19 - Mail Online https://t.co/kwlN8f2iAG", "label": "neutral"}, {"sentence1": "The Canada Food Price Report released in 2019 predicted a 2 4 price increase of produce in 2020 A update of the report says prices will raise more than expected With more people now at risk of food insecurity we urgently need local solutions", "label": "negative"}, {"sentence1": "What I donÂ\u0092t get is that everyone is being told to #StayAtHome and yet SO many retail stores remain open for people to Â\u0093mass gatherÂ\u0094 and go shopping! People are actually queuing in close proximity to go and buy food!!Stay 2m apart and donÂ\u0092t panic! Get a F**king grip #coronavirus", "label": "negative"}, {"sentence1": "Nielsen updates crazy sales numbers", "label": "negative"}, {"sentence1": "Just remember, wherever you're from in the world, it could be much worse.\r\r\n\r\r\nYou could be an American Bible loon.\r\r\n\r\r\n https://t.co/lGAiPDg44f", "label": "negative"}, {"sentence1": "@AndyYork8 @iRorschachBot @TheTattooedProf I'm limiting my grocery shopping to once per week. I'd like to go longer in between shops, but I need to restock my fresh fruit weekly. A friend of mine who works in a supermarket told me she's crying at work eve", "label": "positive"}, {"sentence1": "SHOP NOW ONLINE: https://t.co/rr2O5ukaRP\r\r\n\r\r\nStay at home during lockdown and let us do the shopping for you. COVID 19 Supplies and groceries delivered to your doorstep.\r\r\n\r\r\nOnly available in Gauteng (selected areas) https://t.co/fAFCMjcee5", "label": "neutral"}, {"sentence1": "US Food Industry Scrambles To Resupply Stores Amid Apocalyptic Surge In Demand | Zero Hedge https://t.co/Pw9QbGcE1j #coronavirus #CoronavirusOutbreak #COVID19", "label": "extremely negative"}, {"sentence1": "Stranger at the Grocery Store: This Covid-19 is really scaring the shit out of me. Waiting for my reports. \r\r\nMe: Stay positive!\r\r\nStranger throws a shampoo bottle at me.", "label": "extremely positive"}, {"sentence1": "#Restaurants in these #coronavirus times can significantly cut their electric bill by doing #refrigeration coil cleaning with our unique https://t.co/PRuQigzrsu coil cleaning technology - a no-mess do-it-yourself method. #foodservice \r\r\nAlso: #Cstores #grocery #pizzerias too! https://t.co/3bc1GChClK", "label": "extremely negative"}, {"sentence1": "With online grocery shopping available to SNAP recipients in only six states governors are pushing the Department of Agriculture to be more flexible with food stamps", "label": "positive"}, {"sentence1": "@GovMurphy Is the state making shopping accommodations for Covid-19 at risk groups?\r\r\nChallenges may be:\r\r\nCannot stock up on items on a fixed income.\r\r\nAccessibility requires shopping to be quick and efficient.\r\r\nThey may not be computer literate so cann", "label": "positive"}, {"sentence1": "There are many people who are living below the poverty line who were not able to stock up on food as they didn t have the resources to do it And now their pay cheque has stopped", "label": "extremely negative"}, {"sentence1": "When youÂ\u0092re online shopping, try to use eBay/Etsy rather than Amazon. \r\r\n\r\r\nNot only will shipping be quicker but youÂ\u0092re supporting independent sellers who are likely struggling during this crisis.\r\r\n\r\r\n#coronavirus", "label": "extremely negative"}, {"sentence1": "Just back from the supermarket. Shopping while #SocialDistancing is like playing an old video game. ThereÂ\u0092s someone up ahead - must slow down until theyÂ\u0092re gone. DonÂ\u0092t cough, or even sniff - any sound will alert the guards. Nerve wracking.\r\r\n#COVID19 #coronavirus #dontmakeasound", "label": "extremely positive"}, {"sentence1": "When kiryu saw selfish people in the grocery store\r\r\n*sorry for the fps drop\r\r\n#coronavirus \r\r\n#YakuzaKiwami2\r\r\n#ryugagotoku https://t.co/xFD6QOqUAF", "label": "extremely negative"}, {"sentence1": "Our team constantly has their ears to the ground listening for the important themes that will guide the shopper and consumer needs of youth and family even during these times of 19 Learn more about recent trends in our blog", "label": "positive"}, {"sentence1": "A LITTLE MESSAGE TO ALL THE GREEDY PEOPLE CLEARING THE SHELVES AND LEAVING NOTHING FOR OTHERS", "label": "negative"}, {"sentence1": "The first lot of sweets and craft deliveries ready. Our party in a box can be for just one child and prices start from just Â£10!  #coronavirus @lovehoole @hooleandnewton @HooleChester @merchant_elite @chestertweetsuk @wearechester @SkintChester @RealCheshireSet https://t.co/ouH9R0Xdcs", "label": "extremely positive"}, {"sentence1": "Actor Tyler Perry surprised shoppers Wednesday at two grocery store chains when he bought their groceries for them amid the COVID 19 pandemic", "label": "positive"}, {"sentence1": "Support local small businesses during the COVID-19 shelter in place by shopping GRANTERS online. Stay Safe, stay home and shop. Thank you for your continued support! granters on eBay https://t.co/BT16v1ZyP4", "label": "extremely positive"}, {"sentence1": "Seneca County Food Pantries Need Donations Now The COVID 19 pandemic has caused an increase in demand at local food pantries and many are still in need They are accepting non perishable food items and monetary donations Please contact the food pantries listed below to donate", "label": "extremely positive"}, {"sentence1": "I work in retail where people come in and out daily. What is the difference between a convenience store and nail saloon? #coronavirus", "label": "neutral"}, {"sentence1": "Mum crying in supermarket shows the ridiculousness of bulk-buying \r\r\n\r\r\nWE NEED TO REMEMBER THAT THERE ARE PEOPLE IN NEED ALL OVER. PLEASE STOP GREEDY BUYING.\r\r\n#SaturdayMotivation\r\r\n#bulkbuying\r\r\n#toiletpaper #coronavirus\r\r\n@detachedaz\r\r\n@CRTM63\r\r\n@debameyers\r\r\n\r\r\nhttps://t.co/USRGkyGcYU", "label": "extremely negative"}, {"sentence1": "@realDonaldTrump Come on Trump, tell us whether or not Covid-19 existed prior to this year. We know it's been around for several years. The truth WILL come out eventually. Every government official whom profited from low stock prices due to disinformation", "label": "positive"}, {"sentence1": "Amazon seeks to hire 100,000 to work in warehouses to keep up with a crush of orders as the #coronavirus spreads and keeps more people at home, shopping online.\r\r\n\r\r\n#jobs #retail\r\r\n\r\r\nhttps://t.co/4Dqjuz4UWL", "label": "neutral"}, {"sentence1": "4 US #Senators are under scrutiny over claims they used insider knowledge about the impending #coronavirus crisis to sell #shares before prices plummeted. https://t.co/MQrCNFqFjg", "label": "extremely negative"}, {"sentence1": "Stock markets fall back despite ECB and Federal Reserve's coronavirus... #coronavirus #COVID19 #COVID?19 #???????????? #??????? #Covid_19 #corona #CoronavirusOutbreak #prepper #survival #bushcraft #RT #follow https://t.co/Zxb48Mp3AN", "label": "neutral"}]