[{"sentence1": "Hundreds of people from the small Northland community of Kaikohe have lined up to be assessed for Covid-19, after a supermarket worker tested positive.\r\r\n\r\r\nhttps://t.co/oTyLn5FW0B", "label": "positive"}, {"sentence1": "Property Prices During COVID - 19 #coronavirus #sydneyproperty https://t.co/KOLO1DjKjW via @YouTube", "label": "neutral"}, {"sentence1": "5 digital trends in #COVID-19 world:\r\r\n?Availability is compromised\r\r\n?Making smart communication choices\r\r\n?Store survival in play\r\r\n?Changing customer needs can be addressed\r\r\n?Show the shopper some love\r\r\n\r\r\n#BOPIS #OnlineShopping #eCommerce #Retail #Coronavirus https://t.co/3Da5XpvX3E", "label": "extremely positive"}, {"sentence1": "COVID-19 Perks:\r\r\n\r\r\nNo mass shootings or school shootings in a month\r\r\n\r\r\nGas prices have dropped majorly \r\r\n\r\r\nHavenÂ\u0092t seen a video of police harassing pedestrians and or shooting pedestrians from Â\u0093fearfulness for their livesÂ\u0094\r\r\n\r\r\nFamily bonding time for those who work stressful jobs.", "label": "extremely negative"}, {"sentence1": "In a world turned upside down by the war and there s a downside risk to imports since the large drop in prices might make fuel oil cheaper than spot LNG cargoes", "label": "extremely negative"}, {"sentence1": "Seriously Weight Loss Tips Can t Be Real We re in survival mode here The last thing we need is to add in ill informed consumer tips for fad diets during a stay at home order", "label": "negative"}, {"sentence1": "Brilliant idea Price single items low but multiple items very high to deter panic buying", "label": "negative"}, {"sentence1": "You DON'TS LET it TAKE ADVANTAGE of YOU .\r\r\nSo what would you call #CORONAVIRUS ? ?\r\r\nSo what you call it controls your response to the virus!\r\r\nSome of us believe the virus is just for a season will see an opportunity, supply hand sanitizer, masks, gloves. \r\r\n#MaryThuoReality", "label": "extremely positive"}, {"sentence1": "We welcome the responses of Amazon Facebook Google and many others to our call for eradicating online scams amp exploitation of people s fears of We call on all platforms to keep the strong measures in place until the crisis is over More  ", "label": "negative"}, {"sentence1": "How life changes when it is easier to find an Uber in the countryside, than a supermarket delivery slot  \r\r\n\r\r\noh wait? #COVID2019", "label": "positive"}, {"sentence1": "They say that gloves and a face mask are adequate enough for a trip to the supermarket. Apparently not, everyone else at Tesco seemed to be wearing clothes. #QuarantineLife #StayHomeSaveLives #Covid_19", "label": "positive"}, {"sentence1": "Craving a chicken sandwich? The drive thru at many fast food restaurants is still an option. But is the demand enough to keep the doors open? Washington Bureau Chief @J_Policastro finds what franchises say they need as we battle the #coronavirus outbreak: https://t.co/et5p4wHVxA https://t.co/Nu6NCH4r84", "label": "extremely negative"}, {"sentence1": "#coronavirusaus #COVID19au #COVID2019  I wonder how long before there'll be a run on the banks for their cash  from those locusts who are stripping supermarket shelves bare?", "label": "neutral"}, {"sentence1": "WATCH As crisis drives demand London Food Bank launches first virtual food drive", "label": "extremely negative"}, {"sentence1": "The City of #WestMemphis is doing everything we can to keep your family and your friends safe. Today Mayor McClendon and the COVID-19 Task Force are working with local grocery store operators to limit the spread byÂ\u0085 https://t.co/2cylbmqnsa", "label": "extremely positive"}, {"sentence1": "Alot of tweet abt sanitiser bn made by #DRDO n #PatanjaliYogpeeth. Also #santoor n othr companies reducng prices. Alot ppl tweeting abt #PPE kits bn distributed. But my question is whn will it reach middle class Indian #SundayMorning #Covid_19 #India", "label": "neutral"}, {"sentence1": "Long lines and so many rules at the local supermarket this morning. Hard moments help us to value things that we used to have for granted, like going to buy Nutella and other non-essential stuff on Sunday morning... #Coronavirus #COVID19 #StayHome #CaVaBienAller", "label": "extremely positive"}, {"sentence1": "#COVID19 #Coronavirus may cause global food shortages as panic buying and export curbs hit supply.  https://t.co/BCSfGEcvYC", "label": "negative"}, {"sentence1": "@Safeway I was just at your store in Van Dorn plaza. Why arenÂ\u0092t The workers wearing masks?? And only half of them were wearing gloves! I watched a lady stock a cooler and her face was about 6 inches from the food she was stockingÂ\u0085#WTF #coronavirus", "label": "neutral"}, {"sentence1": "@MaisarahMahmud Hai sy jual hand sanitizer 60ml ni  #handsanitizers #COVID2019 #malaysia #coronavirus https://t.co/O1mLGKGE4R", "label": "positive"}]