[{"sentence1": "9 Online Grocery Shopping Stores In Klang Valley That Deliver To Your Doorstep During The COVID 19 Outbreak", "label": "neutral"}, {"sentence1": "I love it when you quarantine proppa To the honey s getting wiser using hand sanitizer", "label": "extremely positive"}, {"sentence1": "It is a sin to hoard toilet papers and/or groceries when your next door neighbor has none. Birgit 3:22, the new mind translation #SundayThoughts #pandemic #coronavirus #toiletpaper #ToiletPaperApocalypse", "label": "negative"}, {"sentence1": "Did you know that ordering takeout increased by 285% since the beginning of March? As a business owner take advantage of this opportunity! ? #winmoreknows \r\r\n #StayHome  #USA #business #restaurants #Marketing #coronavirus  #economy  #growyourbusiness #money \r\r\nhttps://t.co/HyoYn38xk6 https://t.co/dcSRCaivrq", "label": "extremely positive"}, {"sentence1": "I canÂ\u0092t believe it whatever you want to buy from food to whatever other crazy idea you have is out of stock\r\r\nAre you guys going crazy?\r\r\n#CoronaCrisis", "label": "negative"}, {"sentence1": "Giving thanks to all the healthcare providers artist &amp;  supermarket workers &amp; other businesses staying open that are working hard  risking their lives to help out others in this drastic time ? #2Chainz #atlhawks #quavo #statefarm #thankyou  #healthcareheroes #coronavirus https://t.co/AzUgGwDNmY", "label": "extremely positive"}, {"sentence1": "Will they supply them with masks and look at the risk of employees catching the virus. That's a No. Look round every supermarket no one as a mask and they am at a high risk. Its all about money and greed .#coronavirus", "label": "extremely negative"}, {"sentence1": "CORONAVIRUS CRIMES From SUPERMARKET STABBINGS to POISONOUS CURES and DOOR TO DOOR VIRUS  TESTS  BEWARE Watch today s on 19", "label": "extremely negative"}, {"sentence1": "Less than 3 months ago people were tweeting \"Christmas ruined\" &amp; abusing supermarket staff cos they hadn't received a certain item in their shopping delivery. \r\r\nHope those same people feel bloody stupid now ?\r\r\n#Covid_19", "label": "extremely negative"}, {"sentence1": "As the #COVID19 pandemic is dramatically changing consumer behaviors worldwide, we look to the #ecommerce business to understand how should retail companies navigate through the crisis.\r\r\n\r\r\nRead here ? https://t.co/t8gG8HHu7e\r\r\n\r\r\n#retail #coronavirus #analytics https://t.co/ONuz05dMzv", "label": "extremely negative"}, {"sentence1": "all grocery store workers should get free testing kits. #coronavirus", "label": "positive"}, {"sentence1": "HAS ANYONE CHECKED ON GROCERY STORE JOE AMIDST THIS WHOLE #coronavirus STUFF??? @BachelorABC???", "label": "neutral"}, {"sentence1": "Help stop the spread while shopping in our stores https://t.co/iFXWhKBZxM", "label": "positive"}, {"sentence1": "I never knew the struggle of Â\u0093online grocery shoppingÂ\u0094 in Ghana till COVID-19. I asked for boneless chicken and got boneless red meat (?). Now about to find out if itÂ\u0092s kangaroo or cat. https://t.co/wlJUMTGdHn", "label": "positive"}, {"sentence1": "#TechTipTuesday COVID-19 has the worldÂ\u0092s attention and this hasnÂ\u0092t stopped scammers, hackers, and others from taken advantage of one of our basic human conditions, fear. Check out these tips from the FTC to help avoid Coronavirus scams. https://t.co/aLNAaSKJik https://t.co/RtFKkakbgO", "label": "extremely negative"}, {"sentence1": "burton and discuss where the outbreak presents not only a health crisis but an economic one due to falling global oil prices and demand", "label": "negative"}, {"sentence1": "Meantime, at @HuddersfieldUni...\r\r\n#tpchallenge #coronavirus #COVID2019 #QuarantineLife #StayAtHomeChallenge #COVID #footy #toiletpaper #ShelterInPlace #boredom #UKlockdown https://t.co/1EnKfvnmmx", "label": "neutral"}, {"sentence1": "lol Nancy #Pelosi thinking this is like Supermarket Sweep during the #coronavirus.\r\r\n\r\r\n#DemocratsAreDestroyingAmerica\r\r\n#DemocratsHateAmerica \r\r\n#MAGA2020 https://t.co/7WErd54Vgg", "label": "extremely positive"}, {"sentence1": "@thehobokengirl @KenFerrante @CityofHoboken @RaviBhalla @Tiffanie_Fisher @StevenFulop @hMAG @JerseyCity @HobokenPD @News12NJ @MarciRubinN12 Hi there, we strongly condemn price gouging and posted prices are our normal prices. In response to the COVID-19 pa", "label": "negative"}, {"sentence1": "@RTaylorUK @NorthantsChief This chief has just made a complete fool of himself. ItÂ\u0092s not illegal to go to a supermarket and buy whatever you like. Comments like this risks public consent and the willingness to support the lockdown.\r\r\n#StayHomeSaveLives b", "label": "extremely positive"}, {"sentence1": "Let me tell you what small towns are doing. Local grocery store spends late nights stocking. 1st hr open for elderly only. People donating $ for groceries. Manager and others deliver to those who cant get out. #thatismytown\r\r\n#coronavirus #FridayThoughts", "label": "neutral"}, {"sentence1": "Interesting - Consumer optimism in Italy, Spain, UK vs USA https://t.co/nr0nlNnNHI by @McKinsey | #coronavirus #covid #covid19 #economy", "label": "extremely positive"}, {"sentence1": "@nathpuneet @InvestorsLive Pull back into $600-700 then zooming past $1,000..... These aids coming are Band-aids on a broken leg. Consumer debt is at 2008 levels and student loans weren't an issue in 08.... Third strike is COVID-19", "label": "extremely negative"}, {"sentence1": "As cities shutter businesses to stop spreading there is no plan in place to provide income for those out of work If we don t provide relief for the most vulnerable group 1 2 of our nation we will allow the virus to spread amp tank our consumer driven economy", "label": "negative"}, {"sentence1": "This is how we have to dress to be allowed into the supermarket #covid #protectyourself #socialdistancing #goesinthehistorybooks #creatingmemories @ Beverly Hills, California https://t.co/sivgZiAtjL", "label": "neutral"}, {"sentence1": "Here is a nice article by Dennis Thompson about the challenges people are going to face paying for medical care especially if they ve lost or been laid off from their jobs I chime in at the end URGING people to get the care you need", "label": "extremely positive"}, {"sentence1": "@NYGovCuomo Middle of June would be best allow for supplies for people to buy masks and hand sanitizer before reopening economy. #coronavirus #COVID19 #QuaratineLife #StayAtHome #mondaythoughts #Milwaukee #Denver #miami #NewOrleans #OklahomaCity #Nashvill", "label": "extremely positive"}, {"sentence1": "A supermarket in Denmark comes with a novel idea to stop people from hoarding hand sanitizers", "label": "positive"}, {"sentence1": "Spoke to U of G food expert and economist about CanadaÂ\u0092s food supply during this time when weÂ\u0092re seeing empty shelves and panic purchasing. They say Canada has a robust food supply chain and these shortages are only temporary.  #COVID19 https://t.co/sJc0EKseRN", "label": "negative"}, {"sentence1": "The U.S. energy sector is doing what it can to keep the bottom line in shape, but it's not going to be easy if prices don't cooperate. #coronavirus #NGINews\r\r\n\r\r\nSurvival of U.S. Oil, Gas Sectors Said at Risk from Coronavirus, Withering WTI Prices https://t.co/jbCMHEufN4", "label": "positive"}, {"sentence1": "The combined blows of low oil prices and the coronavirus pandemic to cause declines in M&amp;A as well as new projects.\r\r\nhttps://t.co/h24RjujuQ3\r\r\n#financialmarkets #oilprices #petrochemicals #chemicalindustry #coronavirus #covid19 #mergers #acquisitions #polyethylene #ethylene", "label": "neutral"}, {"sentence1": "DonÂ\u0092t let Gracie or any other pets go without food. Stop Panic Buying Pet Food!!!!! #heraldsun #dog #pets #coronavirus #panicbuying #petsofinsta #dogsofinstagram #nikonphotography #petphotography #canine @lostdogshome https://t.co/GWWqeHYs9x", "label": "positive"}, {"sentence1": "Covid-19 - consumer &amp; retail outcomes by Sri Rajagopalan &amp; Yves Le Breton https://t.co/zZccEyaAkb", "label": "neutral"}, {"sentence1": "After washing your hands remember to hold them together in prayer While stocking your stores with enough food remember to stock your heart with enough Holy Spirit And as you isolate yourself from contaminated people isolate your soul from sin", "label": "extremely negative"}, {"sentence1": "To be honest I m more afraid of the panic buyers amp hoarders the families meeting for play dates the people who still go to pubs amp restaurants amp those who steal sanitizer from hospitals amp food from donation boxes than of Selfishness amp indifference frighten me", "label": "extremely negative"}, {"sentence1": "Governor Baker has made testing and the pursuit of personal protective equipment for front-line medical workers priorities Â\u0097 and yesterday (4/10/2020) he expanded access to free testing to include grocery store and supermarket workers.\r\r\n\r\r\nhttps://t.co/sn075oKTqY", "label": "positive"}, {"sentence1": "Soooo, itÂ\u0092s like an hour wait to get into the grocery store. I donÂ\u0092t know if I have the energy for this new life. #coronavirus #Houston https://t.co/siGnyZUHrV", "label": "positive"}, {"sentence1": "The most valuable commodity 2020.  Happy Mothers Day Mum ? \r\r\n#coronavirus #toiletpaper #ToiletRoll #StayAtHome #new2020 #mothersday2020 https://t.co/X9Zp7xc9cY", "label": "extremely positive"}, {"sentence1": "New from IFS The impact of COVID 19 on share prices in the UK Tourism and leisure fossil fuels and automotive industries have seen large share price falls since the outbreak More here", "label": "positive"}, {"sentence1": "What makes me sick is how hospitals are running out of PPE and healthcare workers who are in close contact with Covid 19 positive patients are being forced to reuse theirs yet Karen is improperly wearing her N95 mask to the supermarket to buy her 25th roll of toilet paper", "label": "negative"}, {"sentence1": "I've updated our prices page on our website to reflect the COVID-19 restrictions to our services: https://t.co/7JyfwnlXNl", "label": "neutral"}, {"sentence1": "Lamb prices tumbled Â£30 a head after retailer and export demand evaporated with tightening #coronavirus social distancing rules. https://t.co/EnwZC6HETR #sheep365 #farminguk", "label": "negative"}, {"sentence1": "I came in contact with more people in the 15 min I was in the supermarket than if I would've been in a gym for 2 hours.\r\r\n#CoronaCrisisuk #coronavirus", "label": "neutral"}, {"sentence1": "@daveellis55 Think it would assist in slowing spread of #coronavirus if less people have to go in the supermarket", "label": "neutral"}, {"sentence1": "@the_teasmith @Veg_Co @TheGBFoodHub working on basis alcohol sanitizer is required 2kill #coronavirus IÂ\u0092ve self prescribed your Gin&amp;Tonic every 4hours to kill #corona in my throat, if I display symptoms I shall move 2the Bond,Dry Martini as in Casino", "label": "extremely negative"}, {"sentence1": "Where #sanitizer still available online in #USA \r\r\n#Corona #Covid19 #pandemic #coronavirus \r\r\n\r\r\nhttps://t.co/luuRSJ6JzS\r\r\n\r\r\nhttps://t.co/qoMA7V1JKc\r\r\n\r\r\nhttps://t.co/ExaPmRiiFS\r\r\n\r\r\nComment more links.", "label": "neutral"}, {"sentence1": "One day weÂ\u0092ll go back in the car, weÂ\u0092ll go to play groups and weÂ\u0092ll go to the supermarket but for now IÂ\u0092m keeping you safe !! Your my special bunny and mummy just loves u so so much ! Happy Easter my special baby girl muma loves u more than u know ! #oneday #coronavirus #iloveu https://t.co/6HdIpahhrT", "label": "extremely positive"}, {"sentence1": "REDUCED PRICES DUE TO Hire me F#or your assignments research papers Essays labreports Annotated bibliographies spring classes My response team is 24 7 I take cashapp venmo Zelle and Paypal", "label": "neutral"}, {"sentence1": "Actually enjoying this social distancing. The city is quiet and peaceful and lot of me time...\r\r\n \r\r\n#covid_19 #coronavirus #socialdistancing #stockup #life #virus #photography #morning #mumbai @ Mumbai, Maharashtra https://t.co/tAfYGBzLtJ", "label": "extremely positive"}, {"sentence1": "I've come home from the supermarket feeling deflated by everything #coronavirus #examscancelled #uncertainty but hey ho I'm having a #gin There's always someone worse off than myself.\r\r\n\r\r\nAnd, as a lovely man I used to work with used to say #staystrong #onwardsandupwards ? https://t.co/ZxfNOOvrWB", "label": "positive"}, {"sentence1": "Dear Customers,\r\r\nIt has always been our mission to drive the happiness and satisfaction of our customers online shopping. This firmly stands, both through times of uncertainty and times of clarity- weÂ\u0092re with you through it all. COVID-19 will not bring us down! https://t.co/ac6J0Ldf37", "label": "extremely positive"}, {"sentence1": "I bought hand creme at the supermarket and felt like I had won the jackpot Priorities change 19", "label": "extremely positive"}, {"sentence1": "@CarnegieEndow This post examines the impact of corruption, corona virus' spread &amp; the collapse of oil prices on Iraq. The crisis offers Iraq's October Revolution-driven by youth-opportunity 2 organize 4 post-Covid-19 elections 2 enact democratic refo", "label": "extremely negative"}, {"sentence1": "Dont Wear Gloves to the Supermarket? COVID 19 (With BM Subtitles) https://t.co/4aB9NCy1cH via @YouTube", "label": "neutral"}, {"sentence1": "Goodbye healthy take away. Will create huge pressure on food supply chains. Guess panic to follow. Lot of people eat out or on the move in London. Now can't get coffee!#Covid_19\r\r\nhttps://t.co/pjuCKvMosm", "label": "positive"}, {"sentence1": "@Tesco #Tesco #coronavirus #COVID?19 #elderly My Mum is in her 70Â\u0092s, she now has to stay home but how does she shop now? Her online shopping basket is showing every food item is out of stock. She canÂ\u0092t attend your designated shopping hours for the elder", "label": "neutral"}, {"sentence1": "There's women getting stuck in homes with abusers, NHS staff being evicted because their landlords are scared of them getting COVID-19, while also not getting the right equipment to protect themselves and not being able to get food due to panic buying.", "label": "extremely negative"}, {"sentence1": "Natural disaster = buy milk and bread.\r\r\nPandemic = buy all the toilet paper I can get my hands on.  #coronavirus #pandemic #naturaldisaster #toiletpaper", "label": "negative"}, {"sentence1": "Of all the shortages created by the coronavirus pandemic -- the toilet paper and the hand sanitizer and the bottled water -- the oddest of them all has to be dogs. Oh, and cats too. \r\r\n\r\r\nhttps://t.co/z5NCk9mqaV\r\r\n\r\r\n#CoronaVirus #COVID19 #pandemic https://t.co/L8pY6l2cOz", "label": "positive"}, {"sentence1": "Gleaners Food Bank of Indiana is setting a lofty fundraising goal as it struggles to meet increasing demand due to COVID 19 has more", "label": "negative"}, {"sentence1": "There was a woman following me around the produce dept in the supermarket in February I was like WTF Once I got away from her I watched her lurking around getting close to people I told my husband I was worried she was trying to spread the he thought I was crazy", "label": "extremely negative"}, {"sentence1": "Mouldy food can kill pets- keep it out of reach!\r\r\n\r\r\nWith households initially panic buying and stockpiling food at the start of the #coronavirus outbreak we may now see an increase in Tremorogenic Mycotoxin cases. Download our guide from:\r\r\nhttps://t.co/GzmAADLSkr https://t.co/1fuh7edUXP", "label": "extremely negative"}, {"sentence1": "@Consumer_Cell has the worst customer service.  Sold my 77 yo mother a #consumercellular phone that doesn't work then cancelled my account without my authorization.  You should be ashamed of this kind of service during #coronavirus epidemic.", "label": "extremely negative"}, {"sentence1": "Outside for the first time in 2 weeks-\r\r\n- should have packed my headphones for the supermarket queue \r\r\n- how cheap is diesel right now!?\r\r\n- how many birds I can hear without the thrum of cars?\r\r\n#COVID2019", "label": "neutral"}, {"sentence1": "#toiletpaper holdings and cemetery plots increased in value the last two weeks offsetting #StockMarket holdings so IÂ\u0092m even. #coronavirus", "label": "positive"}, {"sentence1": "Democrats in Wisconsin wanted to delay because they wanted time to rig it Nothing to do with If you re going to the grocery store It s safe enough to go vote", "label": "neutral"}, {"sentence1": "Stores looked pretty good today. Plenty of food. Limited paper stock. DidnÂ\u0092t check for hand sanitizer, made mine a while back. The only annoying part? The few people getting closer to randomly talk to me. Ew no, stay away ? #firstdayofspring #coronavirus", "label": "positive"}, {"sentence1": "If they are recommending we donÂ\u0092t even go to the grocery store or pharmacy, why the hell are we still working? #Covid_19", "label": "extremely negative"}, {"sentence1": "How is COVID-19 changing consumer behaviours? ... Interesting analysis of Seattle (where the virus first hit) compared to USA in general: https://t.co/iXWXvjdpWr https://t.co/OxMUApHOBE", "label": "positive"}, {"sentence1": "@ssupnow ACROSS ?\r\r\n\r\r\n1?? SANITIZER\r\r\n\r\r\nDOWN?\r\r\n\r\r\n2?? ITALY\r\r\n\r\r\n3?? WUHAN\r\r\n\r\r\n4?? GROCERY\r\r\n\r\r\n#ContestAlert \r\r\n#coronavirus #covid19 #contest #alert #GiveawayAlert #competition #puzzle\r\r\n\r\r\nJOIN FRIENDS ?\r\r\n@viennaytiwaarri\r\r\n@SaritaT48282856\r\r\n@Pra", "label": "extremely positive"}, {"sentence1": "Selfservatism has gripped parts of the country far worse than Covid 19 with selfish people hoovering stuff up from the supermarket shelves faster than the delivery trucks can bring fresh stocks how are essential key workers going to find food to keep themselves going", "label": "negative"}, {"sentence1": "In this online-exclusive edition of \"In the Trenches,\" Allen McBroom shares how his music store is adapting to the COVID-19 crisis and the new normal of retail shutdowns and social distancing https://t.co/U5t0F8TPrX https://t.co/ZJqgkFFmqx", "label": "negative"}, {"sentence1": "Never thought IÂ\u0092d #SeeTheDay when #weed was easier to get than #ToiletPaper and #HandSanitizer. \r\r\n\r\r\n#CoronavirusUSA #COVID?19 #Coronavirus #CoronavirusOutbreak #PanicShopping #PanicBuying", "label": "positive"}, {"sentence1": "Went to my local #sainsburys this morning &amp; managed to shop everything that was on my list. In fact even went an hour later given the new rules. Yes it was busy but nothing was in short supply. Shows that restricting essential items is working #StopHoarding #coronavirus", "label": "negative"}, {"sentence1": "i have an obsession with online shopping now thanks covid 19 stupid bitch", "label": "extremely negative"}, {"sentence1": "@BillGates have you considered flying a blimp across the planet with \"I told you so\" written on the side?\r\r\n#TedTalk #Covid19 #CoronaVirus #StopHoarding\r\r\nThe next outbreak? WeÂ\u0092re not ready | Bill Gates https://t.co/W5U4nwRlcz via @YouTube", "label": "negative"}, {"sentence1": "I'm observing the ppl while being on my way to the grocery store. 2 ppl now who are constantly coughing. Why don't you stay the fuck at home.? #Covid_19", "label": "negative"}, {"sentence1": "... education, we must fix healthcare, we must fix transportation, in essence we must fix Nigeria. \r\r\nOur country continues to retrogress, the COVID - 19 pandemic has harshly reminded us about the comatose state of our healthcare system, dwindling oil prices would expose the...", "label": "negative"}, {"sentence1": "Some encouraging data from Governor CuomoÂ\u0092s daily briefing:\r\r\n- daily cases +8,327 (4/4) down from 10,841 (4/3) and 10,482 (4/2)\r\r\n- BIGGER is new hospitalizations +574 (4/4) vs 1,095 (4/3) and 1,427 (4/2)\r\r\n\r\r\nNY trend is better than @NYGovCuomo optimistic case https://t.co/JG5VsOsXBp", "label": "extremely positive"}, {"sentence1": "CanÂ\u0092t get any in the supermarket but can receive free pasta in Pokemon ? #PokemonSwordShield #Covid_19 #pasta https://t.co/xQBXYdWTrZ", "label": "extremely positive"}]