[{"sentence1": "Supermarket In #Denmark Uses Price Trick To Stop #Sanitiser #Hoarding https://t.co/36UQvXkASP #Brilliant #Covid_19", "label": "negative"}, {"sentence1": "COVID-19 Perks:\r\r\n\r\r\nNo mass shootings or school shootings in a month\r\r\n\r\r\nGas prices have dropped majorly \r\r\n\r\r\nHavenÂ\u0092t seen a video of police harassing pedestrians and or shooting pedestrians from Â\u0093fearfulness for their livesÂ\u0094\r\r\n\r\r\nFamily bonding time for those who work stressful jobs.", "label": "extremely negative"}, {"sentence1": "The media is lying to you they are not doctors and the experts they bring in are all paid liars", "label": "extremely negative"}, {"sentence1": "They say that gloves and a face mask are adequate enough for a trip to the supermarket. Apparently not, everyone else at Tesco seemed to be wearing clothes. #QuarantineLife #StayHomeSaveLives #Covid_19", "label": "positive"}, {"sentence1": "Buying #yarn supplies? Make your money a more considerate spend by supporting small, local producers and sellers. These micro businesses hang in the balance. Use them or lose them. #shoplocal #shopsmall #coronavirus #knitting #crochet #britishwool", "label": "positive"}, {"sentence1": "@Safeway I was just at your store in Van Dorn plaza. Why arenÂ\u0092t The workers wearing masks?? And only half of them were wearing gloves! I watched a lady stock a cooler and her face was about 6 inches from the food she was stockingÂ\u0085#WTF #coronavirus", "label": "neutral"}, {"sentence1": "The images have resulted in outrage...\r\r\n\r\r\nhttps://t.co/wxCLvZqtr1\r\r\n\r\r\n#food #CODVID19 #UK #coronavirus #PanicBuying", "label": "negative"}, {"sentence1": "Online purchases in the US for toilet paper have spiked by 186 cold amp flu products 198 and hand sanitizers gloves masks by 817 according to data", "label": "positive"}, {"sentence1": "Went to Asian store today for grocery, they were only giving 1.5kg Chicken to each customers.The store only had two 5Kg bags of Rice I got 1 ?.A lot of empty shelves at Big stores like Asda, Morrison, Tesco, Sainsbury. Hard to find Soaps, Hand wash, Hand Sanitizer. #CoronaVirus", "label": "extremely positive"}, {"sentence1": "#COVID19 #Coronavirus may cause global food shortages as panic buying and export curbs hit supply.  https://t.co/BCSfGEcvYC", "label": "negative"}, {"sentence1": "Today someone asked me if IÂ\u0092m okay and I said yes. IÂ\u0092m not okay. I have a #autoimmune disease and IÂ\u0092m scared. I have #SelfQuarantined myself for a week now. I used to love going to the grocery store but now itÂ\u0092s a hotbed for the #coronavirus so IÂ\u0092m stuck inside. #cabinfever", "label": "neutral"}, {"sentence1": "ItÂ\u0092s not getting any better for countless supermarket workers, who are standing tall at this time of crisis - they need a guarantee of #paidsickdays, plain &amp; simple: https://t.co/DTNIYp7sl1 https://t.co/wqHXmKIc3M", "label": "extremely negative"}, {"sentence1": "@AsdaServiceTeam thank you my shopping is being delivered yes with stuff missing but I've got the stuff I need most snacks for kids.. cat food and Wine!! #COVID2019 #coronavirus #supermarket #thankyou ???", "label": "positive"}, {"sentence1": "How life changes when it is easier to find an Uber in the countryside, than a supermarket delivery slot  \r\r\n\r\r\noh wait? #COVID2019", "label": "positive"}, {"sentence1": "Brilliant idea Price single items low but multiple items very high to deter panic buying", "label": "negative"}, {"sentence1": "5 digital trends in #COVID-19 world:\r\r\n?Availability is compromised\r\r\n?Making smart communication choices\r\r\n?Store survival in play\r\r\n?Changing customer needs can be addressed\r\r\n?Show the shopper some love\r\r\n\r\r\n#BOPIS #OnlineShopping #eCommerce #Retail #Coronavirus https://t.co/3Da5XpvX3E", "label": "extremely positive"}, {"sentence1": "@MaisarahMahmud Hai sy jual hand sanitizer 60ml ni  #handsanitizers #COVID2019 #malaysia #coronavirus https://t.co/O1mLGKGE4R", "label": "positive"}, {"sentence1": "In a world turned upside down by the war and there s a downside risk to imports since the large drop in prices might make fuel oil cheaper than spot LNG cargoes", "label": "extremely negative"}, {"sentence1": "Beware of Virtue Signaling in #Brand #Communications About #COVID19 \r\r\nIs your message really consumer centered or mere brand commitment?  https://t.co/mZH5Wg9GiW", "label": "extremely positive"}, {"sentence1": "#Coronavirus: New supermarket workers share their stories\r\r\nSupermarkets are taking on extra staff to help them cope during #Covid-19 pandemic.\r\r\nSome newly-appointed workers share stories behind their unexpected new roles.\r\r\nhttps://t.co/vByDb2Y14q", "label": "extremely positive"}, {"sentence1": "Is there anyone thatÂ\u0092s working in a supermarket/grocery store/ or large chains (Costco, Bj, Target) or if you know anyone who, please message me. IÂ\u0092m doing a COVID-19 story for a class and would like to interview you", "label": "positive"}, {"sentence1": "My latest blog - about the power of writing during #coronavirus (mainly therapeutic) - and also a big teary gushing session about key-workers at this time. NHS workers, supermarket workers, teachers - you're all AMAZING. https://t.co/ktO1hClXJ2 #amwriting #writingcommunity", "label": "extremely positive"}, {"sentence1": "Coronavirus has us washing our hands &amp; using sanitizer more than ever. But that good hygiene can have a negative impact on our skin. Read on for tips from @lexliskincare for preserving your skin while keeping the virus at bay. #coronavirus #dryhands https://t.co/ZZwWITJWfa https://t.co/rP0vrKZHID", "label": "negative"}, {"sentence1": "Property Prices During COVID - 19 #coronavirus #sydneyproperty https://t.co/KOLO1DjKjW via @YouTube", "label": "neutral"}, {"sentence1": "Craving a chicken sandwich? The drive thru at many fast food restaurants is still an option. But is the demand enough to keep the doors open? Washington Bureau Chief @J_Policastro finds what franchises say they need as we battle the #coronavirus outbreak: https://t.co/et5p4wHVxA https://t.co/Nu6NCH4r84", "label": "extremely negative"}, {"sentence1": "WATCH As crisis drives demand London Food Bank launches first virtual food drive", "label": "extremely negative"}, {"sentence1": "Longboat Key's Publix store has put a customer limit on water, toilet paper and paper towels.\r\r\n\r\r\nThe grocery store is limiting each customer to one case of water, one package of toilet paper and one package of paper towels. https://t.co/ASHqVUg4c5 #coronavirus", "label": "neutral"}, {"sentence1": "The City of #WestMemphis is doing everything we can to keep your family and your friends safe. Today Mayor McClendon and the COVID-19 Task Force are working with local grocery store operators to limit the spread byÂ\u0085 https://t.co/2cylbmqnsa", "label": "extremely positive"}, {"sentence1": "From musicians left without a source of income to empty movie theaters and a growing desire to cocoon, the #COVID?19 crisis will have a lasting effect on consumer behavior and the music and media companies left standing. #MusicIndustry #Coronavirus  https://t.co/OS1LdBhOCT", "label": "negative"}, {"sentence1": "Long lines and so many rules at the local supermarket this morning. Hard moments help us to value things that we used to have for granted, like going to buy Nutella and other non-essential stuff on Sunday morning... #Coronavirus #COVID19 #StayHome #CaVaBienAller", "label": "extremely positive"}, {"sentence1": "You DON'TS LET it TAKE ADVANTAGE of YOU .\r\r\nSo what would you call #CORONAVIRUS ? ?\r\r\nSo what you call it controls your response to the virus!\r\r\nSome of us believe the virus is just for a season will see an opportunity, supply hand sanitizer, masks, gloves. \r\r\n#MaryThuoReality", "label": "extremely positive"}, {"sentence1": "Alot of tweet abt sanitiser bn made by #DRDO n #PatanjaliYogpeeth. Also #santoor n othr companies reducng prices. Alot ppl tweeting abt #PPE kits bn distributed. But my question is whn will it reach middle class Indian #SundayMorning #Covid_19 #India", "label": "neutral"}, {"sentence1": "Seriously Weight Loss Tips Can t Be Real We re in survival mode here The last thing we need is to add in ill informed consumer tips for fad diets during a stay at home order", "label": "negative"}, {"sentence1": "#coronavirusaus #COVID19au #COVID2019  I wonder how long before there'll be a run on the banks for their cash  from those locusts who are stripping supermarket shelves bare?", "label": "neutral"}, {"sentence1": "#mama @staceysteele13 and I made some #new #friends at the store. #sober #coronavirus #toiletpaper #earrings #love #clair #hedgehog #hedgielove #makingpeoplesmile #publix #quarantine #staysafe https://t.co/gpQZEPKCUg", "label": "neutral"}, {"sentence1": "Hundreds of people from the small Northland community of Kaikohe have lined up to be assessed for Covid-19, after a supermarket worker tested positive.\r\r\n\r\r\nhttps://t.co/oTyLn5FW0B", "label": "positive"}, {"sentence1": "Closed on Easter: Grocery stores including Trader Joe's, BJ's Wholesale Club will be closed because of COVID-19\r\r\nhttps://t.co/HJxwVOMUFM  via @USATODAY \r\r\n\r\r\n#COVID19 #Coronavirus #Easter #Retail #TraderJoes https://t.co/uAcZLANalV", "label": "neutral"}, {"sentence1": "Day 4 of social distancing.  Finding new friends on Twitter.  Good.. but fuck.. I do miss the useless banter with other shoppers in grocery store lines. Stay healthy out there people. We'll outlive this shit yet. #coronavirus #SocialDistancing", "label": "extremely negative"}, {"sentence1": "Waterstones closes stores in U-turn over staff's Covid-19 fears\r\r\nBoss James Daunt previously argued book chain Â\u0091no different to a supermarket or pharmacyÂ\u0092\r\r\n\r\r\n https://t.co/40zpCY7s3o", "label": "extremely negative"}, {"sentence1": "We welcome the responses of Amazon Facebook Google and many others to our call for eradicating online scams amp exploitation of people s fears of We call on all platforms to keep the strong measures in place until the crisis is over More  ", "label": "negative"}]