[{"sentence1": "I went online shopping at @ColourPopCo bc I'm getting desperate for new things and I got cockblocked by COVID-19, again, I just wanna know for sure when my things will be delivered ??", "label": "neutral"}, {"sentence1": "Â\u0091@BBCPanorama - Lockdown UKÂ\u0092 | Richard Bilton investigates the financial impact of Covid-19; following the workers, supermarkets &amp; manufacturers trying to survive as food runs short, jobs are lost &amp; panic sets in,the economy faces an unprecedented threat. https://t.co/diibU8jtwL", "label": "extremely negative"}, {"sentence1": "@DettolSA @DettolSA Can you please confirm whether Dis-ChemÂ\u0092s statement (as per the attached pictures) is true or not?\r\r\n\r\r\nYouÂ\u0092re prices have more than doubled during this period of corona virus. Are you actually trying to profit from this pandemic?\r\r\n", "label": "extremely positive"}, {"sentence1": "Nail polish manufacturer is producing alcohol based for the 58 000 homeless people living in Los Angeles in an attempt to help stop the spread of Read the full article here gt gt", "label": "positive"}, {"sentence1": "As a result of the COVID-19 pandemic, mortgage lenders and servicers are working to adapt to new moratoriums and regulations affecting residential mortgage loans. #COVID19 #Coronavirus https://t.co/bi5QMTvtiw https://t.co/jV10IppisO", "label": "neutral"}, {"sentence1": "It should totally be legal to egg and flour people who are rude to grocery store workers.. #COVID2019", "label": "negative"}, {"sentence1": "As unemployment in the US may hit ~20%, employer based #healthinsurance is clearly a failure. #COVID19 #Covid_19 is highlighting already exposed crises of our #PoliticalEconomy: need for #MedicareForAll, healthcare &amp; housing = Â\u0093consumer spendingÂ\u0094, #BullshitJobs, etc.", "label": "negative"}, {"sentence1": "Way to go spicejet.. I saw ur advertisement about zero rescheduling considering Covid-19 scenario... this is a classic example of Â\u0093turning a situation to opportunity and a win-win with the consumerÂ\u0094.. @flyspicejet \r\r\nCheers..!!!", "label": "extremely positive"}, {"sentence1": "National lockdown starts tomorrow don t go and panic buy supermarkets will be packed which will increase the chance of you contracting covid 19 you most likely have enough food to last you weeks stores will reopen soon Stay calm stay home", "label": "positive"}, {"sentence1": "So, this is what lockdown in France looks like:\r\r\n\r\r\nMovement is restricted to necessary journeys.\r\r\n\r\r\nFood is almost as available as always, temporary shortages due to panic buying.\r\r\n\r\r\nMany shops including computers, hotels and DIY can open.\r\r\n\r\r\n#Covid_19 #COVID2019 #covid19UK", "label": "extremely negative"}, {"sentence1": "Signature cooking pots and pans available for Kshs 6500.\r\r\nMake your order via 0715783634.\r\r\nRemember to keep safe during this COVID-19 outbreak. Online shopping is a great idea for you and your family.\r\r\n#household #homedecor #kitchendecor #glammyhomekenya https://t.co/als1dl7VAp", "label": "extremely positive"}, {"sentence1": "my classroom until people stop fucken hanging out with way to many people around!!! And I'm not talking about going to the grocery store. \r\r\n#Covid_19 #fuckcovid19 #fuckstupidpeople #stayhome #PresidentAndrewCuomo \r\r\n#trumpliespeopledie  #medicalstaffareawesome https://t.co/Kq7KYsCf0o", "label": "negative"}, {"sentence1": "Support local restaurants during this bullshit. Most are giving away free rolls of toilet paper with every order with the hope of staying afloat. Stop going to the grocery store, which is only going to exacerbate the spread of the virus. People are so fucking dumb. #Covid_19", "label": "neutral"}, {"sentence1": "@GovPritzker please recommend all grocery stores to just only have in store pick up just like restaurants! Cases of Covid-19 in grocery store employees will increase if people continue to shop in them. ?!? #Covid_19 #COVID19 #coronavirus #chicago #illinoi", "label": "extremely positive"}, {"sentence1": "MeanwhileÂ\u0085\r\r\n\r\r\nAnyone got a good, simple science experiment for a seven year old?\r\r\n\r\r\nNeed one ASAP :)", "label": "positive"}, {"sentence1": "@D0NJAZYY Need it to stock food in preparation for a worst case scenario of COVID-19 #BetWinnerVirtual", "label": "extremely negative"}, {"sentence1": "@amazon is out here raising prices of toilet roll and other household cleaning products during this #coronavirus #COVID2019 moment in history is appalling https://t.co/ymHf0uUSE0", "label": "negative"}, {"sentence1": "I am lucky that I have reusable period products at home, but having only recently switched to cups my immediate reaction to coming on early was panic at the thought of maybe not being prepared when social media is full of photos of empty supermarket shelves. #Covid_19", "label": "extremely negative"}, {"sentence1": "I couldn't get a delivery slot at any supermarket before April for my parents (69 &amp; 71 - my dad has asthma &amp; COPD).\r\r\n\r\r\nMeanwhile, Tescos pull up this morning and deliver 7 baskets &amp; a cow to my 30 year old neighbours.\r\r\n\r\r\n#communityspirit\r\r\n#UKlockdown #coronavirus #COVID19", "label": "neutral"}, {"sentence1": "3/ This could depress real-time prices and cause price spikes. The @PUCTX will offer relief to anyone facing serious economic hardship under their \"COVID-19 Electricity Relief Plan\", similar to what CCAs are offering in CA https://t.co/OlHkyldwqH @ebce_ceo", "label": "positive"}]