[{"sentence1": "Trump talked to all the fast food companies this morning to make sure their drive-throughs remain open. Then he name checks all the publicly traded companies. Spoke to the CEOs. Groan. It's always about the stock market, which is how this feels.\r\r\n#coronavirus #TrumpVirus", "label": "positive"}, {"sentence1": "Food banks face Covid 19 lockdown issues demand high supplies low", "label": "negative"}, {"sentence1": "@ScottMorrisonMP Where is our Strategic Petroleum Reserve..??? At these prices filling oil storage SPR would be a GIFT and buffer us from future supply shocks. India, US, etc not stupid. #auspol #oil #SPRAU #coronavirus #oilprice #OOTT", "label": "positive"}, {"sentence1": "I'm all for flattening the curve and all that, but as somebody who's at-risk (COVID-19 would p. kill me) I can't just keep going out to the convenience store to make ends meet, or try taking a bus to the nearest supermarket. Every time I leave the house is me risking exposure.", "label": "extremely negative"}, {"sentence1": "Finally getting money tomorrow and went to place my food order since I'm mostly homebound and can't shop and virtually everything is out of stock. No meat, no pasta, very little of anything else. No idea what I'm going to feed my son after tomorrow. #coronavirus #disabilitysucks", "label": "extremely negative"}, {"sentence1": "MeanwhileÂ\u0085\r\r\n\r\r\nAnyone got a good, simple science experiment for a seven year old?\r\r\n\r\r\nNeed one ASAP :)", "label": "positive"}, {"sentence1": "Wildlife Sanctuary Struggling To Find Food For Big Cats Due To Coronavirus Panic Buying https://t.co/6G3LU0Siz0", "label": "extremely negative"}, {"sentence1": "grocery store workers are on the front lines of 19 risking exposure amp illness in order to serve us Demand with that supermarkets take responsibility to provide face masks amp gloves", "label": "extremely negative"}, {"sentence1": "I don t play video games but COVID 19 got me looking at prices of Nintendo Switches and Animal Crossing", "label": "positive"}, {"sentence1": "A strong speech by Vladimir Putin regarding the situation with No work next week to slow down the virus outbreak Constitutional vote has been postponed Bunch of measures to help in economically turbulent times families pensioners consumer credits companies", "label": "extremely positive"}, {"sentence1": "Why Idon'tgive a shit about @NYSE and it's clients.\r\r\n\r\r\nBanks are pressuring companies to raise prices on #COVID-19 equipment, supplies and treatment https://t.co/W5m0dtGDMx\r\r\n\r\r\n#VoteBernie  &amp; #draftBernie if need be because only a fool would depend on anyone else to get #M4A", "label": "extremely negative"}, {"sentence1": "Seattle University must fulfill its values as a Jesuit Catholic University amp ensure subcontracted food service workers are provided with the wages that they would have received were they able to work Send a message in support of me amp 200 co workers ", "label": "extremely positive"}, {"sentence1": "A day in new reality at Cavalier - some staff working at home &amp; #PhysicalDistancing on our shop floor.  \r\r\nWorking on a new project - building parts for hand sanitizer dispensers. \r\r\n@APMACanada @CMoldmakers @fordnation \r\r\n#StepUp #YQG\r\r\n\r\r\nDoing what we can to assist  #coronavirus crisis https://t.co/PGhTqyugff", "label": "negative"}, {"sentence1": "National emergencies can be disastrous for U.S. credit, creating new consumer debt cycles that are hard to escape.\r\r\n\r\r\nThe government is creating policies to help consumer credit scores stay afloat. See how to defend your credit standing: https://t.co/814Piro2gl #coronavirus https://t.co/HafIAqLA4g", "label": "extremely positive"}, {"sentence1": "Almost two thirds of agency respondents believe they are completely prepared when it comes to having the tech in place for new ways of working according to a global industry survey with amp Check out the rest of the results here", "label": "positive"}, {"sentence1": "I ve been thinking a lot about how i know what I know I was a little consumed by the panic amp subsequent poor behaviour in the supermarket last week but actually there have been many more instances of connection amp solidarity Time to re centre myself 19", "label": "negative"}, {"sentence1": "@Nitcholaus @guaygeldabagel @VARice22 You canÂ\u0092t guarantee consumer confidence disappearing. Election years ALWAYS bring stocks down. Trust me, I am in the manufacturing industry. ItÂ\u0092s all they talk about. But it bounces back. And you also canÂ\u0092t just sa", "label": "positive"}, {"sentence1": "So, this is what lockdown in France looks like:\r\r\n\r\r\nMovement is restricted to necessary journeys.\r\r\n\r\r\nFood is almost as available as always, temporary shortages due to panic buying.\r\r\n\r\r\nMany shops including computers, hotels and DIY can open.\r\r\n\r\r\n#Covid_19 #COVID2019 #covid19UK", "label": "extremely negative"}, {"sentence1": "* Staying Safe While Shopping During COVID-19 Outbreak * Grocery store employees and shoppers alike are taking steps to ensure that all stay safe amid the novel #coronavirus outbreak. #COVID19 #DailyVoice. https://t.co/tKjreZ59Tl", "label": "extremely positive"}, {"sentence1": "@DettolSA @DettolSA Can you please confirm whether Dis-ChemÂ\u0092s statement (as per the attached pictures) is true or not?\r\r\n\r\r\nYouÂ\u0092re prices have more than doubled during this period of corona virus. Are you actually trying to profit from this pandemic?\r\r\n", "label": "extremely positive"}, {"sentence1": "Â\u0091@BBCPanorama - Lockdown UKÂ\u0092 | Richard Bilton investigates the financial impact of Covid-19; following the workers, supermarkets &amp; manufacturers trying to survive as food runs short, jobs are lost &amp; panic sets in,the economy faces an unprecedented threat. https://t.co/diibU8jtwL", "label": "extremely negative"}, {"sentence1": "Thing is if people arenÂ\u0092t buying from local businesses then they wonÂ\u0092t survive. How will shop owners pay for bills and feed their families? Putting prices up is bad but if you support your local then IÂ\u0092m sure they will support you. Be there for your community #Support #COVID2019", "label": "extremely positive"}, {"sentence1": "$XAUUSD $GC_F $GLDS #Gold prices hit 7-year high as investors take refuge in safer assets amid #coronavirus -fueled sell-off. Some analysts say the \"level of fear\" in the markets could push gold prices to above $2,000. @sto... https://t.co/Ug3LJcaHVP https://t.co/fB1q8lxfFu", "label": "positive"}, {"sentence1": "It's pretty relaxing to work form home. Not getting into public transport, nor seeing up your boss daily. But viruses do have a check on you daily. Sanitize your laptops and phones before using them as they are also great carrier of germs. #coronavirus #COVID?19 #sanitizer https://t.co/ad0ZmF4mmr", "label": "extremely positive"}, {"sentence1": "It should totally be legal to egg and flour people who are rude to grocery store workers.. #COVID2019", "label": "negative"}, {"sentence1": "@amazon is out here raising prices of toilet roll and other household cleaning products during this #coronavirus #COVID2019 moment in history is appalling https://t.co/ymHf0uUSE0", "label": "negative"}, {"sentence1": "? N O W [7:25am EST]\r\r\n\r\r\n@KimGuadagnoNJ jumps on with @JrzyJoePiscopo to discuss the demand for food being through the roof right now!\r\r\n\r\r\nL I S T E N??L I V E: https://t.co/dyEM6G7ZKw https://t.co/Bbw5FyCHOI", "label": "negative"}, {"sentence1": "Only an April fool would fail to realize that consumerist culture is in its death throes", "label": "extremely negative"}, {"sentence1": "Way to go spicejet.. I saw ur advertisement about zero rescheduling considering Covid-19 scenario... this is a classic example of Â\u0093turning a situation to opportunity and a win-win with the consumerÂ\u0094.. @flyspicejet \r\r\nCheers..!!!", "label": "extremely positive"}, {"sentence1": "Running to the store? Here are some tips from a medical professional. https://t.co/aZZAe3UtDY", "label": "neutral"}, {"sentence1": "People who are housebound, or just can't get to food shops, are far more worried about starving to death, than #COVID2019. And at least in hospital, you'll get fed. No supermarket home deliveries for at least 3 weeks in most areas.", "label": "extremely negative"}, {"sentence1": "I am lucky that I have reusable period products at home, but having only recently switched to cups my immediate reaction to coming on early was panic at the thought of maybe not being prepared when social media is full of photos of empty supermarket shelves. #Covid_19", "label": "extremely negative"}, {"sentence1": "Support local restaurants during this bullshit. Most are giving away free rolls of toilet paper with every order with the hope of staying afloat. Stop going to the grocery store, which is only going to exacerbate the spread of the virus. People are so fucking dumb. #Covid_19", "label": "neutral"}, {"sentence1": "\"Gold Prices to Continue Rising as Coronavirus Upends Global Economy\"\r\r\n\r\r\nhttps://t.co/0jZ7Cy3pTV\r\r\n\r\r\n#gold #silver #preciousmetals #forbes #coronavirus #ChinaVirus #Trump2020Landslide #MAGA #DemocratsAreDestroyingAmerica", "label": "neutral"}, {"sentence1": "The @NationalFarmers has declared Â\u0093it is business as usualÂ\u0094 despite the global coronavirus crisis, urging Australians to let go of their fears amid scenes of panic-buying and empty supermarket shelves. \r\r\nhttps://t.co/z2K9fqcNeN", "label": "extremely negative"}, {"sentence1": "Best part of covid 19 people are wearing gloves while using their phones at the grocery store", "label": "extremely positive"}, {"sentence1": "Might just be local to my area but just went to the supermarket and because of egg prices have doubled There were plenty in stock though Still no tp or other paper products So might wanna grab eggs next time you go", "label": "negative"}, {"sentence1": "Don't believe what this douchebag says about him curing COVID-19. He's gonna raise the prices on the drug like he did last time. https://t.co/1r4yTLNYmC", "label": "negative"}, {"sentence1": "Saw loads of over 70Â\u0092s forced to go to Supermarket today cos no delivery available for 3 wks. Only to find empty shelves of vital items like bread,milk,toilet https://t.co/vPhp9rEibmÂ\u0092s heartbreaking.They have risked their health to go out &amp; for what?? #COVID2019 #Supermarkets", "label": "extremely negative"}, {"sentence1": "THANK YOU to @medgrpsfl for their AMAZINGLY GENEROUS donation of needed supplies (hand sanitizer) to assist #ChildCare sites during the #Coronavirus Pandemic.\r\r\n\r\r\nOfficial Press Release: https://t.co/DK9BdCNRrr\r\r\nThey even offer #telemedicine appointments, if you/your loved ones need! https://t.co/SnUtdnoWuU", "label": "extremely positive"}, {"sentence1": "@MBuhari  ainÂ\u0092t you traveling any time soon??most presidents R giving aides to their citizens wit billions and trillions !! BUHARI took off  0.0541296 US Dollars off fuel prices ?? thatÂ\u0092s his own aide to Nigerians!Pls define uselessness?#StaySafeStayHom", "label": "positive"}, {"sentence1": "#CoronavirusPandemic \r\r\n#coronavirus \r\r\n\r\r\n? Corona will change Grocerry Industry Forever?\r\r\n\r\r\n?See the Reoort?\r\r\nhttps://t.co/aE3lpddavc", "label": "neutral"}, {"sentence1": "Anastasia is not amused at all the humans panic buying dog food.  The human she owns had to hit several stores to get her Purina.  \r\r\n\r\r\n#panicbuying #coronavirus #CoronavirusUSA #COVIDIOTS #COVID?19 #CoronavirusUSA https://t.co/IIuMEdmWqn", "label": "extremely negative"}, {"sentence1": "I went online shopping at @ColourPopCo bc I'm getting desperate for new things and I got cockblocked by COVID-19, again, I just wanna know for sure when my things will be delivered ??", "label": "neutral"}, {"sentence1": "As we emerge from this crisis, it is critical that marketers adapt to evolving #consumer values. Find out if you your brand is prepared with these guidelines for action and success. https://t.co/NNkQMoLBJN\r\r\n#brandstrategy #brandpostitioning #consumervalues #consumerdemands", "label": "neutral"}, {"sentence1": "IÂ\u0092m still shopping for #facemasks online, the options are VERY limited. I thought I got smart by searching for Â\u0093painters masksÂ\u0094.\r\r\n\r\r\nEverything is sold out everywhere. This is whatÂ\u0092s left. How does this help with painting???\r\r\n\r\r\n#CoronaVirus https://t.co/OLI8xfcGxo", "label": "positive"}, {"sentence1": "The @DistilledSpirit Council is urging the #Pennsylvania governor to reconsider closing all liquor stores. #retail #coronavirus\r\r\nhttps://t.co/QwCFg7gChy https://t.co/ZACdGqQETO", "label": "neutral"}, {"sentence1": "@yungneocon @21st_future That's not food waste my dude. Did you read what I wrote originally? This is of course anecdotal, but all I can find seems to say the opposite, that food wasting is actually less now: https://t.co/52hakVXxoe\r\r\nhttps://t.co/pcXpAOH", "label": "negative"}, {"sentence1": "When someone gets a little too close in the supermarket. #6feetapart #socialdistancing #wnba https://t.co/Ju8qmVzyyx", "label": "neutral"}, {"sentence1": "See the 3D of virus spreading in average grocery store with run of the mill Apparently aerosol carrying the can remain in the longer than originally thought gt avoid busy indoor spaces for yr own good", "label": "positive"}, {"sentence1": "@D0NJAZYY Need it to stock food in preparation for a worst case scenario of COVID-19 #BetWinnerVirtual", "label": "extremely negative"}, {"sentence1": "@GovPritzker please recommend all grocery stores to just only have in store pick up just like restaurants! Cases of Covid-19 in grocery store employees will increase if people continue to shop in them. ?!? #Covid_19 #COVID19 #coronavirus #chicago #illinoi", "label": "extremely positive"}, {"sentence1": "As a result of the COVID-19 pandemic, mortgage lenders and servicers are working to adapt to new moratoriums and regulations affecting residential mortgage loans. #COVID19 #Coronavirus https://t.co/bi5QMTvtiw https://t.co/jV10IppisO", "label": "neutral"}, {"sentence1": "Any exercise freaks need an extra Â\u0091periodÂ\u0092 -  you can use mine. Walking 2 miles and back to the supermarket and carrying the bags back is more than enough for an old git like me- IÂ\u0092m knackered- if they canÂ\u0092t kill me one way theyÂ\u0092ll kill me another #torybritain #covid-19", "label": "extremely negative"}, {"sentence1": "Since food and beverage services are only allowed to provide take aways the operators need a platform to deliver the food besides walk in customers", "label": "neutral"}, {"sentence1": "Britney, pause. I need to go fight #coronavirus first at the grocery store but donÂ\u0092t worry babe IÂ\u0092ll FEEL you later ? https://t.co/5gKwXSAVg9", "label": "extremely negative"}, {"sentence1": "Coronavirus Online Updates - Consumer Reports ... https://t.co/H4qS2vLGe0", "label": "neutral"}, {"sentence1": "Nail polish manufacturer is producing alcohol based for the 58 000 homeless people living in Los Angeles in an attempt to help stop the spread of Read the full article here gt gt", "label": "positive"}, {"sentence1": "Had 2 supermarket trips in last few weeks and @sainsburys are so much more on top on things than @asda were! #SocialDistancing", "label": "positive"}, {"sentence1": "URGENT PLEASE SHARE Hearing reports of fatalities among people using chloroquine containing aquarium products to treat or prevent COVID 19 PLEASE DO NOT DO THIS Chloroquine is extremely dangerous in overdose", "label": "extremely positive"}, {"sentence1": "3/ This could depress real-time prices and cause price spikes. The @PUCTX will offer relief to anyone facing serious economic hardship under their \"COVID-19 Electricity Relief Plan\", similar to what CCAs are offering in CA https://t.co/OlHkyldwqH @ebce_ceo", "label": "positive"}, {"sentence1": "my classroom until people stop fucken hanging out with way to many people around!!! And I'm not talking about going to the grocery store. \r\r\n#Covid_19 #fuckcovid19 #fuckstupidpeople #stayhome #PresidentAndrewCuomo \r\r\n#trumpliespeopledie  #medicalstaffareawesome https://t.co/Kq7KYsCf0o", "label": "negative"}, {"sentence1": "Ghana Loses $1 billion as Global Cocoa Prices Fall amid Coronavirus Pandemic\r\r\n\r\r\nhttps://t.co/DQO5uUSxet #cocoapost #cocoa #prices #coronavirus", "label": "negative"}, {"sentence1": "Signature cooking pots and pans available for Kshs 6500.\r\r\nMake your order via 0715783634.\r\r\nRemember to keep safe during this COVID-19 outbreak. Online shopping is a great idea for you and your family.\r\r\n#household #homedecor #kitchendecor #glammyhomekenya https://t.co/als1dl7VAp", "label": "extremely positive"}, {"sentence1": "Do your part to help our businesses When shopping online buy local where possible Consider ordering takeout from restaurants offering the service amp support local breweries As the COVID 19 situation is changing rapidly please follow gov t guidelines", "label": "extremely positive"}, {"sentence1": "Because brand names are the life of the party!\r\r\nhttps://t.co/I8wRf7oX4Z\r\r\n\r\r\n#shoplocal #shopping #ShopeeTH #coronavirus #StayAtHomeChallenge #workingfromhome #Online #onlineclasses #clothes #onlineshopping https://t.co/6W6cF3h5SB", "label": "positive"}, {"sentence1": "I couldn't get a delivery slot at any supermarket before April for my parents (69 &amp; 71 - my dad has asthma &amp; COPD).\r\r\n\r\r\nMeanwhile, Tescos pull up this morning and deliver 7 baskets &amp; a cow to my 30 year old neighbours.\r\r\n\r\r\n#communityspirit\r\r\n#UKlockdown #coronavirus #COVID19", "label": "neutral"}, {"sentence1": "As you take precautions to avoid the take steps to help prevent your devices from catching viruses too Click below for resources on how to avoid scams and keep your devices secure as you work remotely", "label": "negative"}, {"sentence1": "?? HOLD AFSTAND (????? ?????????)\r\r\n#danmark https://t.co/mrMdtib8Da", "label": "neutral"}, {"sentence1": "@dbongino They got the idea from news articles...\r\r\nhttps://t.co/lVKVA1j0cg", "label": "neutral"}, {"sentence1": "We are too human being and companies are just treating us like machine by not allowing us to stay @ home.if we stay @ home they are saying that better leave the job if you don't come to store.retail telecome lines are pathatic #coronavirus", "label": "extremely positive"}, {"sentence1": ".@DrTomFrieden: Planting &amp; harvesting has to continue or people will starve.\r\r\nWhat do we do to make transport as safe as possible?\r\r\n\r\r\nNew norm: Hand sanitizer, no handshakes, no one go out if they are slightest bit ill.\r\r\n\r\r\n#COVID19 #coronavirus #CDC", "label": "negative"}, {"sentence1": "As unemployment in the US may hit ~20%, employer based #healthinsurance is clearly a failure. #COVID19 #Covid_19 is highlighting already exposed crises of our #PoliticalEconomy: need for #MedicareForAll, healthcare &amp; housing = Â\u0093consumer spendingÂ\u0094, #BullshitJobs, etc.", "label": "negative"}, {"sentence1": "Total Coronavirus Cases vs November Soybean Prices Very interesting comparison as we get closer to a million cases and we drop under 8 65 NOV20 soybeans Still got 20 to go from the bottom back on the 19th", "label": "positive"}, {"sentence1": "National lockdown starts tomorrow don t go and panic buy supermarkets will be packed which will increase the chance of you contracting covid 19 you most likely have enough food to last you weeks stores will reopen soon Stay calm stay home", "label": "positive"}, {"sentence1": "When Kid Cudi said Â\u0093Haters shake my hand but I keep that sanitizer on deckÂ\u0094 I felt that #Coronavirus", "label": "negative"}, {"sentence1": "I canÂ\u0092t believe toilet paper is a flex now, who would have known a decade ago....#toiletpaper #COVID19 #coronavirus https://t.co/vvZbdt19Ja", "label": "neutral"}, {"sentence1": "Korean hand sanitizer exports increase 12 fold amid pandemic", "label": "extremely positive"}, {"sentence1": "really want to order my baby some toys on amazon but this whole COVID-19 got me paranoid ?", "label": "negative"}, {"sentence1": "#GoodNews for the #Consumer and #MainStreet ????#GasPrices could hit 99 cents in some states due to #coronavirus and supplies, expert says https://t.co/mlRKahQ7Vg #FoxNews", "label": "neutral"}]