[{"sentence1": "@BillGates have you considered flying a blimp across the planet with \"I told you so\" written on the side?\r\r\n#TedTalk #Covid19 #CoronaVirus #StopHoarding\r\r\nThe next outbreak? WeÂ\u0092re not ready | Bill Gates https://t.co/W5U4nwRlcz via @YouTube", "label": "negative"}, {"sentence1": "9 Online Grocery Shopping Stores In Klang Valley That Deliver To Your Doorstep During The COVID 19 Outbreak", "label": "neutral"}, {"sentence1": "Democrats in Wisconsin wanted to delay because they wanted time to rig it Nothing to do with If you re going to the grocery store It s safe enough to go vote", "label": "neutral"}, {"sentence1": "@RTaylorUK @NorthantsChief This chief has just made a complete fool of himself. ItÂ\u0092s not illegal to go to a supermarket and buy whatever you like. Comments like this risks public consent and the willingness to support the lockdown.\r\r\n#StayHomeSaveLives b", "label": "extremely positive"}, {"sentence1": "@thehobokengirl @KenFerrante @CityofHoboken @RaviBhalla @Tiffanie_Fisher @StevenFulop @hMAG @JerseyCity @HobokenPD @News12NJ @MarciRubinN12 Hi there, we strongly condemn price gouging and posted prices are our normal prices. In response to the COVID-19 pa", "label": "negative"}, {"sentence1": "CanÂ\u0092t get any in the supermarket but can receive free pasta in Pokemon ? #PokemonSwordShield #Covid_19 #pasta https://t.co/xQBXYdWTrZ", "label": "extremely positive"}, {"sentence1": "Where #sanitizer still available online in #USA \r\r\n#Corona #Covid19 #pandemic #coronavirus \r\r\n\r\r\nhttps://t.co/luuRSJ6JzS\r\r\n\r\r\nhttps://t.co/qoMA7V1JKc\r\r\n\r\r\nhttps://t.co/ExaPmRiiFS\r\r\n\r\r\nComment more links.", "label": "neutral"}, {"sentence1": "There's women getting stuck in homes with abusers, NHS staff being evicted because their landlords are scared of them getting COVID-19, while also not getting the right equipment to protect themselves and not being able to get food due to panic buying.", "label": "extremely negative"}, {"sentence1": "Will they supply them with masks and look at the risk of employees catching the virus. That's a No. Look round every supermarket no one as a mask and they am at a high risk. Its all about money and greed .#coronavirus", "label": "extremely negative"}, {"sentence1": "I'm observing the ppl while being on my way to the grocery store. 2 ppl now who are constantly coughing. Why don't you stay the fuck at home.? #Covid_19", "label": "negative"}, {"sentence1": "Went to my local #sainsburys this morning &amp; managed to shop everything that was on my list. In fact even went an hour later given the new rules. Yes it was busy but nothing was in short supply. Shows that restricting essential items is working #StopHoarding #coronavirus", "label": "negative"}, {"sentence1": "There was a woman following me around the produce dept in the supermarket in February I was like WTF Once I got away from her I watched her lurking around getting close to people I told my husband I was worried she was trying to spread the he thought I was crazy", "label": "extremely negative"}, {"sentence1": "I love it when you quarantine proppa To the honey s getting wiser using hand sanitizer", "label": "extremely positive"}, {"sentence1": "Selfservatism has gripped parts of the country far worse than Covid 19 with selfish people hoovering stuff up from the supermarket shelves faster than the delivery trucks can bring fresh stocks how are essential key workers going to find food to keep themselves going", "label": "negative"}, {"sentence1": "@Consumer_Cell has the worst customer service.  Sold my 77 yo mother a #consumercellular phone that doesn't work then cancelled my account without my authorization.  You should be ashamed of this kind of service during #coronavirus epidemic.", "label": "extremely negative"}, {"sentence1": "@CarnegieEndow This post examines the impact of corruption, corona virus' spread &amp; the collapse of oil prices on Iraq. The crisis offers Iraq's October Revolution-driven by youth-opportunity 2 organize 4 post-Covid-19 elections 2 enact democratic refo", "label": "extremely negative"}, {"sentence1": "Governor Baker has made testing and the pursuit of personal protective equipment for front-line medical workers priorities Â\u0097 and yesterday (4/10/2020) he expanded access to free testing to include grocery store and supermarket workers.\r\r\n\r\r\nhttps://t.co/sn075oKTqY", "label": "positive"}, {"sentence1": "To be honest I m more afraid of the panic buyers amp hoarders the families meeting for play dates the people who still go to pubs amp restaurants amp those who steal sanitizer from hospitals amp food from donation boxes than of Selfishness amp indifference frighten me", "label": "extremely negative"}, {"sentence1": "Of all the shortages created by the coronavirus pandemic -- the toilet paper and the hand sanitizer and the bottled water -- the oddest of them all has to be dogs. Oh, and cats too. \r\r\n\r\r\nhttps://t.co/z5NCk9mqaV\r\r\n\r\r\n#CoronaVirus #COVID19 #pandemic https://t.co/L8pY6l2cOz", "label": "positive"}, {"sentence1": "Actually enjoying this social distancing. The city is quiet and peaceful and lot of me time...\r\r\n \r\r\n#covid_19 #coronavirus #socialdistancing #stockup #life #virus #photography #morning #mumbai @ Mumbai, Maharashtra https://t.co/tAfYGBzLtJ", "label": "extremely positive"}, {"sentence1": "@the_teasmith @Veg_Co @TheGBFoodHub working on basis alcohol sanitizer is required 2kill #coronavirus IÂ\u0092ve self prescribed your Gin&amp;Tonic every 4hours to kill #corona in my throat, if I display symptoms I shall move 2the Bond,Dry Martini as in Casino", "label": "extremely negative"}, {"sentence1": "Soooo, itÂ\u0092s like an hour wait to get into the grocery store. I donÂ\u0092t know if I have the energy for this new life. #coronavirus #Houston https://t.co/siGnyZUHrV", "label": "positive"}, {"sentence1": "Dont Wear Gloves to the Supermarket? COVID 19 (With BM Subtitles) https://t.co/4aB9NCy1cH via @YouTube", "label": "neutral"}, {"sentence1": "Help stop the spread while shopping in our stores https://t.co/iFXWhKBZxM", "label": "positive"}, {"sentence1": "What makes me sick is how hospitals are running out of PPE and healthcare workers who are in close contact with Covid 19 positive patients are being forced to reuse theirs yet Karen is improperly wearing her N95 mask to the supermarket to buy her 25th roll of toilet paper", "label": "negative"}, {"sentence1": "HAS ANYONE CHECKED ON GROCERY STORE JOE AMIDST THIS WHOLE #coronavirus STUFF??? @BachelorABC???", "label": "neutral"}, {"sentence1": "How is COVID-19 changing consumer behaviours? ... Interesting analysis of Seattle (where the virus first hit) compared to USA in general: https://t.co/iXWXvjdpWr https://t.co/OxMUApHOBE", "label": "positive"}, {"sentence1": "Some encouraging data from Governor CuomoÂ\u0092s daily briefing:\r\r\n- daily cases +8,327 (4/4) down from 10,841 (4/3) and 10,482 (4/2)\r\r\n- BIGGER is new hospitalizations +574 (4/4) vs 1,095 (4/3) and 1,427 (4/2)\r\r\n\r\r\nNY trend is better than @NYGovCuomo optimistic case https://t.co/JG5VsOsXBp", "label": "extremely positive"}, {"sentence1": "all grocery store workers should get free testing kits. #coronavirus", "label": "positive"}, {"sentence1": "Gleaners Food Bank of Indiana is setting a lofty fundraising goal as it struggles to meet increasing demand due to COVID 19 has more", "label": "negative"}, {"sentence1": "Less than 3 months ago people were tweeting \"Christmas ruined\" &amp; abusing supermarket staff cos they hadn't received a certain item in their shopping delivery. \r\r\nHope those same people feel bloody stupid now ?\r\r\n#Covid_19", "label": "extremely negative"}, {"sentence1": "It is a sin to hoard toilet papers and/or groceries when your next door neighbor has none. Birgit 3:22, the new mind translation #SundayThoughts #pandemic #coronavirus #toiletpaper #ToiletPaperApocalypse", "label": "negative"}, {"sentence1": "REDUCED PRICES DUE TO Hire me F#or your assignments research papers Essays labreports Annotated bibliographies spring classes My response team is 24 7 I take cashapp venmo Zelle and Paypal", "label": "neutral"}, {"sentence1": "I've updated our prices page on our website to reflect the COVID-19 restrictions to our services: https://t.co/7JyfwnlXNl", "label": "neutral"}, {"sentence1": "Giving thanks to all the healthcare providers artist &amp;  supermarket workers &amp; other businesses staying open that are working hard  risking their lives to help out others in this drastic time ? #2Chainz #atlhawks #quavo #statefarm #thankyou  #healthcareheroes #coronavirus https://t.co/AzUgGwDNmY", "label": "extremely positive"}, {"sentence1": "Never thought IÂ\u0092d #SeeTheDay when #weed was easier to get than #ToiletPaper and #HandSanitizer. \r\r\n\r\r\n#CoronavirusUSA #COVID?19 #Coronavirus #CoronavirusOutbreak #PanicShopping #PanicBuying", "label": "positive"}, {"sentence1": "Stores looked pretty good today. Plenty of food. Limited paper stock. DidnÂ\u0092t check for hand sanitizer, made mine a while back. The only annoying part? The few people getting closer to randomly talk to me. Ew no, stay away ? #firstdayofspring #coronavirus", "label": "positive"}, {"sentence1": "@NYGovCuomo Middle of June would be best allow for supplies for people to buy masks and hand sanitizer before reopening economy. #coronavirus #COVID19 #QuaratineLife #StayAtHome #mondaythoughts #Milwaukee #Denver #miami #NewOrleans #OklahomaCity #Nashvill", "label": "extremely positive"}, {"sentence1": "Here is a nice article by Dennis Thompson about the challenges people are going to face paying for medical care especially if they ve lost or been laid off from their jobs I chime in at the end URGING people to get the care you need", "label": "extremely positive"}, {"sentence1": "@Tesco #Tesco #coronavirus #COVID?19 #elderly My Mum is in her 70Â\u0092s, she now has to stay home but how does she shop now? Her online shopping basket is showing every food item is out of stock. She canÂ\u0092t attend your designated shopping hours for the elder", "label": "neutral"}]