[{"sentence1": "\"It's a wonderful thing to be able to help people anyway we can, so I am happy we are able to help out in this way,\" said Jennifer Chudy, the team leader at the Portage store.\r\r\nhttps://t.co/ih4edc8njn", "label": "extremely positive"}, {"sentence1": "Maybe the coming recession might play in three phases:\r\r\n(1) Damage on main street by COVID-19 [ongoing]\r\r\n(2) CB rescue, temp. recovery on credit mkt, but no recovery on consumer econ\r\r\n(3) Unknown second shock later finally brings wall street down altogether\r\r\n$SPX $RUT $NDX", "label": "extremely negative"}, {"sentence1": "An employee of Whole Foods Market in Kennesaw has tested positive for COVID 19 and is in quarantine the grocery chain has confirmed", "label": "positive"}, {"sentence1": "Covid-19 coronavirus: New rules for online shopping during the lockdown \r\r\n https://t.co/LRysgyDn5o ?@nzherald? ?@jacindaardern? #coronavirusnz #COVID19nz we need to know on online shopping for essentials- groceries from supermarkets especially us 70+, now unavailable", "label": "neutral"}, {"sentence1": "Thank you to all grocery, drug store and gas station employees for all your relentless hard work to keep supplies and food available right now. Your support is not going unnoticed.  Stay well and strong. #coronavirus", "label": "extremely positive"}, {"sentence1": "How To COVID 19 Proof Your Smartphone 19  ", "label": "neutral"}, {"sentence1": "Retailers will need to respond to a really significant and dramatic shift in consumer behavior as a result of the COVID-19 crisis.\r\r\n\r\r\nMigration to online shopping by consumers could present the biggest threat to brick-and-mortar retailing and as the crisis unfolds, https://t.co/IoaLlBHoS2", "label": "extremely negative"}, {"sentence1": "Attention Property Managers and Landlords: Please take a moment to review recently published guidance by the Business, Consumer Services and Housing Agency directed to landlords about eviction of tenants during the COVID-19 pandemic.\r\r\nhttps://t.co/iZPLZEwpFo https://t.co/i6bhVO7l6R", "label": "negative"}, {"sentence1": "I actually saw a few rolls of toilet paper in the grocery store today. IÂ\u0092m thinking that maybe Â\u0097 just MAYBE Â\u0097 weÂ\u0092re coming back to our senses on that one. And no, I didnÂ\u0092t buy any. IÂ\u0092m still good from my single 9-roll package from before. #COVID19 #coronavirus #chilltheeffout https://t.co/TI668NZXfF", "label": "positive"}, {"sentence1": "Day 4 #Lockdown...  couldn't help, gave in to online shopping temptation... me thinks, this lockdown is going to nurture some expensive hobbies. #StayAtHome #Covid_19 #Malaysialockdown #SocialDistancing hobbies are getting expensive...", "label": "extremely positive"}, {"sentence1": "I donÂ\u0092t think it does... \r\r\n@AldiUK #coronavirus #nofood #ironic #isntitironic https://t.co/u86FyhqOaj", "label": "neutral"}, {"sentence1": "#coronavirus could have far reaching implications for consumer trust in travel sector ??? &amp; turn industry into Â\u0091bankers after the bail-out' says @keepitvivid CEO Kane Pirie https://t.co/gVDVCMmFia", "label": "extremely positive"}, {"sentence1": "Image 6 from my Deliverwho series, capturing the people behind online orders &amp; apps. The project considers the changes in modern work and shopping in contemporary urban life. Sharing this series now in tribute to the #EssentialWorkers keeping us in food &amp; meds during #covid_19 https://t.co/YiPrhEMu55", "label": "positive"}, {"sentence1": "Tried to take a time laps video walking through supermarket to show shelves empty. Was too quick so slowed it down...... DidnÂ\u0092t even realise, look what beer is left ?? #CoronaVirus https://t.co/0krDYJPfad", "label": "negative"}, {"sentence1": "Panic Buyers: Your taking food away from the people that need the strength to look after you and your family. Think before you take. #Covid_19", "label": "neutral"}, {"sentence1": "PSA from a grocery store worker STOP BUYING BABY WIPES TO REPLACE TOILET PAPER ACTUAL BABIES NEED THEM MORE Jerks", "label": "extremely negative"}, {"sentence1": "Hey Billy Graham, I don't need you to bring Jesus into my home, I need you to bring some fucking toilet paper.\r\r\n#COVID2019 #coronavirus #COVIDIOTS #QuarantineLife #toiletpaper #ToiletPaperApocalypse #COVID?19", "label": "neutral"}, {"sentence1": "People in Colorado: Cause massive panic and bulk buy\r\r\nColorado: big blizzard, lots of snow, and no power\r\r\nPeople in Colorado: $$$$ waisted on food gone bad\r\r\nColorado: that should teach them liberal idiots. \r\r\n#coronavirus #Blizzard #wellplayedcolorado", "label": "extremely negative"}, {"sentence1": "Shoppers  queue  for home deliveries as supermarket panic buying moves online", "label": "negative"}, {"sentence1": "Publishers are finding ways to help out during Covid-19 - Discounts, online promotion of indie book stores, virtual festivals &amp; author Q&amp;A\r\r\n\r\r\nhttps://t.co/PxkXmCCNnb\r\r\n\r\r\n#SupportIndies #IndieBookStores by shopping at https://t.co/jSbEJ4DyF9", "label": "extremely positive"}, {"sentence1": "List of aisles empty at the grocery store: 1) toilet paper 2) meat 3)\r\r\n3)eggs 4) cleaning wipes 5) f*cking face masks 5) milk ... AND ... BUBLY WATER. @bublywater ... but IÂ\u0092m all stocked. #StayHome #SocialDistancing #CoronaCrisis #FridayVibes #CoronavirusPandemic #lockdown https://t.co/SRcTTleefx", "label": "negative"}, {"sentence1": "and consumer are relaxing in lockdown while having some Quarantinis Our dynamic duo reviews life in during a 21st Century Apocalypse", "label": "extremely positive"}, {"sentence1": "i haven't used hand sanitizer during this whole motherfuck!\r\r\nshove it up yr ass, bc it's filthy!\r\r\n#coronavirus", "label": "negative"}, {"sentence1": "Is there any capping or regulation on prices of essential commodities like milk, groceries  etc.? Local sellers shooting up prices by almost 25% already. #CoronaUpdatesIndia #Coronavirus @narendramodi177 @ashokgehlot51 @RajGovOfficial @PoliceRajasthan @UdaipurPolice @udaipurblog", "label": "positive"}, {"sentence1": "From @SPGlobalPlatts: Power demand, prices begin to slip as #coronavirus #COVID19 stay-home orders spread: https://t.co/bhDVp2pQFv https://t.co/o7jCyqnB4l", "label": "negative"}, {"sentence1": "Very important thing  which PM Modi forgot to mention in his speech but tweeted out .\r\r\n\r\r\nEssential commodities ( Medicine, food , etc ) shall remain available\r\r\n\r\r\nNo need of panic buying \r\r\n\r\r\n#COVID2019 \r\r\n#StayHome https://t.co/D8WKlXSEgT", "label": "extremely negative"}, {"sentence1": "Just like #nurses, doctors and supermarket workers, migrant farmworkers are frontline soldiers in the war against #coronavirus. It is time to recognize their tremendous contribution, end their exploitation and demand just remuneration, social benefits and decent labor conditions.", "label": "negative"}, {"sentence1": "Scottish fishermen are turning to food banks and welfare organisations, as the #coronavirus crisis has led to plummeting demand for seafood, leaving many unable to work to feed their families.\r\r\nWorst-hit are lobster and crab fishermen in ScotlandÂ\u0092s ... https://t.co/xzrgkas1ZU", "label": "extremely negative"}, {"sentence1": "Spread the word Tues 3 24 join Consumer Reports for a Facebook Live on staying safe through Learn best practices for staying safe and navigating this crisis and ask questions live Sign up for a FB reminder here", "label": "extremely positive"}, {"sentence1": "Food commodities' stock enough for more than a year: Minister\r\r\n#YourSafetyIsMySafety  #coronavirus #covid_19 #Qatar #forqatarstayhome #MoCI  https://t.co/yBzkizS0lf", "label": "neutral"}, {"sentence1": "This is your daily reminder. Every day until the Covid-19 pandemic has settled down.\r\r\n\r\r\nPlease stay at home, go out for excerise and emergencies or food shopping, be safe and wash your hands. DonÂ\u0092t panic buy, get what you need this week. Keep your distance! Follow this please!", "label": "positive"}, {"sentence1": "This articles reviews the challenges and opportunities for operators posed by COVID-19, and outlines the changes to retail propositions already enacted by some operators in response to its spread: https://t.co/q8FulrLITk https://t.co/zTlM3os0Mw", "label": "positive"}, {"sentence1": "https://t.co/DAhV0sUAkI #coronavirus #COVID19 3 months from start to declining cases #StopPanicBuying", "label": "neutral"}, {"sentence1": "Share profits from low oil prices Congress to govt", "label": "positive"}, {"sentence1": "Stop panic buying: healthy food to last you through a crisis https://t.co/OtuDJB0tGx via @scmpnews #eating #coronavirus", "label": "extremely negative"}, {"sentence1": "3. Not only are the cars normally expensive, they significantly inflated the prices of the cars. \r\r\n\r\r\nImagine what ?3.6 billion could have done for healthcare and education in Bauchi state. \r\r\n\r\r\nNot even talking about covid-19 now. Just basic primary healthcare.", "label": "neutral"}, {"sentence1": "Thank you, to all the officials, who are acting like adults, and working on the Wuhan Flu. Thank you Medical Personal, standing by and ready. But a huge thank you, to retail grocery store employees. They are the heros of the hour. Keep doing what you can.We got this. #Coronavirus", "label": "extremely positive"}, {"sentence1": "The NH Attorney General is warning about a wave of COVID-19 related scams surrounding federal stimulus payments. These scams target consumer vulnerability by attempting to capitalize on the anxiety naturally arising from current events. \r\r\n\r\r\nRead more: https://t.co/jWfaBbJmUC https://t.co/X33I90YHVV", "label": "extremely negative"}, {"sentence1": "The only petition you should've signed is for food prices to be decreased and also celebrities who took teachers jobs. \r\r\nDon't fool yourself, alcohol isn't serious as these above issues. \r\r\n#CelebritiesAreNotTeachers #foodprices\r\r\n#Day19ofLockdown \r\r\n#COVID2019  #SignThePetitionSA", "label": "negative"}, {"sentence1": "Some retail Chapter 11s are on pause, with store liquidations effectively impossible. But a \"wave\" of bankruptcies is coming, experts say.\r\r\n\r\r\nRead more: https://t.co/5UZ5B3Ms03\r\r\n\r\r\n#Covid19 #deliveryservices #grocerydelivery #samedaydelivery #deliveryservice #haultail", "label": "positive"}]