[{"sentence1": "I have returned back to Westminster today to support the The bill will make sure   More emergency personnel on the front line   Help keep our supermarket shelves full   Protect you your family and your job", "label": "extremely positive"}, {"sentence1": "Amazon seeks to hire 100 000 to keep up with surge in orders Amazon said Monday that it needs to hire 100 000 people across the U S to keep up with a crush of orders as the spreads and keeps more people at home shopping online", "label": "positive"}, {"sentence1": "A fish tank product has the same chemical US is studying for COVID-19 - Mail Online https://t.co/kwlN8f2iAG", "label": "neutral"}, {"sentence1": "Very interesting article! #Coronavirus supermarkets shake-up: WhatÂ\u0092s disappearing from shelves | The New Daily https://t.co/2n7h4efHgo", "label": "positive"}, {"sentence1": "A supermarket chain in started taking shoppers temperatures at the door is shutting almost all industrial output after reporting the most deaths in a day BEEN DOING THAT IN  FOR 2 MONTHS SHOULD DO IT  ", "label": "neutral"}, {"sentence1": "Amazon seeks to hire 100,000 to work in warehouses to keep up with a crush of orders as the #coronavirus spreads and keeps more people at home, shopping online.\r\r\n\r\r\n#jobs #retail\r\r\n\r\r\nhttps://t.co/4Dqjuz4UWL", "label": "neutral"}, {"sentence1": "Congratulations to Supermarket owner Hitesh Palta for taking the lead on putting our elderly first and giving them a priority shopping schedule during the #coronavirus crisis #kindness #COVID_19 https://t.co/UXPTNdfHqi", "label": "positive"}, {"sentence1": "Drop in #oil prices, downfall of #tourismÂ\u0085 the widespread of #Coronavirus has naturally impacted #economies in the #MENA region. To what extent? https://t.co/qy1g1QVnXx https://t.co/bXgLvzx7Od", "label": "negative"}, {"sentence1": "Great by President Nicholas Bertram in the encouraging customers to stop with associates working hard to restock shelves Panic buying also affects food banks", "label": "positive"}, {"sentence1": "Passed a guy in the grocery store who had a bag of pork rinds and a case of beer in his cart.\r\r\n\r\r\nHe's ready.\r\r\n\r\r\n#coronavirus #doomsdaypreppers #WV", "label": "positive"}, {"sentence1": "The #Answer Isnt Either/Or But #BOTH: #COVID2019 is r #opportunity 2 #RaiseTheBar &amp; build #US #healthcare capacity, #workersrights, #consumer #protection &amp; #sustainable #cleanenergy #jobs, b/c #publichealth &amp; #prosperity go #HandInHand: https://t.co/tHo1TLQjfv #moral #imagination", "label": "neutral"}, {"sentence1": "A LITTLE MESSAGE TO ALL THE GREEDY PEOPLE CLEARING THE SHELVES AND LEAVING NOTHING FOR OTHERS", "label": "negative"}, {"sentence1": "Our team constantly has their ears to the ground listening for the important themes that will guide the shopper and consumer needs of youth and family even during these times of 19 Learn more about recent trends in our blog", "label": "positive"}, {"sentence1": "Just remember, wherever you're from in the world, it could be much worse.\r\r\n\r\r\nYou could be an American Bible loon.\r\r\n\r\r\n https://t.co/lGAiPDg44f", "label": "negative"}, {"sentence1": "I work in retail where people come in and out daily. What is the difference between a convenience store and nail saloon? #coronavirus", "label": "neutral"}, {"sentence1": "What I donÂ\u0092t get is that everyone is being told to #StayAtHome and yet SO many retail stores remain open for people to Â\u0093mass gatherÂ\u0094 and go shopping! People are actually queuing in close proximity to go and buy food!!Stay 2m apart and donÂ\u0092t panic! Get a F**king grip #coronavirus", "label": "negative"}, {"sentence1": "@AndyYork8 @iRorschachBot @TheTattooedProf I'm limiting my grocery shopping to once per week. I'd like to go longer in between shops, but I need to restock my fresh fruit weekly. A friend of mine who works in a supermarket told me she's crying at work eve", "label": "positive"}, {"sentence1": "All the people buying dried beans at the grocery store need to know this. Dried (not canned) kidney beans must be heated to boiling for 10 minutes or else **they will poison you**. You must *boil* them, as heating just below boiling makes it worse! Pass it on. #coronavirus", "label": "extremely negative"}, {"sentence1": "Since the threat of Coronavirus COVID 19 the OUR has immediately and until further notice stopped accepting walk in customers    Rest assured we remain committed to you and so we are encouraging you to use the other available means of contacting our Consumer Affairs Unit  ", "label": "extremely positive"}, {"sentence1": "Right tweeps: what is the best (quietest) time to go to the supermarket? Is later in the day better? What shop(s) are doing a good job trying to keep shoppers safe? #coronavirus #COVID2019", "label": "extremely positive"}, {"sentence1": "@ymxr6 Makes my heart ache its the elderly that won't make it through the disease either and people want yo starve them too and force them out every day to expose themselves more and more because they can't bulk buy selfish b*****ds #stopthepeak #stayhome", "label": "extremely negative"}, {"sentence1": "Why aren't supermarket workers wearing PPE\r\r\n@SkyNews @BBCNews\r\r\n@itn @Tesco @asda @sainsburys @Morrisons\r\r\n@CoopStoreonline\r\r\n#coronavirusuk #COVID?19 #Coronavid19 #coronavirus", "label": "neutral"}, {"sentence1": "The Canada Food Price Report released in 2019 predicted a 2 4 price increase of produce in 2020 A update of the report says prices will raise more than expected With more people now at risk of food insecurity we urgently need local solutions", "label": "negative"}, {"sentence1": "#Supermarket #Superheroes -- Hardworking #Employees Have Been Hailed as the Unsung Heroes of the #Coronavirus #Pandemic: https://t.co/0mYpPzHrgu.", "label": "extremely positive"}, {"sentence1": "When youÂ\u0092re online shopping, try to use eBay/Etsy rather than Amazon. \r\r\n\r\r\nNot only will shipping be quicker but youÂ\u0092re supporting independent sellers who are likely struggling during this crisis.\r\r\n\r\r\n#coronavirus", "label": "extremely negative"}, {"sentence1": "Is it totally necessary for whole familyÂ\u0092s to go to the supermarket? ???????????????#socialdistancing #coronavirus IÂ\u0092m glad to get some Â\u0091meÂ\u0092 time for an hour ?", "label": "positive"}, {"sentence1": "Work-from-home peeps: Let's spend some of the gas $ we are saving on local businesses (online shopping, gift cards) &amp; bigger tips for service workers. They need our help! #coronavirus", "label": "extremely positive"}, {"sentence1": "I've been busy creating a toilet paper inventory backed by a robust approval system and spreadsheet recording.\r\r\n\r\r\n#toiletpapercrisis #toiletpaper #coronan #StayAtHome #SelfIsolation #coronavirus #panicbuying https://t.co/OaBRFXvi1E", "label": "extremely positive"}, {"sentence1": "Actor Tyler Perry surprised shoppers Wednesday at two grocery store chains when he bought their groceries for them amid the COVID 19 pandemic", "label": "positive"}, {"sentence1": "Just back from the supermarket. Shopping while #SocialDistancing is like playing an old video game. ThereÂ\u0092s someone up ahead - must slow down until theyÂ\u0092re gone. DonÂ\u0092t cough, or even sniff - any sound will alert the guards. Nerve wracking.\r\r\n#COVID19 #coronavirus #dontmakeasound", "label": "extremely positive"}, {"sentence1": "The one counter-regressive benefit of the current #CoronaVirus pandemic is the collapse in gas prices, which at least giver poorer Americans some breathing room on inelastic costs.\r\r\n\r\r\nTrump did his best to pull that out from under them today, as well ...", "label": "extremely positive"}, {"sentence1": "With online grocery shopping available to SNAP recipients in only six states governors are pushing the Department of Agriculture to be more flexible with food stamps", "label": "positive"}, {"sentence1": "@GovMurphy Is the state making shopping accommodations for Covid-19 at risk groups?\r\r\nChallenges may be:\r\r\nCannot stock up on items on a fixed income.\r\r\nAccessibility requires shopping to be quick and efficient.\r\r\nThey may not be computer literate so cann", "label": "positive"}, {"sentence1": "Who is watching retailers during this #coronavirus pandemic, prices are being inflated and this is criminal! @EFFSouthAfrica is there anything that can be done?I hear you guys addressed and warned against this...? https://t.co/BPHTKNJVJo", "label": "extremely negative"}, {"sentence1": "Major UK supermarket chain tells people to visit stores to get food despite government telling people to stay at home on TV, by letter and text #Coronavirus  https://t.co/LC1QNW4zR0", "label": "neutral"}, {"sentence1": "As the COVID-19 spreads across the U.S., threatening American lives and adversely impacting the nationÂ\u0092s economy, the transportation fuel sector will be especially hard hit. Declines in consumer gasoline use will shrink demand for corn #ethanol.https://t.co/tx98rTK7Rz https://t.co/tSGoNVeDWS", "label": "extremely negative"}, {"sentence1": "Support local small businesses during the COVID-19 shelter in place by shopping GRANTERS online. Stay Safe, stay home and shop. Thank you for your continued support! granters on eBay https://t.co/BT16v1ZyP4", "label": "extremely positive"}, {"sentence1": "Going to the grocery store is now an anxiety inducing event. #coronavirus #Covid_19", "label": "negative"}, {"sentence1": "We need to fight for increases the wages of grocery store workers during this time of crisis, many are putting their lives fr themselves and families at risk. We need to demand they get a wage increase!!! @loblawco , @sobeys, etc. #ontpoli #cdnpoli #coronavirus @UFCWCanada", "label": "extremely negative"}, {"sentence1": "SHOP NOW ONLINE: https://t.co/rr2O5ukaRP\r\r\n\r\r\nStay at home during lockdown and let us do the shopping for you. COVID 19 Supplies and groceries delivered to your doorstep.\r\r\n\r\r\nOnly available in Gauteng (selected areas) https://t.co/fAFCMjcee5", "label": "neutral"}, {"sentence1": "Shifts in consumer behaviors may provide early hints as to what the future might look like post COVID 19 These behaviors are driving diverging patterns of consumption and stock price recovery across different sectors", "label": "positive"}, {"sentence1": "Mum crying in supermarket shows the ridiculousness of bulk-buying \r\r\n\r\r\nWE NEED TO REMEMBER THAT THERE ARE PEOPLE IN NEED ALL OVER. PLEASE STOP GREEDY BUYING.\r\r\n#SaturdayMotivation\r\r\n#bulkbuying\r\r\n#toiletpaper #coronavirus\r\r\n@detachedaz\r\r\n@CRTM63\r\r\n@debameyers\r\r\n\r\r\nhttps://t.co/USRGkyGcYU", "label": "extremely negative"}, {"sentence1": "#coronavirus I have to say that I'm scared about the people who aren't scared. I was in a Zoom this morning and a woman said she goes to the grocery store every day because it's the only place to go! But the point is to stay home and stay away from people, not hang out w/ folks.", "label": "negative"}, {"sentence1": "Daily reflection 20/3/20 https://t.co/V7Ws0O7dbG", "label": "neutral"}, {"sentence1": "New NYS consumer guide from UHF with practical advice on how to replace lost health coverage or find a new health plan during these perilous times via", "label": "negative"}, {"sentence1": "The Lower 9th Ward Grocery Store needs your help during #CoronavirusPandemic #Covid_19  https://t.co/SLdhap6gev", "label": "positive"}, {"sentence1": "@realDonaldTrump Come on Trump, tell us whether or not Covid-19 existed prior to this year. We know it's been around for several years. The truth WILL come out eventually. Every government official whom profited from low stock prices due to disinformation", "label": "positive"}, {"sentence1": "What are your favourite local small businesses that have online shopping or take out/delivery? After Snowmaggedon and now COVID-19 shut downs and social distancing, I am nervous we're going to lose even more...who should we be supporting? We need to bring each other up.", "label": "negative"}, {"sentence1": "Meijer and Walmart limited the number of shoppers allowed in stores at one time to help with social distancing.\r\r\nhttps://t.co/ffb2poweds", "label": "positive"}, {"sentence1": "4 US #Senators are under scrutiny over claims they used insider knowledge about the impending #coronavirus crisis to sell #shares before prices plummeted. https://t.co/MQrCNFqFjg", "label": "extremely negative"}, {"sentence1": "The Covid 19 test results of a Christchurch man who filmed himself coughing on supermarket shoppers has been revealed", "label": "neutral"}, {"sentence1": "Stop panic buying at our super markets", "label": "negative"}, {"sentence1": "Stock markets fall back despite ECB and Federal Reserve's coronavirus... #coronavirus #COVID19 #COVID?19 #???????????? #??????? #Covid_19 #corona #CoronavirusOutbreak #prepper #survival #bushcraft #RT #follow https://t.co/Zxb48Mp3AN", "label": "neutral"}, {"sentence1": "During #Covid_19 when grocery shopping do you use your own Reusable Bags or Store Plastic Bags? #poll #Shopping #ClimateChange #ecofriendly #COVID19 #mondaythoughts", "label": "neutral"}, {"sentence1": "Thank your retail workers by asking their stores to make sure they receive annual bonuses, something that many a store got rid of with their payrose last year. #Covid_19 #CoronaCrisisuk #CoronaCrisis #retail", "label": "extremely positive"}, {"sentence1": "My coronavirus Dinner Plan till the end of the month. Kid Friendly Picky Eater Approved. #coronavirus #mealplan #mealprep #stockup #coronapocolypse #HowToKeepPeopleHome #Covid_19 #schoolclosure #QuarantineLife https://t.co/PL7S0gonuy", "label": "extremely positive"}, {"sentence1": "Looking at the remnants of about 60 acres of cucumber for which the market disappeared 2 weeks ago due to Covid 19 and the collapse of the food service demand https://t.co/x69jQBisOx", "label": "extremely negative"}, {"sentence1": "The first lot of sweets and craft deliveries ready. Our party in a box can be for just one child and prices start from just Â£10!  #coronavirus @lovehoole @hooleandnewton @HooleChester @merchant_elite @chestertweetsuk @wearechester @SkintChester @RealCheshireSet https://t.co/ouH9R0Xdcs", "label": "extremely positive"}, {"sentence1": "Stranger at the Grocery Store: This Covid-19 is really scaring the shit out of me. Waiting for my reports. \r\r\nMe: Stay positive!\r\r\nStranger throws a shampoo bottle at me.", "label": "extremely positive"}, {"sentence1": "Seneca County Food Pantries Need Donations Now The COVID 19 pandemic has caused an increase in demand at local food pantries and many are still in need They are accepting non perishable food items and monetary donations Please contact the food pantries listed below to donate", "label": "extremely positive"}, {"sentence1": "Love it when artists see the funny side. Don't know who created this but it's brilliant. If you had seen the idiots in Tesco the other day you would understand! #CoronavirusOutbreak #coronavirusuk #coronavirus #Munch #toiletpaper #toiletroll https://t.co/0lWEURaalX", "label": "extremely positive"}, {"sentence1": "I know itÂ\u0092s hard but you have to laugh. The stripping of supermarket shelves, except for the fresh stuff, might actually be good for peeps wanting to flatten some other curves #covid19australia #coronavirus #StayAtHome #pandemic #panicbuying https://t.co/fOqQG6la10", "label": "extremely positive"}, {"sentence1": "Nielsen updates crazy sales numbers", "label": "negative"}, {"sentence1": "When kiryu saw selfish people in the grocery store\r\r\n*sorry for the fps drop\r\r\n#coronavirus \r\r\n#YakuzaKiwami2\r\r\n#ryugagotoku https://t.co/xFD6QOqUAF", "label": "extremely negative"}, {"sentence1": "@MayorOfLA says the city will provide 5,000 masks for grocery store workers, and 10,000 masks for first responders.  #coronavirus", "label": "neutral"}, {"sentence1": "Get the latest on consumer perceptions and attitudes. @DA_Research has free and available resources for travel industry professionals. \r\r\nhttps://t.co/bIXQJddf30 https://t.co/7nrOvRIYa9", "label": "positive"}, {"sentence1": "Highland Lakes area food pantries struggle to stock shelves as grocery store shoppers stock up amidst COVID-19 pandemic. #HighlandLakes #foodpantries #COVID19 #DailyTrib https://t.co/SbcfUE4sV1 https://t.co/vP3egsQZyR", "label": "negative"}, {"sentence1": "See our Bryan Sun MD Nielsen Africa discuss 6 key consumer behavior thresholds that tie directly to concerns around with  ", "label": "neutral"}, {"sentence1": "#Restaurants in these #coronavirus times can significantly cut their electric bill by doing #refrigeration coil cleaning with our unique https://t.co/PRuQigzrsu coil cleaning technology - a no-mess do-it-yourself method. #foodservice \r\r\nAlso: #Cstores #grocery #pizzerias too! https://t.co/3bc1GChClK", "label": "extremely negative"}, {"sentence1": "We have probably been to the local #supermarket lately and wondered \"What happened to all the #toilet #paper.. Is this a sign of The End?!\". The #Coronavirus has taken over our lives and has caused many to loseÂ\u0085 https://t.co/k1KZ27Wls7", "label": "negative"}, {"sentence1": "Me after #Quarantine ??#toiletpaper #ToiletPaperPanic #ToiletPaperApocalypse #socialdistancing #coronavirus #COVID19  #stay #home ? https://t.co/8hEdViDso2", "label": "neutral"}, {"sentence1": "US Food Industry Scrambles To Resupply Stores Amid Apocalyptic Surge In Demand | Zero Hedge https://t.co/Pw9QbGcE1j #coronavirus #CoronavirusOutbreak #COVID19", "label": "extremely negative"}, {"sentence1": "I want to share that I did a panic COVID-19 buy a month ago for my brother. I bought him 5 gallons of heart healthy food, got him 2 months worth of medication, TP, sanitising cleansing products, etc. All for if one day, I couldnÂ\u0092t return home for him because of work. Hurts.", "label": "negative"}, {"sentence1": "Have also been informed that sent out an email saying they expect current retail employees to handle all of the extra store sanitation in light of COVID 19 This company is such a piece of shit that consistently puts their employees at risk", "label": "extremely negative"}, {"sentence1": "#RhodeIsland @GovRaimondo announces https://t.co/QRFkYXMDM4 grocery delivery service for #Coronavirus quarantiners; partnering with #RI based supermarket.", "label": "neutral"}, {"sentence1": "The #coronavirus ruined sneezing in public the same way pedophiles ruined waving at toddlers in the grocery store.", "label": "extremely negative"}, {"sentence1": "@SenRickScott @hughhewitt @WHO Always the #gop @potus goto move. Assign blame that wastes time for no benifit other than piss off country that makes everything we need NOW!\r\r\n@marcorubio \r\r\n#PPEshortage\r\r\n#maga #Republicans \r\r\n#coronavirus #CODVID19\r\r\n#Vo", "label": "extremely negative"}, {"sentence1": "We re scared of bringing something back home with us Trapped behind checkout counters or stocking shelves amidst customers supermarket workers in Italy say they are in over their heads and insufficiently protected against", "label": "negative"}, {"sentence1": "@Tesco shame on you. No staff training. Blatant disregard for consumer safety. Im not going away. #Covid_19 #SelfIsolation #StayAtHome", "label": "negative"}, {"sentence1": "There are many people who are living below the poverty line who were not able to stock up on food as they didn t have the resources to do it And now their pay cheque has stopped", "label": "extremely negative"}]