[{"sentence1": "Giving thanks to all the healthcare providers artist &amp;  supermarket workers &amp; other businesses staying open that are working hard  risking their lives to help out others in this drastic time ? #2Chainz #atlhawks #quavo #statefarm #thankyou  #healthcareheroes #coronavirus https://t.co/AzUgGwDNmY", "label": "extremely positive"}, {"sentence1": "I've updated our prices page on our website to reflect the COVID-19 restrictions to our services: https://t.co/7JyfwnlXNl", "label": "neutral"}, {"sentence1": "Of all the shortages created by the coronavirus pandemic -- the toilet paper and the hand sanitizer and the bottled water -- the oddest of them all has to be dogs. Oh, and cats too. \r\r\n\r\r\nhttps://t.co/z5NCk9mqaV\r\r\n\r\r\n#CoronaVirus #COVID19 #pandemic https://t.co/L8pY6l2cOz", "label": "positive"}, {"sentence1": "@BillGates have you considered flying a blimp across the planet with \"I told you so\" written on the side?\r\r\n#TedTalk #Covid19 #CoronaVirus #StopHoarding\r\r\nThe next outbreak? WeÂ\u0092re not ready | Bill Gates https://t.co/W5U4nwRlcz via @YouTube", "label": "negative"}, {"sentence1": "Never thought IÂ\u0092d #SeeTheDay when #weed was easier to get than #ToiletPaper and #HandSanitizer. \r\r\n\r\r\n#CoronavirusUSA #COVID?19 #Coronavirus #CoronavirusOutbreak #PanicShopping #PanicBuying", "label": "positive"}, {"sentence1": "I'm observing the ppl while being on my way to the grocery store. 2 ppl now who are constantly coughing. Why don't you stay the fuck at home.? #Covid_19", "label": "negative"}, {"sentence1": "Governor Baker has made testing and the pursuit of personal protective equipment for front-line medical workers priorities Â\u0097 and yesterday (4/10/2020) he expanded access to free testing to include grocery store and supermarket workers.\r\r\n\r\r\nhttps://t.co/sn075oKTqY", "label": "positive"}, {"sentence1": "Soooo, itÂ\u0092s like an hour wait to get into the grocery store. I donÂ\u0092t know if I have the energy for this new life. #coronavirus #Houston https://t.co/siGnyZUHrV", "label": "positive"}, {"sentence1": "Where #sanitizer still available online in #USA \r\r\n#Corona #Covid19 #pandemic #coronavirus \r\r\n\r\r\nhttps://t.co/luuRSJ6JzS\r\r\n\r\r\nhttps://t.co/qoMA7V1JKc\r\r\n\r\r\nhttps://t.co/ExaPmRiiFS\r\r\n\r\r\nComment more links.", "label": "neutral"}, {"sentence1": "@thehobokengirl @KenFerrante @CityofHoboken @RaviBhalla @Tiffanie_Fisher @StevenFulop @hMAG @JerseyCity @HobokenPD @News12NJ @MarciRubinN12 Hi there, we strongly condemn price gouging and posted prices are our normal prices. In response to the COVID-19 pa", "label": "negative"}, {"sentence1": "@Consumer_Cell has the worst customer service.  Sold my 77 yo mother a #consumercellular phone that doesn't work then cancelled my account without my authorization.  You should be ashamed of this kind of service during #coronavirus epidemic.", "label": "extremely negative"}, {"sentence1": "Will they supply them with masks and look at the risk of employees catching the virus. That's a No. Look round every supermarket no one as a mask and they am at a high risk. Its all about money and greed .#coronavirus", "label": "extremely negative"}, {"sentence1": "Democrats in Wisconsin wanted to delay because they wanted time to rig it Nothing to do with If you re going to the grocery store It s safe enough to go vote", "label": "neutral"}, {"sentence1": "Some encouraging data from Governor CuomoÂ\u0092s daily briefing:\r\r\n- daily cases +8,327 (4/4) down from 10,841 (4/3) and 10,482 (4/2)\r\r\n- BIGGER is new hospitalizations +574 (4/4) vs 1,095 (4/3) and 1,427 (4/2)\r\r\n\r\r\nNY trend is better than @NYGovCuomo optimistic case https://t.co/JG5VsOsXBp", "label": "extremely positive"}, {"sentence1": "CanÂ\u0092t get any in the supermarket but can receive free pasta in Pokemon ? #PokemonSwordShield #Covid_19 #pasta https://t.co/xQBXYdWTrZ", "label": "extremely positive"}, {"sentence1": "Less than 3 months ago people were tweeting \"Christmas ruined\" &amp; abusing supermarket staff cos they hadn't received a certain item in their shopping delivery. \r\r\nHope those same people feel bloody stupid now ?\r\r\n#Covid_19", "label": "extremely negative"}, {"sentence1": "I love it when you quarantine proppa To the honey s getting wiser using hand sanitizer", "label": "extremely positive"}, {"sentence1": "There was a woman following me around the produce dept in the supermarket in February I was like WTF Once I got away from her I watched her lurking around getting close to people I told my husband I was worried she was trying to spread the he thought I was crazy", "label": "extremely negative"}, {"sentence1": "HAS ANYONE CHECKED ON GROCERY STORE JOE AMIDST THIS WHOLE #coronavirus STUFF??? @BachelorABC???", "label": "neutral"}, {"sentence1": "Went to my local #sainsburys this morning &amp; managed to shop everything that was on my list. In fact even went an hour later given the new rules. Yes it was busy but nothing was in short supply. Shows that restricting essential items is working #StopHoarding #coronavirus", "label": "negative"}]