[{"sentence1": "The Competiscan Insights team just released a study on consumer perceptions regarding COVID-19. Clients can access the full report on https://t.co/ecEdPvXFcS.\r\r\n\r\r\n#Competiscan #coronavirus #covid19 https://t.co/7OnKG0T48c", "label": "neutral"}, {"sentence1": "4/ \"Because of the fractured federal response to COVID-19, state governors say theyÂ\u0092re now bidding against federal agencies and each other for scarce supplies, driving up prices.\"\r\r\nApr 2, 2020 FEMA supply chain chief:\r\r\nThat's normally how things work, right?\r\r\nhttps://t.co/RwUSac0e3m", "label": "neutral"}, {"sentence1": "Our post offices remain open, and our posties and drivers are still out there delivering every day, although there may be some service impacts ?\r\r\n\r\r\nhttps://t.co/63Dn800rnx", "label": "neutral"}, {"sentence1": "I am ghost writing amp during This I m flexible on Prices You won t have to pay me until I have SOMETHING written I DO need a Down Payment before I send you all the lyrics though", "label": "positive"}, {"sentence1": "#stocks to buy during the #CoronaCrisis -  \r\r\n#Shares of this rapidly growing quality #Retail, #Medical &amp; packaging companies  at low prices while the #USeconomy is shut down - TJX Cos, Medtronic PLC, Ball Corp. \r\r\n#TJX current reports at https://t.co/BNUZk8rTYE \r\r\nImage: InvestorPlace https://t.co/FhpB1FLDBE", "label": "negative"}, {"sentence1": "Is there a long $FB position on #Covid_19 accelerating adoption of VR?\r\r\n\r\r\nTechnical circles were buzzing on Oculus a few months ago. Seems like its made real consumer progress.\r\r\n\r\r\nIf we're quarantined for 6mo+, people's itch for visual novelty might be a tipping point.", "label": "extremely positive"}, {"sentence1": "Please join us for a webinar on April 9th. We will discuss some of the key developments in the credit reporting space and their impact on consumer financial services businesses. For more details please visit below. #consumerfinance #covid19 https://t.co/v8Z8cJmiD0", "label": "extremely positive"}, {"sentence1": "Baby ends up hospitalized for COVID-19 after father visited the grocery store \r\r\n#Covid_19 \r\r\nRead more: https://t.co/jioxfJyaFB", "label": "neutral"}, {"sentence1": "Trump says decrease in gasoline is a \"huge tax break\" for citizens (you know, the ones who have currently lost their jobs, can't pay rent, etc.) However, lower oil prices are \"devastating for Russia\" (repeated that twice).  He wants oil prices 2 soar for businesses. #coronavirus", "label": "extremely negative"}, {"sentence1": "Stocks on #WallStreet slid on Monday over concerns of what the #coronavirus #pandemic will do to corporate earnings while #crude prices were mixed as a global deal on record output cuts failed to quell doubts the pact would head off an #oil glut.\r\r\nhttps://t.co/uB1dU2lWO7", "label": "extremely negative"}, {"sentence1": "Our COVID-19 strategy workbook\r\r\n\r\r\nHelping you develop a strategy in response to the pandemic, it includes:\r\r\n\r\r\n* Examples of changing consumer behaviour\r\r\n* Frameworks to help you provide value to your customers &amp; work out how you can flourish\r\r\n\r\r\n?? https://t.co/BincxHLvnp", "label": "extremely positive"}, {"sentence1": "After facing a staff shortage due to a national 21daylockdown, Bigbasket an online grocery store in India is hiring. This was done after company started facing difficulties to fulfill its home delivery orders which rapidly increased after lock down.\r\r\n\r\r\n#Lockdown21 #Covid_19", "label": "positive"}, {"sentence1": "Grocery #store executives on the front lines: https://t.co/Hj0hvekLph", "label": "neutral"}, {"sentence1": "Watch this $2 TRILLION bailout raise prices so much that it becomes the catalyst for widespread  #cryptocurreny adoption.\r\r\n\r\r\n#bitcoin #ethereum #bailout #coronavirus #StimulusPlan #crypto #ReliefBill", "label": "negative"}, {"sentence1": "IÂ\u0092ve checked every CVS, Walgreens, and Rite Aid in a five mile radius, but nada #backpackingbear #shelterinplace #covid_19 #coronavirus #toiletpaper https://t.co/hoPVgTZmSZ", "label": "neutral"}, {"sentence1": "Scammers are trying to take advantage of our most vulnerable right now with related scams Click below to learn more about what to look out for", "label": "extremely negative"}, {"sentence1": "Unfortunately, fraudsters are finding ways to take advantage of #coronavirus fears. @ABABankers shares valuable insights and tips to avoid coronavirus scams so you can protect your money: https://t.co/tt6oWKkUZR #COVID19 https://t.co/0O2giNxja3", "label": "extremely negative"}, {"sentence1": "@dmoahi @Nondabz_N @MightiJamie You're now being futuristic,with a lot of online shopping, nobody will ever need a mall, the COVID-19 has been a game changer,this lockdown has proven that people can work at home so renting premises is  irrelevant. Office ", "label": "neutral"}, {"sentence1": "We need to see this on everyone now @GMB #askDrH @piersmorgan my daughter was ridiculed in the supermarket when she went for food. @BorisJohnson #COVID?19 #COVIDIOTS #COVID19 #coronavirusuk #Covid_19 https://t.co/8Y4dNeygR3", "label": "negative"}, {"sentence1": "Seeing these #coronavirus curves slowly heading inexorably northwards kinda mimics the prices lately of certain non grocery lines at a 24 hr Fruit &amp; Veg merchants outlets here in Perth I reckon\r\r\n\r\r\nOr I might be imagining things...\r\r\n????\r\r\n\r\r\n#justanotherdayinWA", "label": "positive"}, {"sentence1": "ItÂ\u0092s more important than ever before to get consumer goods on store shelves quickly and to ensure food, water, &amp; medicine is safely packaged. Flint Group Packaging Inks is proud to help by providing inks &amp; coatings to support package printers around the world #COVID-19 #packaging https://t.co/vG5wTl3Y3x", "label": "extremely positive"}, {"sentence1": "$GGSM A LOOK AT THE WEEKLY &amp; MONTHLY PROGESS!!!! SILVER PRICES SET TO RISE RAPIDLY!!! THE WORLDS SUPPLY IS ON HALT DUE TO COVID-19.. DONT FALL ASLEEP DURING THIS!! $ftxp $igen $ewll $abce $biel $gcgx $tptw $fonu $pctl BEST CHART IN THE OTC AT THIS PRICE https://t.co/HO9hrlVKMD", "label": "extremely positive"}, {"sentence1": "My husband is a FedEx driver, and IÂ\u0092m shocked by how many people he says still answer the door. If a FedEx, UPS, or USPS person knocks, just let them leave the package outside. Signatures are not currently required. Wave through a window or say hi through the closed door, FFS.", "label": "extremely negative"}, {"sentence1": "#MythbustingMonday Will changing my diet stop me getting #coronavirus and can I still drink Corona Beer?\r\r\n-\r\r\nCabin fever anyone? After a week of virtual lockdown, empty supermarket shelves and a desperate hunt forÂ\u0085 https://t.co/LEzCHjO5Qy", "label": "extremely negative"}, {"sentence1": "Making the most of the sunshine and drying some recycled amp in the garden   All because of selfish people and leaving nothing on the shelves If you don t need it don t buy it We re all in this together", "label": "positive"}, {"sentence1": "The environment has never been as clean \r\r\n\r\r\nOil prices have never been as low   \r\r\n\r\r\nWhy did have to take a deadly virus to achieve both things?  #Coronavirus", "label": "negative"}, {"sentence1": "Scammers are taking advantage of #Coronavirus fears. The FTC + FDA have jointly issued warning letters to sellers of unapproved and misbranded products, claiming they can treat or prevent the virus.\r\r\n\r\r\nHere are some tips from the FTC to keep scammers at bay: https://t.co/tQfCxKmSfD https://t.co/RdWjALWbeB", "label": "negative"}, {"sentence1": "@afzaalaslamadv @ShanayHyderSHZ @FBRSpokesperson @PakPMO @PakistanPMDU Hi Azfaal. We have a responsibility as a leading consumer health care company to ensure access to safe and affordable products during outbreaks such as Covid-19 and would not alter pri", "label": "extremely positive"}, {"sentence1": "I was worried about being immuno-compromised and stocking my community food pantry now that COVID-19 is on my community... Luckily my neighbors have stepped in. They'll disinfect it and have asked me to place the food on my porch and they'll stock it for me. \r\r\n\r\r\nIt takes a village.", "label": "positive"}, {"sentence1": "Colleagues at Morrisons in Hadleigh club together to support elderly customer left in tears over lack of items on shelves, as panic buying and stockpiling continues due to #coronavirus pandemic https://t.co/TGGBhFSUtL", "label": "negative"}, {"sentence1": "? UK &amp; USA\r\r\n? International channels\r\r\n? Sports\r\r\n? Movies\r\r\n? PPV\r\r\n? VoD\r\r\n? Adult\r\r\n? Catch-up\r\r\n?? Watch two devices with multiview\r\r\n\r\r\nAll your TV needs sorted without a dish? and at AMAZING prices\r\r\n\r\r\nStart saving ??today\r\r\n\r\r\n#iOS #Android #FireStick #SmartTV #StayHomeSaveLives", "label": "extremely positive"}, {"sentence1": "Anyone under 70 and in good health who has booked a supermarket delivery but could go to the supermarket themselves should relinquish it now for those in greater need #coronavirus", "label": "extremely positive"}, {"sentence1": "Hey @Walmart why is everything that use to be sold online now in store only? I think you guys have it backwards. #walmart #walmartonline #shoponline #toiletpaper #storepickup #COVID19 #coronavirus #shopfromhome #workfromhome #outofstock #OnlineSafetyAtHome https://t.co/CRrPL8LXgh", "label": "neutral"}, {"sentence1": "Big Breaking : No community spread of #coronavirus in India yet. \r\r\nAll 826 random samples tested by ICMR found negative.", "label": "extremely negative"}, {"sentence1": "Do you support a full Lock Canada Down? This would be for 1 full month. No going out unless to Grocery Store, Drug Store or Hospital....\r\r\n\r\r\nWe have to end this virus in #canada and this is the only way to do it. #coronavirus #CoronaVirusCanada #LockdownCanada", "label": "positive"}, {"sentence1": "#Breaking \r\r\n\"No one should make a run to the grocery store to overstock...\" - @GovInslee \r\r\n#KOMONews #Covid19 #Coronavirus", "label": "negative"}, {"sentence1": "The influx of online shopping has created more opportunities for fraudsters. Learn more about new online patterns and how merchants can enhance their online experience while staying protected in this @CardNotPresent interview: https://t.co/5ufTm3d6XQ", "label": "positive"}, {"sentence1": "Indian Railways on Tuesday cancelled 85 trains due to low occupancy with CoronaVirus scares from March 18 to April 1 &amp; increased the prices of the platform tickets from ?10 to ?50 in 250 stations.\r\r\n\r\r\n#IndianRailways #SCR #Coronavirus #COVID19 #CoronavirusInIndia #MangoNews https://t.co/AUGW2LOikH", "label": "negative"}, {"sentence1": "Price gouging is illegal in California during the #coronavirus (COVID-19) state of emergency.\r\r\n\r\r\nSee or witness price gouging? Call 1.800.952.5225 or file a report at https://t.co/53CjxqJSdX. https://t.co/KLNPJ6mF7X", "label": "extremely negative"}, {"sentence1": "My office and I are keeping a close eye on prices of food and other essential items during #Covid_19 - important stores do not unfairly rip off customers. If you believe a business is acting unfairly, please click the link below and report it to @CMAgovUK \r\r\nhttps://t.co/K16wlSAKzI", "label": "positive"}]