[{"sentence1": "Grocery #store executives on the front lines: https://t.co/Hj0hvekLph", "label": "neutral"}, {"sentence1": "Price gouging is illegal in California during the #coronavirus (COVID-19) state of emergency.\r\r\n\r\r\nSee or witness price gouging? Call 1.800.952.5225 or file a report at https://t.co/53CjxqJSdX. https://t.co/KLNPJ6mF7X", "label": "extremely negative"}, {"sentence1": "I am ghost writing amp during This I m flexible on Prices You won t have to pay me until I have SOMETHING written I DO need a Down Payment before I send you all the lyrics though", "label": "positive"}, {"sentence1": "Do you support a full Lock Canada Down? This would be for 1 full month. No going out unless to Grocery Store, Drug Store or Hospital....\r\r\n\r\r\nWe have to end this virus in #canada and this is the only way to do it. #coronavirus #CoronaVirusCanada #LockdownCanada", "label": "positive"}, {"sentence1": "I was worried about being immuno-compromised and stocking my community food pantry now that COVID-19 is on my community... Luckily my neighbors have stepped in. They'll disinfect it and have asked me to place the food on my porch and they'll stock it for me. \r\r\n\r\r\nIt takes a village.", "label": "positive"}, {"sentence1": "#MythbustingMonday Will changing my diet stop me getting #coronavirus and can I still drink Corona Beer?\r\r\n-\r\r\nCabin fever anyone? After a week of virtual lockdown, empty supermarket shelves and a desperate hunt forÂ\u0085 https://t.co/LEzCHjO5Qy", "label": "extremely negative"}, {"sentence1": "We need to see this on everyone now @GMB #askDrH @piersmorgan my daughter was ridiculed in the supermarket when she went for food. @BorisJohnson #COVID?19 #COVIDIOTS #COVID19 #coronavirusuk #Covid_19 https://t.co/8Y4dNeygR3", "label": "negative"}, {"sentence1": "Unfortunately, fraudsters are finding ways to take advantage of #coronavirus fears. @ABABankers shares valuable insights and tips to avoid coronavirus scams so you can protect your money: https://t.co/tt6oWKkUZR #COVID19 https://t.co/0O2giNxja3", "label": "extremely negative"}, {"sentence1": "Please join us for a webinar on April 9th. We will discuss some of the key developments in the credit reporting space and their impact on consumer financial services businesses. For more details please visit below. #consumerfinance #covid19 https://t.co/v8Z8cJmiD0", "label": "extremely positive"}, {"sentence1": "Watch this $2 TRILLION bailout raise prices so much that it becomes the catalyst for widespread  #cryptocurreny adoption.\r\r\n\r\r\n#bitcoin #ethereum #bailout #coronavirus #StimulusPlan #crypto #ReliefBill", "label": "negative"}, {"sentence1": "The environment has never been as clean \r\r\n\r\r\nOil prices have never been as low   \r\r\n\r\r\nWhy did have to take a deadly virus to achieve both things?  #Coronavirus", "label": "negative"}, {"sentence1": "@dmoahi @Nondabz_N @MightiJamie You're now being futuristic,with a lot of online shopping, nobody will ever need a mall, the COVID-19 has been a game changer,this lockdown has proven that people can work at home so renting premises is  irrelevant. Office ", "label": "neutral"}, {"sentence1": "My office and I are keeping a close eye on prices of food and other essential items during #Covid_19 - important stores do not unfairly rip off customers. If you believe a business is acting unfairly, please click the link below and report it to @CMAgovUK \r\r\nhttps://t.co/K16wlSAKzI", "label": "positive"}, {"sentence1": "4/ \"Because of the fractured federal response to COVID-19, state governors say theyÂ\u0092re now bidding against federal agencies and each other for scarce supplies, driving up prices.\"\r\r\nApr 2, 2020 FEMA supply chain chief:\r\r\nThat's normally how things work, right?\r\r\nhttps://t.co/RwUSac0e3m", "label": "neutral"}, {"sentence1": "? UK &amp; USA\r\r\n? International channels\r\r\n? Sports\r\r\n? Movies\r\r\n? PPV\r\r\n? VoD\r\r\n? Adult\r\r\n? Catch-up\r\r\n?? Watch two devices with multiview\r\r\n\r\r\nAll your TV needs sorted without a dish? and at AMAZING prices\r\r\n\r\r\nStart saving ??today\r\r\n\r\r\n#iOS #Android #FireStick #SmartTV #StayHomeSaveLives", "label": "extremely positive"}, {"sentence1": "$GGSM A LOOK AT THE WEEKLY &amp; MONTHLY PROGESS!!!! SILVER PRICES SET TO RISE RAPIDLY!!! THE WORLDS SUPPLY IS ON HALT DUE TO COVID-19.. DONT FALL ASLEEP DURING THIS!! $ftxp $igen $ewll $abce $biel $gcgx $tptw $fonu $pctl BEST CHART IN THE OTC AT THIS PRICE https://t.co/HO9hrlVKMD", "label": "extremely positive"}, {"sentence1": "@afzaalaslamadv @ShanayHyderSHZ @FBRSpokesperson @PakPMO @PakistanPMDU Hi Azfaal. We have a responsibility as a leading consumer health care company to ensure access to safe and affordable products during outbreaks such as Covid-19 and would not alter pri", "label": "extremely positive"}, {"sentence1": "Stocks on #WallStreet slid on Monday over concerns of what the #coronavirus #pandemic will do to corporate earnings while #crude prices were mixed as a global deal on record output cuts failed to quell doubts the pact would head off an #oil glut.\r\r\nhttps://t.co/uB1dU2lWO7", "label": "extremely negative"}, {"sentence1": "#stocks to buy during the #CoronaCrisis -  \r\r\n#Shares of this rapidly growing quality #Retail, #Medical &amp; packaging companies  at low prices while the #USeconomy is shut down - TJX Cos, Medtronic PLC, Ball Corp. \r\r\n#TJX current reports at https://t.co/BNUZk8rTYE \r\r\nImage: InvestorPlace https://t.co/FhpB1FLDBE", "label": "negative"}, {"sentence1": "IÂ\u0092ve checked every CVS, Walgreens, and Rite Aid in a five mile radius, but nada #backpackingbear #shelterinplace #covid_19 #coronavirus #toiletpaper https://t.co/hoPVgTZmSZ", "label": "neutral"}]