[{"sentence1": "@GOPChairwoman @realDonaldTrump ...raising gas prices to support big business, slow to respond to Covid-19 protecting the stock market not peopleÂ\u0092s lives, does not open up Obama Care for those needing healthcare to protect ego, removes environmental cont", "label": "extremely positive"}, {"sentence1": "Printed flyers at stores may be phased out after COVID-19, marketing experts say | CBC News https://t.co/Y3gscd8riq", "label": "neutral"}, {"sentence1": "#COVID?19 #coronavirus #toiletpaper  all set to Rock n Roll https://t.co/Pgff3mVM04", "label": "neutral"}, {"sentence1": "Tips on making requests on   Ask consumer protection agencies for data on price gouging complaints   Ask authorities if surveillance techniques were used to track infected persons More here info Brad Schmidt", "label": "extremely negative"}, {"sentence1": "#CHCNewsflash: With the #coronavirus #COVID19  pandemic creating a huge spike in demand for groceries and other essential items, @Walmart #Walmart has halted the potential sale of a majority stake in #UK supermarket chain @asda #Asda to focus on managing its day-to-day business", "label": "positive"}, {"sentence1": "@stuartpstevens He was getting killed here in Texas over low oil prices. Many here fear more and longer damage to the Texas economy than COVID-19. He knows that if he loses Texas he's toast.", "label": "extremely negative"}, {"sentence1": "@antanddec What are supermarkets in Scotland doing amid #coronavirus? \r\r\n\r\r\nhttps://t.co/BGgn1INrwS", "label": "neutral"}, {"sentence1": "Is it safe to to go the grocery store right now? https://t.co/sNi6fjvTvg #coronavirus @HuffPost #grocerystore", "label": "positive"}, {"sentence1": "#BoycottHUL AS THE COMPANY HAS INCREASED THE PRICES OF ITS PRODUCTS. \r\r\nBloodsuckers.. Co. \r\r\n#covidindia #coronavirusindia #coronavirus \r\r\n@PMOIndia @narendramodi @FinMinIndia @MoHFW_INDIA \r\r\n@nsitharaman \r\r\nShame on @HUL_News \r\r\n@ZeeBusiness @AnilSinghvi_", "label": "negative"}, {"sentence1": "So, this is now a competition to own the rights to a vaccine.  Is any country going to give the vaccine recipe away to all?\r\r\n\r\r\nI'm sure that the private companies in the West will charge high prices for any vaccine and have patents coming out their arses.\r\r\n\r\r\nhttps://t.co/tnr6XOTj04", "label": "positive"}, {"sentence1": "Making the most of my pantry staples and \r\r\nroot veggies these days! \r\r\n\r\r\nHow are you trying to limit trips to the grocery store?\r\r\n\r\r\n50 Cent carrot #lentil soup: https://t.co/Opc66DU4CU\r\r\n\r\r\n#covid19Canada #COVID2019 #KeepCookingAndCarryOn \r\r\n#halfyourplate #rdchat  #QuarantineLife https://t.co/oH0DC531MN", "label": "neutral"}, {"sentence1": "In the midst of a 21st century pandemic, there are two types of peopleÂ\u0097the online shoppers and the precarious gig workers who serve them.\r\r\n\r\r\nbrutal line of argument from @jason_koebler:\r\r\n\r\r\nhttps://t.co/fft5qakyZW", "label": "extremely negative"}, {"sentence1": "Just wanted to start off the day saying THANK YOU to every -- \r\r\n\r\r\ngrocery store worker, pharmacist, and delivery worker that are helping us get though this together. #Covid_19 #Epidemic #baltimore", "label": "extremely positive"}, {"sentence1": "@DragoInter I was being a smart ass and tried to beat the market prices by selling my PS4 ahead of PS5 release date at the end of year, then COVID-19 madness came along.. so you can imagine how I feel.. ??thatÂ\u0092s me ? https://t.co/KgJdWpWjKF", "label": "negative"}, {"sentence1": "The new banger in town. \r\r\nAmazingly cheap prices.\r\r\n\r\r\n #COVID2019 https://t.co/T38S4IwX3f", "label": "neutral"}, {"sentence1": "After washing your hands, Remember to hold them together in Prayer.\r\r\nWhile stocking your stores with enough food, Remember to stock your heart with enough Holy Spirit.\r\r\nAs we prepare ourselves from Covid 19, Let us prepare our souls for our Heavenly Home.\r\r\nBe blessed.", "label": "extremely positive"}, {"sentence1": "A valuable lesson to all \"Keyboard Warriors\"... \r\r\n\r\r\nPay R3m or retract! Scare for Joburg dad who accused Spar of hiking prices \r\r\n https://t.co/UCrnnedXG6\r\r\n\r\r\n#Coronavirus #COVID19 #LockdownSA #Business #SocialMedia #Slander #Legal #CheckFacts #Process #Retail #Consequence", "label": "negative"}, {"sentence1": "My request is that the central government @PMOIndia , Chief Minister @ashokgehlot51 should keep all the small or bigger ,shops,supermarket, markets in Rajasthan closed for a few days.  Even If it is government or private. By that people will be safe from corona virus COVID-19.?", "label": "positive"}, {"sentence1": "Gov. Justice: We need to recognize the heroes in our grocery store workers #Covid_19 #COVID19 #WV #WVGov #CoronavirusPandemic #coronavirus @WTRF7News", "label": "extremely positive"}, {"sentence1": "If you suspect a #Coronavirus Scam, report it to the #ConsumerProtection Hotline at 1-800-351-4889 or fill out a consumer dispute form at https://t.co/bYlqXrjmNT. #lagov https://t.co/WjBBEr7I6W", "label": "extremely negative"}, {"sentence1": "The photos of supermarkets filled with empty shelves, and the stress of feeling like we have to rush out and purchase food, potentially leading to food hoarding and stock-piling can also be extremely triggering for people with #eatingdisorders #Covid_19 3/", "label": "negative"}, {"sentence1": "@sway_hi @Frontalfire @ippatel @dinesh_chawla @PiyushGoyal @PiyushGoyalOffc @narendramodi @PMOIndia @DrHVoffice @drharshvardhan So, are you going to finance private cabs at exorbitant prices for lakhs of healthcare providers who use public transport? ?\r\r\n", "label": "neutral"}, {"sentence1": "@Swimhat @Cannabistradin1 @SixtUSA This is crazy... @senatemajldr is stepping up to support and bail out the industries in need and @SixtUSA is holding consumer hostage when we want to protect our loved ones!  #coronavirus", "label": "extremely positive"}, {"sentence1": "If the #coronavirus is new why were they making hand sanitizer years ago??Right. @realDonaldTrump", "label": "positive"}, {"sentence1": "@metpoliceuk @CityPolice and @OLAFPress all report big spike in #coronavirus frauds, including online shopping scams, door-to-door conmen &amp; those selling fake face masks and sanitisers. Old people are especially vulnerable. #CoronaVirusUpdate  \r\r\nhttp", "label": "extremely negative"}, {"sentence1": "Fish tank treatment uses the same chemical in the drug Trump fast-tracked for treating coronavirus - and prices for it have surged to $500Â Â \r\r\nvia https://t.co/1xNglL2rih @realDonaldTrump @VP https://t.co/Uy6w9RwGS7", "label": "neutral"}, {"sentence1": "We have listened to feedback from you and from SainsburyÂ\u0092s colleagues across the country and wanted to share some of the extra steps we are taking to make sure everyone has access to the items that they need https://t.co/jRoCLm6CXt", "label": "positive"}, {"sentence1": "Angels of Reasi\r\r\nA group of volunteers under d guidance of DM #Reasi is helping district admin.  in reaching out to public for essential commodities. Control Room AD FCS &amp; CA Reasi: Whatsapp70067 47305\r\r\nCall 94192 45670 adcapdrsi@gmail.com www.twitter/ad_fcs https://t.co/wsqx9qLYmN", "label": "positive"}, {"sentence1": "Like if you all did some COVID-19 special data bundles won't it be nice.\r\r\nYou're giving us horrible service for the same high prices.\r\r\n#ReduceInternetprices", "label": "extremely positive"}, {"sentence1": "Crude oil dropped to its lowest in 17 years in Asia as #coronavirus in #US and #EU shows little sign of slowing.\r\r\n\r\r\nNoon prices:\r\r\n#SPX500Â\u00962504.3\r\r\n#NAS100Â\u00967507.1\r\r\n#WTIÂ\u009620.24\r\r\n#GOLDÂ\u00961618.08\r\r\n#SILVERÂ\u009614.118\r\r\n\r\r\nWatch these prices closely: https://t.co/WuiEEfSNOj\r\r\n\r\r\n#COVID19 #CoronaVirusOutbreak https://t.co/j68MZIDXAd https://t.co/9MyqGxutUU", "label": "extremely negative"}, {"sentence1": "Went out to panic buy food today but only came back with a fish. ?\r\r\n.\r\r\n.\r\r\n.\r\r\n#FishyFun #PanicBuying #KeepSmiling #CoronaVirus  #Covid_19 #CharityShopFind https://t.co/ucSdpvZgIO", "label": "negative"}, {"sentence1": "#Walmart CEO says, \"In the last five days, we've sold enough #toiletpaper for every American to have their own roll\":  #coronavirus #stayhome #panicbuying #hoarding\r\r\nhttps://t.co/mEMQPyu2AC via @TODAYshow", "label": "neutral"}, {"sentence1": "Make sure you and your clients are aware of these #coronavirus scams and know how to avoid them. https://t.co/ls7N3GtsDP", "label": "negative"}, {"sentence1": "Personally, I'd like to see less hatred &amp; panic re: #coronavirus &amp; more practical information about how to deal if u or someone u know has #COVID19. What is best way to get meds, food, etc? If you live in close quarters, what's best practice to keep all safe? This info needed.", "label": "extremely positive"}, {"sentence1": "Dear Katsinawa Daura has been locked down today following 3 positive cases of COVID 19 It is almost inevitable that lockdown will happen in the state don t be caught unawares stock up as much food as you can Remember wash your hands and don t touch your face ", "label": "extremely positive"}, {"sentence1": "??| Oil prices hit lowest level in 17 years as demand plunges\r\r\n\r\r\n#Market #hit #coronavirus #lockdowns #world #economy #Price #war #Oil #Demand #Trade #Plunge #Low #Petroleum #SapeiCS??\r\r\nhttps://t.co/Jm9q0cxdFO https://t.co/eAtgZE0ITE", "label": "negative"}, {"sentence1": "COVID-19: As virus crisis drives demand, @LondonFoodBank1 launches first virtual food drive https://t.co/mbshrhSyvi", "label": "extremely negative"}, {"sentence1": "Coronavirus How to avoid fraudsters during Covid 19 outbreak", "label": "extremely negative"}, {"sentence1": "Due to the COVID-19 outbreak, many dog owners have been forced to stock up on pet food. Find out what options you have if wet or dry food supplies run out.\r\r\n\r\r\nhttps://t.co/J5NyNBy7cb", "label": "negative"}, {"sentence1": "I can help you with fast-turnaround #Covid19usa / #coronavirus stories &amp; content. Specializing in consumer health and #B2B #healthcare content. View clips: https://t.co/yBEkwuQZhw  #nursewriter #freelancewriter #amwriting #healthcarecontent #contentmarketing", "label": "positive"}]